{
    "air_squat": {
        "form": {
            "Steps": "\n1. Stand with your feet about shoulder width apart. \n2. Squat as deep as possible. \n3. Reverse the movement, and return to a standing position.", 
            "Form": {
                "Foot position": "If you're a beginner, stand with your feet about shoulder-width apart, with toes pointing slightly outward. This provides a stable base and allows for proper knee tracking. Experiment with slight variations in foot placement to find what feels most comfortable and allows you to squat deepest with good form.", 
                "Shoulders": "Keep your shoulders down and back throughout the movement. Avoid letting them shrug up towards your ears, as this can make the movement less efficient, increase stress on the shoulder joint, and cause discomfort in the neck and shoulder area. Actively pull your shoulder blades down and back, as if trying to put them in your back pockets.", 
                "Core": "Engage your core muscles throughout the exercise. This helps maintain a stable spine and prevents excessive forward lean. Imagine bracing your core as if you were about to be punched in the stomach.", 
                "Depth": "Squat as deep as your mobility allows while maintaining good form. Aim to reach a depth where your thighs are at least parallel to the ground, or lower if possible. If you have mobility restrictions, work on improving your flexibility to gradually increase your squat depth.", 
                "Movement Control": "Perform the entire movement with full control. Avoid rushing or using momentum. Focus on smooth, deliberate movements, both on the descent and ascent. This helps develop strength and control throughout the entire range of motion."
            }
        }, 
        "tempo": "3010: 3 seconds eccentric phase (lowering the weight), 0 seconds at the bottom, 1 second for lifting (concentric phase), 0 seconds at the top. Why? Air squats are primarily for form and mobility, so a controlled 3-second eccentric emphasizes proper movement mechanics.", 
        "commonMistakes": {
            "Not keeping your shoulders down": "By letting your shoulders shrug up towards your ears, you’ll make the movement less efficient, increase the stress on the shoulder joint, and could cause discomfort in the neck and shoulder area rather than exercising the targeted muscles.", 
            "Half reps": "Since the air squat is a bodyweight exercise, it’s easy to start to cut off depth to be able to do more reps. Don’t do this. Focus instead on maintaining a full range of motion (in line with your mobility).", 
            "Not maintaining form": "Using momentum, swinging the body to complete the movement, arching your lower back, rather than relying on controlled, targeted muscle activation, is a common mistake while doing air squats.",
            "Back Rounding / Butt wink": "“Butt wink” is when your back rounds (e.g. your spine flexes) in the bottom of a squat. It is usually the symptom of one of three things: \n1. Lack of mobility. Your hip joints simply reach their maximum point of flexion, and to keep getting lower, your body has to round your back. \n2. Balance. With the stance, bar placement, bar weight, and your own body’s weight distribution, you might need to tuck your butt in to retain balance and not fall back. \n3. Motor control. You might have the requisite mobility and stance to squat without butt wink, but you lack the motor control to keep your spine erect (neutral spine) and stable.",
            "Goes Up on Toes in the Bottom": "If you find that your heels loose contact with the ground and that you shift your weight up on your toes in the bottom, you are likely having a mobility issue. Your body is simply trying to solve the task of squatting down deep enough without losing balance, and with the current movement strategy solves that by going up on your toes a little bit. Try to increase your general squat mobility (pro-tip).",
            "Knees Caving in": "Knees caving in somewhere on the way up is a common sight in especially new lifters, and seems more common in those who begin with low levels of strength and muscle mass in and around their legs and hips. Knees caving in might be a potential risk factor for knee injuries, and it is generally recommended to try and keep the knee in more of a straight line between your hips and feet. What is happening is that the muscles that adduct (“move in”) your thigh overpowers or outworks the muscles that abduct (“move out”) your thigh. Your adductors, especially adductor magnus, is a powerful hip extensor in the squat, but as the name implies it also adducts your leg. This movement will have to be countered by your hip abductors, two of which the bigger ones are gluteus maxmimus and medius. These muscles will have to get coordinated with each other, where they cooperate to help you squat effectively and safely. A good approach to make this happen is to squat with a rubber band around your knees, or have someone push your knees together. This will force you to activate your abductors (gluteus medius and maximus) more, and acts as a reminder to push your knees out. It might help engrain this in your nervous system, so that you do it even after you remove the resistance. Try this out during your warm-ups, or even in most of your squat sets for several workouts (maybe even weeks), and see if that does the trick."
        }, 
        "comments": {
            "Popularity": "The squat is known as “the king of all exercises” – and for good reason. Squats have been the staple for bodybuilders looking to grow their leg muscles for decades, and in strength and conditioning, they have been used (and still are used) to improve almost every athletic endeavor that is undertaken on two feet. A reminder here: Squats don’t work your hamstrings. They primarily work your quads, adductors, glutes, and lower back.",
            "How Deep Should You Squat?": "If you want general leg strength and maximal hypertrophy: Squat as deep as you safely can, at least down to parallel (= where your thigh is parallel to the floor).",
            "The Core Muscles and the Squat": "The core musculature is made up of at least a dozen muscles, both superficial (like your abs and spinal erectors) and deep (like your diaphragm and pelvic floor). The core muscles also surround your spine on all sides: the four abdominals (rectus abdominis, transversus abdominis, and the internal and external obliques) on the front and sides, and the large muscle group erector spinae on the back, are some of the larger ones. Depending on the challenge, different parts of your core will have to work. Are you loading your core from the front, like when standing in a plank, a push-up position, or pushing a car in front of you? Then your abdominals will have to work hard, especially your rectus abdominus and the anterior (forward-most) parts of your inner and outer obliques. Are you loading your core from the side, e.g. standing in a side plank, or carrying something heavy in one hand? Then your inner and outer obliques will have to work hard to keep you straight. Are you loading your core from the back? Like when you place a bar over your shoulders and do a good morning – or a barbell squat. Then the muscles on the back of your core will have to work hard, meaning your erector spinae and multifidus (= your back extensors). The posterior (back-most) parts of your obliques will also aid a little, but not much. Overall, your abs are not very active (nor do they need to be) when squatting. That is not to say that your abs aren’t working at all in a squat, but they are very unlikely to be a limiting factor for performance or technique. The confusion likely stems from confusion about the intra-abdominal pressure (IAP), the term describing that when you trap air in your lungs, and your guts and intestants in your abdomen, and tense the muscles surrounding all of this, you increase the pressure in your abdomen. This acts kind of like a supporting balloon of air, stabilizing your spine and torso. Your core muscles participate in creating this pressure, but that does not mean that all of your core muscles should be maximally active for every given task. The optimal core activation depends on what you are doing! During a squat, your core musculature is trying to keep the bar on your back, without flexing. This is solved by doing two things: 1. The back extensors are working as hard as they can to resist the barbell and keep the spine straight. 2. The other core muscles generate intra-abdominal pressure to aid the back extensors, without creating an unneccessarily large flexing force on the spine which would add to the workload of the back extensors. In summary, the squat does not train your abdominals to any high extent, nor should it be expected to do so. Don’t over-analyze the art of bracing during a squat. Focus on the rest of steps, and let your body figure out what muscles need to be contracted, how much, and when.",
            "Improving the Descent tempo":"The squat descent ideal tempo should be “As fast as you can while still maintaining control.”. In general, if your descent takes ages you are wasting energy and losing your rebound effect at the bottom. If you find that you descend very slowly and want to increase your speed, one way to address that is to train a little more in higher rep-ranges, like several sets around 10 reps or so. The high number of repetitions will subconsciously teach you to conserve your energy while you are repping, and thus might make you chip away at some of your technical unneccessarities, like a too-slow descent. Rotate this high-rep work with regular heavier training every now and then, and try to keep the speed in your heavier sets. It will not happen overnight, but can lead to big changes if you practice it during a regular training block of a month or two. Now, if you descend slowly and it works just fine for you – keep doing it! This is a highly individual technicality, and you must find what works for you. If you however feel that you might gain a little on the ascent if you could speed up your descent just a little bit, then it might be worth giving it some attention.",
            "Pro-tip: How to improve general squat mobility?":"There are two common problem areas where people lack the mobility to be able to perform the squat in a safe and efficient manner: the hips, and the ankles. 4 different ways to approach this to find a solution: \n1. Squat more. Using a joint in the desired movement is often the best way to improve its mobility and range of motion. If you’ve never squatted before, give yourself lot’s of time in the beginning to accustom yourself and your body to squatting. Your body will adapt, and you will get a little better each week. It might benefit you to spread your training volume over a little more workouts per week, to get more frequent practice. \n2. Experiment with stance. Try placing the bar lower, widening your stance, opening up your hips and pointing your toes out. This kind of low bar-style reduces the requirement of ankle mobility, but has higher requirements of hip mobility. Alternatively, try placing the bar higher on your back, feet closer together and toes poinint forward. This requires good ankle mobility, but lower hip mobility. \n3. Get lifting shoes with raised heels. A raised heel acts like “artificial ankle mobility”, and can work wonders for your squat technique. Test if shoes with a raised heel might be for you by placing your heels on small weight plates or a thin wooden plank or such, and squat. Note: We DO NOT recommend training like this, as it could easily lead to accidents. \n 4. Try to increase your joint mobility directly. A common exercise for increasing your mobility for the squat is to squat down and hold onto a support in front of you to keep your balance, and then try to stretch out everything that feels tight. You can also use a kettlebell or other weight for balance by holding it to your chest. Repeat this a few times daily for quick mobility gains, or as a warm-up before squatting. A more aggressive approach for increasing your ankle mobility is to squat down, and place a barbell on top of your knees, pushing them down. Hold it on top of your knees with your hands, and oscillate up and down in this position."
        }, 
        "alternativesAndVariations": {
            "Goblet Squat": "Holding a weight in front of your chest can help improve balance and core engagement.",
            "Box Squat": "Squatting to a box can help improve depth and control.", 
            "Jump Squat": "Adding a jump at the top of the squat can increase explosiveness."
        }
    },
    
    "band-assisted_bench_press": {
        "form": {
          "Steps": "1. Attach the resistance band under the bench, loop it around the barbell, and back under the bench., \n2. Lie on the bench with feet flat, back slightly arched, and shoulder blades retracted., \n3. Grip the barbell at your preferred width., \n4. Unrack the barbell and position it above your chest., \n5. Lower the barbell to your chest, keeping tension in your upper body., \n6. Press the barbell back up to the starting position against the band., \n7. Repeat for reps.",
          "Form": "Core and Posture: When you’ve jumped/climbed up to the starting position, make sure to embrace your core and to have a good posture. Keep your shoulders down and back. If you don’t keep the tension in your core, the movement will be much more unstable and wobbly. \nLegs: By crossing your ankles and having a slight bend in your knees, you’ll help to make the movement even more stable. Movement: Make sure to do the entire movement with full control. Do not rush, and keep your form strict. Your elbows should go backward, not out, and your shoulders should stay down and back. You should adapt the weight to your strength level: If the bar dip is too heavy for you, you can adjust the weight by taking a resistance band and placing it around your wrists. Let the band hang between your arms, forming a U shape. Place your feet or knees on the band, which will help you on the way up. If the exercise is too easy, you can add extra weight by getting a weight belt and attaching weight plates to it.  \nHand position: There are two major points to consider regarding how you grip the bar: 1. Your thumb must be on the opposing side of your other fingers, meaning that you grip around the bar: {grip_with_thumb}. I strongly recommend that you avoid using a thumbless grip (this is having the thumb in the same side than all fingers: {grip_suicide}). Firstly, it is not allowed in powerlifting. More importantly, it is also known as the suicide grip. This is because you can easily slip and drop the bar with a high risk of injury. Don’t use it. 2. The bar should rest in a comfortable place. As you’re lifting heavier and heavier weights, this might become tricky. For most people, the most comfortable and stable position is to hold the bar as close to the base of your palm as possible, i.e. close to or directly above your wrist. This minimizes the leverage the bar works on your wrist and makes it easier to hold. Combining the two points (keeping your thumb around the bar, while still keeping it low in your hand) above might be tricky, and one solution is to slightly rotate your hands inwards so that the barbell rests in a diagonal line in your palm. Don’t keep a completely straight wrist. This puts you at risk of losing balance, tilting your wrist forward, and dropping the barbell. Instead, tilt your wrist back slightly, to better rest the barbell in your hand. \nElbow Position: Where should your elbows be during the lift: close to your body or out to the sides? It depends on your grip width, your anatomy, and also your purpose with bench pressing. Grip width generally determines elbow position, with a wide grip typically leading to your elbows pointing out, and a close grip leading to your elbows being closer to your sides. If you bench press in order to grow your chest muscles, a rather wide elbow position and a wide grip is effective. If you bench press in order to train your triceps, a close grip with your elbows close to your sides is effective. If you want to lift as much weight as possible, something in between (around 45° to your sides) is probably best. You will, however, have to experiment for yourself and see what feels the best and suits your body. \nShoulder Blades: Your shoulders are mobile joints. But when you’re bench pressing, you want to trade some of that mobility for stability. Therefore, you will want to contract the scapulae (pull your shoulder blades down and back before you unrack the bar), and keep them in this position throughout the lift. If you don't know what this means, visualize that you’re putting them in your back pockets, but on the opposing side, i.e. your right shoulder blade into your left back pocket, and vice versa. Note that you will have to “set” your shoulder blades in this manner before you even unrack the bar, because when you’ve got a heavy bar in your hands, it’s too late. Then, your shoulder blades stay in this position until you re-rack the barbell again. That means you will keep your shoulder blades retracted and pulled down even as you’re pressing the bar up, which might require some practice. Pulling your shoulder blades down and back and keeping them in this position during your entire set will protect your shoulder joints and provide you with a solid base, enabling you to lift more. E: CONTINUE WITH FOOT POSITION."
        },
        "tempo": "2110 or 3010: 2 seconds eccentric phase (lowering the weight), 0-1 second at the bottom, 1 second for lifting (concentric phase). Why? The band helps most at the bottom of the lift, so a slightly slower eccentric (2-3 seconds) helps you control the weight and maximize muscle engagement throughout the range of motion. A brief pause at the bottom reinforces good form.",
        "commonMistakes": "1. Not keeping your shoulders down. By letting your shoulders shrug up towards your ears, you’ll make the movement less efficient, increase the stress on the shoulder joint, and could cause discomfort in the neck and shoulder area rather than exercising the targeted muscles. \n2. Half reps. Since the bar dip is quite a heavy exercise, it’s easy to start to cut off depth to be able to do more reps. Don’t do this. Focus instead on maintaining a full range of motion (in line with your mobility). If the movement is too heavy, add a resistance band to reduce some of the weight. \n3. Not maintaining form. Using momentum, swinging the body to complete the movement, arching your lower back, and/or flaring your elbows out to the sides, rather than relying on controlled, targeted muscle activation, is a common mistake while doing bar dips.",
        "comments": "The bench press against bands is a variation of the bench press in which resistance bands increase the tension as you press up. This makes it more challenging to lock out the lift, enhancing strength and power. It’s typically used to improve explosive strength and stability. Make sure to use the safety racks or to have a spotter while performing this exercise.",
        "alternativesAndVariations": "1. Bench Dip (puts more emphasis on your triceps, it's usually a bit easier). \n2. Bench Press: one of the most popular exercise, could be a good substitute if having shoulder pain when performing bar dips. \n3. Close-Grip Push-Up (more emphasis on your triceps)."
    },

    "bar_dip": {
        "form": "Grip and Hand Positioning: Make sure to find bars where you can grip about shoulder-width apart. If the bars are too far away from each other, you’ll end up with a weird movement for your shoulders, and it will be hard to maintain a proper form. If they are too close together, it will be hard to reach a good depth. ",
        "tempo": "2011. Why? Dips require a controlled descent to protect your shoulders. The 2-second eccentric helps with this. A smooth transition from the bottom to the top maintains tension in the triceps and chest.",
        "commonMistakes": " ",
        "comments": "The bar dip is a classic upper-body exercise, and for most people, heavy enough to give a good training effect with the body weight alone as resistance. The bar dip primarily targets your chest and front delts, and secondary targets the triceps. In a competitive event, the requirement for a successful repetition is often that your shoulder passes below your elbow joint, but in your own training, it is more important that you let your own capabilities determine how deep you go.",
        "alternativesAndVariations": " "
    },

    "barbell_squat":{
        "form": {
            "Steps": "\n1. Place the bar on your upper back. Inhale and brace your core slightly, and unrack the bar. \n2. Take two steps back, and adjust your foot position. \n3. Squat as deep as possible with good technique. \n4. With control, stop and reverse the movement, extending your hips and legs again. \n5. Exhale on the way up or exchange air in the top position. \n6. Inhale and repeat for reps.",
            "Form": {
                "Foot Position and Stance Width": "Squatting is possible with anything from a narrow stance to a wide stance. Typically, you want your knees to track in the same direction that your toes are pointing, which means that in a narrow stance your toes are usually pointing more or less forward, and in a wide stance your toes point quite a bit outward. Your stance width has large implications for your squatting biomechanics, as it affects how you will have to balance and position everything else above your feet and legs, namely – your body and the bar. If you stand with a narrow feet placement, with your toes pointed forward and let your knees track forward while squatting, you will generally (but not always) have to compensate by pushing your butt slightly further back and lean your torso slightly more forward to maintain balance. This will probably also be your most efficient lifting technique in this particular stance, where you distribute the work pretty evenly between the knee and hip extensors. The opposite would be a very wide stance. As you are not shifting any weight forward, you don’t need to send your hips back, and you don’t need to lean forward to maintain balance. It is therefore generally possible to squat with a more upright torso when you are using a wide stance, while still distributing the work evently across knee and hip extensors. This is especially true for lifters with long (relative to their body) femurs. By pointing your femurs out to the sides, you are essentially “shortening” them, and don’t need to compensate as much with the rest of your body.", 
                "Bar Position: High or Low?": "When squatting, you have the option of placing the bar either high or low on your back, and everywhere in between. High bar usually refers to you placing the bar high up on your shoulders, on top of your trapezius or posterior deltoids. Low bar usually refers to you placing the bar low on your shoulders, or even down on your upper back. A common placement is just above the upper ridge of your scapulas, and you will have to lean forward to create a small shelf for the bar to rest on to keep it still. There are no lines drawn in the sand where a bar placement goes from being “high” to “low”, and neither is it necessary. The bar placement will determine primarily two things: 1. The distance from the bar to your hips. With a low bar placement, you are bringing the barbell closer to your hips. That means you are decreasing the moment arm that your back and hip extensors works against. That, in turn, means you will be able to lift more weight with the same hip and back strength. 2. Your torso lean. If you place the bar lower down your back, you will have to lean forward more to keep your centre of gravity over your mid-foot. With a high bar placement, you can keep a more vertical torso. An exaggerated example of this effect is a front squat, where the weight is even further in front of your hips, and your torso even more vertical. 3. Knee / hip weight distribution. When you lean forward, you will have to counterbalance by pushing your hips back. This will redistribute some of the workload from your quadriceps to your hips. To counter the forward lean, and to avoid your abdomen and your thighs coming together and thus limiting your ability to reach depth, it is common to combine a low bar position with a wide stance. A wide stance gets your thighs out of the way for your abdomen, and as for balance, will help you maintain a slightly more vertical torso by “shortening” your femurs in the sagittal (side-view) plane.", 
                "Balance in the Squat": "The human body’s centre of mass – aka centre of gravity – is usually located somewhere around your belly button. As you move around, you are always keeping your centre of mass roughly above the middle of your foot – otherwise you’d lose balance and fall over. The same goes for squatting. As you squat down, you will need to keep your centre of mass roughly above the middle of your foot. You can correct slight deviations back and forth (weight going back on your heels or front on your toes) by using the muscles of your feet and calves, but not much. As you add a bar to the equation, you will have to take the bar’s centre of gravity in consideration as well. Or rather, your body will do that for you automatically, to keep you from falling forward or backward. This combined centre of gravity (you + the bar) will always be centered roughly above the middle of your foot. If you’d not keep the combined centre of gravity over the middle of your foot, you would fall over. The heavier the barbell, the less significant your own body’s centre of gravity will be in terms of balance. The lighter the barbell, the less significant it’s centre of gravity will be in terms of balance. The point is that your squatting technique will change depending on how much weight you’re lifting. It has some important technical implications: You don’t need to worry about “keeping the bar above your mid-foot”. Your body and sense of balance will take care of this by their own. If you fail to keep your combined centre of gravity roughly above the middle of your foot, you will fall forward or backward. If you squat an empty 20 kgs bar in the exact same path as a 400 kg bar, you will fall back. So don’t strive to lift an empty bar in a perfectly vertical line. That makes the faulty assumption that your own body doesn’t weigh anything. Most people will have an easier time squatting with a heavier weight than a light one. Because the barbell will be placed in front of their own centre of gravity, which will help them from falling back. Most people can easily squat pretty deep and with a quite vertical torso if they do a goblet squat (a squat with a weight held at their chest), because of the forward shift in balance. A heavier bar will cause this exact same shift, but since the bar is much closer to your own centre of gravity and the leverage thus is shorter, you will need more weight to feel the effects. So what is the practical application of this? Don’t feel bad if you are having troubles squatting deep with good technique with an empty bar or a wooden stick. Probably the weight is simply too light in relation to your own body weight. Try increasing the weight on the bar, and see what happens with your technique. Most likely, you will find that you can keep a slightly more vertical torso the heavier the bar gets, since you no longer will need to lean forward to maintain balance. Ditch the apps that draw a colorful line of your bar path when you film yourself from the side. The correct bar path will depend on 1) how much the bar weighs, and 2) how much you weigh. Your body will be able to keep your balance on it’s own. So if you shouldn’t focus on the bar path itself when it comes to technical analysis, what then? Well, a much better focus would be: How you position your feet, stance and bar (high vs low placement), How you distribute work between knee, hip and back extensors. Last but not least: keep training. As you keep accumulating experience squatting, you will consciously or subconsciously feel when microvariations in performance from rep to rep leads to a little better performance, and this will refine your technique as you keep squatting.",
                "The Descent": "You have reached the point where you’re standing, with your right stance and the bar on your back. Time to squat! If leveraging the right stance, bar position and squat depth, much regarding your descent is already reined in. You will now need to squat down to the depth that you need to reach. For the powerlifter, this will be just below parallel. One consideration to make: the order in which you move your joints. This will be an individual technical consideration, but there seems to be a majority of lifters that find that their squat feels a lot better when they initiate the movement by pushing their butt back. Or in other words: begin with the hips. Yes, if you were to monitor the knees and hips closely, you’d likely find that they both start flexing simultaneously, but the hips flex more than the knees in the initial part of the descent. To try this out, simply aim to lead with the hips next time you squat.",
                "The Turning Point": "This section covers what happens when you reach your deepest point during squat. The phenomenon called the “stretch-shortening cycle” refers to the fact that a muscle can contract more forcefully if it has first been stretched. It is the reason for why you can jump higher if you squat down slightly and then immediately reverse the movement and jump, compared to if you would squat down, wait three seconds, and then jump. It is the reason for why you can bench more touch-and-go-style than with a pause. I have referred to this as the rubber-band effect earlier in this article, because it’s main mechanism is likely that energy has been stored in the muscle and tendonds elastic tissue, which then acts like a spring. Most people may squat around 10 % more if they reverse the movement instantly compared to a several second long pause squat. Utilizing this stretch reflex effectively can thus bring rich dividends in terms of added weight. The counter-part is: how fast can you change the movement (how aggressively can you “bounce”) while still keeping control and avoiding injury? The forces placed on your lower body is twice as high if you decelerate the descending weight, turn the movement, and accelerate again in 0.5 instead of 1 second. This means that your tissues and technical integrity will have to withstand twice the force compared to the slower turn. Greater skill will be required to execute all the right muscle actions and retaining balance in a quicker turning. It might increase your risk of making a technical mistake. So, while a quick “bounce” might benefit your performance, it also bears its own risks. With the turn in the squat, you will have to find your own goldilocks-squat zone of “just right”.",
                "Un-Racking and Re-Racking the Bar": "Some details we can work on putting the bar back: 1. Correct rack height. For unracking  and re-racking the bar, set the rack so that you won’t have to go up on your toes. Squat it down, don’t good morning it. When you’ve walked into the racks and are about to set the bar down in the hooks, also make sure you squat it down rather than just bend forward like a good morning. The reason for this being that you will remain in a stronger position if something should go awry. You could miss the hooks or if you are using a light rack it might even fall over. Keep control over the bar and remain in a strong position until you’re home free."            }
        }, 
        "tempo": "X010: Typical example of this: 3 seconds eccentric phase (lowering the weight), 0 seconds at the bottom, 1 second for lifting (concentric phase). Why? A controlled eccentric (3 seconds) helps you maintain tension in the muscles, promotes hypertrophy, and reinforces good form. The explosive lifting phase (1 second) recruits the maximum number of muscle fibers and develops power. Important note: the tempo of the Descent should be as fast as you can while still maintaining control. Why? Two main reasons: 1. Energy conserving. A slow eccentric costs more energy than a quick one. 2. Rebound effect. The more you are capable of using your tendons and muscles elasticity for a rubber-band effect, the more help you will get out from the bottom. Now, no amount of rebound effect or energy conservation makes a difference if you injure yourself or miss the lift due to balance or some other technical error. Hence why we say “As fast as you can while still maintaining control.”", 
        "commonMistakes": {
            "Back Rounding / Butt wink": "“Butt wink” is when your back rounds (e.g. your spine flexes) in the bottom of a squat. It is usually the symptom of one of three things: \n1. Lack of mobility. Your hip joints simply reach their maximum point of flexion, and to keep getting lower, your body has to round your back. \n2. Balance. With the stance, bar placement, bar weight, and your own body’s weight distribution, you might need to tuck your butt in to retain balance and not fall back. \n3. Motor control. You might have the requisite mobility and stance to squat without butt wink, but you lack the motor control to keep your spine erect and stable. Is butt wink dangerous? We don’t really know for sure. If you do it and get lower back pain from it, then you should most likely avoid it. If you don’t get pain from it, you’re probably fine. But still, just like we recommend you to strive for a neutral back in our deadlift guide, we recommend you to strive for a neutral back while squatting, and it might be wise to work on it, to see if you can minimize it with time.",
            "Goes Up on Toes in the Bottom": "If you find that your heels loose contact with the ground and that you shift your weight up on your toes in the bottom, you are likely having a mobility issue. Your body is simply trying to solve the task of squatting down deep enough without losing balance, and with the current movement strategy solves that by going up on your toes a little bit.",
            "Knees Caving in": "Knees caving in somewhere on the way up is a common sight in especially new lifters, and seems more common in those who begin with low levels of strength and muscle mass in and around their legs and hips. Knees caving in might be a potential risk factor for knee injuries, and it is generally recommended to try and keep the knee in more of a straight line between your hips and feet. What is happening is that the muscles that adduct (“move in”) your thigh overpowers or outworks the muscles that abduct (“move out”) your thigh. Your adductors, especially adductor magnus, is a powerful hip extensor in the squat, but as the name implies it also adducts your leg. This movement will have to be countered by your hip abductors, two of which the bigger ones are gluteus maxmimus and medius. These muscles will have to get coordinated with each other, where they cooperate to help you squat effectively and safely. There are two good approaches to make this happen: 1. Squat with a rubber band around your knees, or have someone push your knees together. This will force you to activate your abductors (gluteus medius and maximus) more, and acts as a reminder to push your knees out. It might help engrain this in your nervous system, so that you do it even after you remove the resistance. Try this out during your warm-ups, or even in most of your squat sets for several workouts (maybe even weeks), and see if that does the trick. 2. Lower the weight and train with correct technique. This is the most obvious route: just lower the weight to a level where you can control it, and simply rack up good squat sets where you make sure to keep your knees out. This will also engrain this new technique adjustment, and from here you can gradually start increasing the weights again, without losing your new form.",
            "Hips Rise Too Fast (“Good Morning Squat”": "When weights are approaching 1RM, or you are getting close to failure, it is very common that the squat turns more and more into a so called “good morning squat”. This is the phenomenon where, after the turn in the bottom, you start to rise up, but your hips rise way faster than your shoulders (or the bar), leading to a very forward-leaning position. What is actually happening, when this occurs? The lift (after the bottom) gets separated into two distinct phases: 1. Your legs are extending, which raises your hip, but without moving the bar much or even at all. 2. Not until the legs are more extended and your torso angle is looking kind of like the beginning of a deadlift, does the bar finally start to move as you extend your hips and raise your torso. What is the biomechanical implication of this? Your legs extend without raising the bar much (or at all). This means that your quadriceps have extended without much or any resistance, which in turn means … Your hip and back extensors have to do all the heavy lifting. If your legs have extended but you are left in a forward leaning stance, that means you will have to lift the weight using the muscles that extend your hips and keep your spine straight, like in a good morning or a deadlift. Essentially, work has been shifted from the knee extensors to the hip and back extensors. There might be several reasons for this, but the most likely one is simply that your quads aren’t strong enough to extend against the weight bearing down on them, so they pass over part of the work to the hip extensors. It is very unlikely that this is due to a weak core or weak glutes, both of which seem to be common (mis-)conceptions. If your core or glutes are weak, it would make sense to pass work away from the core and glutes to your quadriceps, thus leading to a more upright, knee-dominant squat. Which is the complete opposite of a good morning-squat. Is it a problem? Not necessarily. It is rather an indicator of where your strengths and weaknesses are right now. Most people will be limited by their quad strength in the squat, and if you display this kind of lifting style, you are likely no exception. The solution in that case would be to focus training on the quadriceps, without overtraining them and risking injury. Here are three examples of routes you could take to prioritize your quad strength while still practicing the squat: 1. Train squats as usual, but add in extra direct quad work. Like leg extensions, leg presses, or bulgarian split squats. 2. Switch some of your squats to more quad-intensive variations where it is harder to pass over the work to the hips. Like front squats, safety bar squats, or zercher squats. 3. Train squats, but lower the weight and reps to the point where you can complete all reps without your hips shooting up. Counter the volume loss in weight and reps by increasing the number of sets."
        },
        "comments": {
            "Popularity": "The squat is known as “the king of all exercises” – and for good reason. Squats have been the staple for bodybuilders looking to grow their leg muscles for decades, and in strength and conditioning, they have been used (and still are used) to improve almost every athletic endeavor that is undertaken on two feet. A reminder here: Squats don’t work your hamstrings. They primarily work your quads, adductors, glutes, and lower back.",
            "Which Squat style to choose, narrow or wide stance -or something in between-?": "World records have been squatted by both styles, and the optimal choice for you is more a matter of individualization than “one style is better than the other”. Try out both narrow and wide stances and everything in between, and see what suits your body better. Some people find that they can squat decently with both a wide and a narrow stance, while others are more distinctly suited to one, and may even be unable to squat with the other. Since the squat is in some essence a balancing act (you must keep your body + the bar’s centre of gravity over the middle of your foot, or you will fall over), the decisions you make in one part of the squat technique, might affect other aspects.",
            "How Deep Should You Squat?": "If you want general leg strength and maximal hypertrophy: Squat as deep as you safely can, but at least down to parallel (= where your thigh is parallel to the floor).",
            "Which Joints Move First in the Descent?": "This will be a highly individual technical consideration. But, there do seem to be a majority of lifters that find that their squat feels a lot better when they initiate the movement by pushing their butt back. Or in other words: begin with the hips. Yes, if you were to monitor the knees and hips closely, you’d likely find that they both start flexing simultaneously, but the hips flex more than the knees in the initial part of the descent.",
            "Shoes": "Firstly and most important: Any shoe you might choose for squatting should be firm and stable. Squatting in a squishy running shoe will hinder your performance, and will in the worst case scenario set you up for an accident. Secondly: Flat or raised heel? Squatting requires a decent amount of ankle dorsiflexion – meaning, bending your ankle joint as you squat down. A narrow stance, feet forward squatting style usually requires more ankle dorsiflexion than a wide stance, feet outward style. Therefore, if you squat with the latter, you might only need to look for a firm and hard-soled shoe and then you’re set. But if you squat more narrow-stanced with feet forward, odds are that you might benefit from a shoe with a raised heel. These are typically called “weightlifting shoes” or “powerlifting shoes”, and come in a variety of brand and heel raise. Some peoples body types and squatting styles will mean that they will never have the need of shoes with a raised heel. For others, a raised heel might mean the difference between squatting pain-free or not. Before you make an expensive purchase, try out for yourself if shoes with a raised heel might be something for you. Stand with your heels on small weightplates (about an inch thick) while squatting with an easy load, and see how it feels. Note: We DO NOT recommend training like this, as it could easily lead to accidents.", 
            "The Core Muscles and the Squat": "The core musculature is made up of at least a dozen muscles, both superficial (like your abs and spinal erectors) and deep (like your diaphragm and pelvic floor). The core muscles also surround your spine on all sides: the four abdominals (rectus abdominis, transversus abdominis, and the internal and external obliques) on the front and sides, and the large muscle group erector spinae on the back, are some of the larger ones. Depending on the challenge, different parts of your core will have to work. Are you loading your core from the front, like when standing in a plank, a push-up position, or pushing a car in front of you? Then your abdominals will have to work hard, especially your rectus abdominus and the anterior (forward-most) parts of your inner and outer obliques. Are you loading your core from the side, e.g. standing in a side plank, or carrying something heavy in one hand? Then your inner and outer obliques will have to work hard to keep you straight. Are you loading your core from the back? Like when you place a bar over your shoulders and do a good morning – or a squat. Then the muscles on the back of your core will have to work hard, meaning your erector spinae and multifidus (= your back extensors). The posterior (back-most) parts of your obliques will also aid a little, but not much. Overall, your abs are not very active (nor do they need to be) when squatting. That is not to say that your abs aren’t working at all in a squat, but they are very unlikely to be a limiting factor for performance or technique. The confusion likely stems from confusion about the intra-abdominal pressure (IAP), the term describing that when you trap air in your lungs, and your guts and intestants in your abdomen, and tense the muscles surrounding all of this, you increase the pressure in your abdomen. This acts kind of like a supporting balloon of air, stabilizing your spine and torso. Your core muscles participate in creating this pressure, but that does not mean that all of your core muscles should be maximally active for every given task. The optimal core activation depends on what you are doing! During a squat, your core musculature is trying to keep the bar on your back, without flexing. This is solved by doing two things: 1. The back extensors are working as hard as they can to resist the barbell and keep the spine straight. 2. The other core muscles generate intra-abdominal pressure to aid the back extensors, without creating an unneccessarily large flexing force on the spine which would add to the workload of the back extensors. In summary, the squat does not train your abdominals to any high extent, nor should it be expected to do so. Don’t over-analyze the art of bracing during a squat. Focus on the rest of steps, and let your body figure out what muscles need to be contracted, how much, and when.",
            "Improving the Descent tempo":"The squat descent ideal tempo should be “As fast as you can while still maintaining control.”. In general, if your descent takes ages you are wasting energy and losing your rebound effect at the bottom. If you find that you descend very slowly and want to increase your speed, one way to address that is to train a little more in higher rep-ranges, like several sets around 10 reps or so. The high number of repetitions will subconsciously teach you to conserve your energy while you are repping, and thus might make you chip away at some of your technical unneccessarities, like a too-slow descent. Rotate this high-rep work with regular heavier training every now and then, and try to keep the speed in your heavier sets. It will not happen overnight, but can lead to big changes if you practice it during a regular training block of a month or two. Now, if you descend slowly and it works just fine for you – keep doing it! This is a highly individual technicality, and you must find what works for you. If you however feel that you might gain a little on the ascent if you could speed up your descent just a little bit, then it might be worth giving it some attention. ",
            "Pro tip on the Sticking Point and Lock-Out  - Just if you’re training at very heavy weights": "The sticking point in the squat is typically considered to be somewhere above parallel. If the weight is way too heavy for the lifter, they doesn’t even start lifting it. But when the weight is just barely too heavy, they seem to fail somewhere above parallel. When the thigh angle relative to the floor is 33°, you will (depending on your squat style) have squatted down to about a 70–80° knee flexion. That is, somewhere between a quarter and a half squat. Why does the sticking point occur here? The explanation may be the bounce. Due to the stretch-shortening cycle mentioned earlier, you get some help from your muscles’ and tendons’ elasticity, and this powers you through much of the demanding range of motion that is around the bottom and the parallel thigh position. But when the rubber band effect wears off, you are left to rely on your own muscle force, while still being pretty close to a very demanding position. Logically, this would mean that the sticking point of a pause squat (where you have eliminated the stretch reflex) is different from that of a normal squat. Intuitively, this may be the case: in a pause squat that is just barely too heavy, you’d get stuck lower than a 33° degree thigh angle. Perhaps around parallel, or even just below it? However, besides just making your knee and hip extensors stronger as well as trying to utilize the stretch-shortening cycle, there isn’t too much you can do about the sticking point. Except maybe one thing. There is a technique that some lifters use, which is to drive the hips under the bar when you reach or approach the sticking point. The rationale is that the demands of the knee extensors have decreased at that point, and by shifting your hips forward you might “lend” some work from the quadriceps to the hip extensors via this shift in moment arms. Good squatters utilize it often and it might be worth giving it a shot. If you clear the sticking point, the final lock-out will generally be a breeze.", 
            "How to Become Stronger in the Squat?": "The weight you can squat is determined by the amount of force you can produce in your muscles (primarily the extensors of the knees, hips and back) and transfer into the bar. To squat more weight, that is what you will have to improve. If you strip it down to the essentials, there are three different domains in which you can improve in order to accomplish this, and those are: 1. Muscle & tendon. This is your hardware. A bigger muscle produces more force, and a stiffer tendon transfers that force into your bones more efficiently. Skeletal muscle mass is strongly correlated with squat performance. To build bigger muscles, you simply have to train them in any reasonable way. Yes, strength gains can be quite specific in terms of vectors, but if you build bigger and stronger quadriceps using leg extensions (for example), you will still have bigger and stronger knee extensors when you go back to the squat. Tendons increase in stiffness from all heavy training, and the degree of specificity in terms of exercise choice is quite low here as well. Improvements in neuromuscular efficiency and especially technique require more specificity, and you will actually have to practice the lift in which you want to improve. Preferrably at pretty heavy loads. This means that you can roughly divide your squat training into two distinct parts, or goals: 1. Building bigger and stronger muscles. 2. Specific squat practice. Now, squatting in and of itself of course works all the relevant muscles for squatting, but limiting yourself to squats only might limit the amount of productive muscle-building training that you could do, and thus hamper your strength gains – especially in the long term, where muscle mass plays a greater role.",
            "Training Volume for the Squat": "The optimal training volume varies widely between individuals and is dependent on several factors, such as: Training status. The more accustomed you are to training, the more you can handle and will likely need. Age. Young to middle-aged adults likely recover easier than elderly ones. Nutrition. Calories and protein the currencies of adaption. The more you put in, the more you can spend. Recovery. Good sleep and low stress increases your ability to endure and adapt to the training. The relationship between strength (and hypertrophy) gains and training volume follows an inverted U-shape, where both too little and too much training leads to inferior gains. Some general volume recommendations in terms of working sets of squats: sets that are challenging, but are generally not performed to failure, instead leaving 1–2 reps in the tank. Low volume, 6–9 sets per week: This is a suitable volume for the beginner lifter that is simultaneously getting used to deadlifting maybe once a week, and thus is acclimatizing to a lot of new stress. It might also be suitable for the intermediate lifter that is either tapering, or taking a minimalistic approach to squatting while perhaps focusing on hypertrophy work for the squat musculature. Medium volume, 10–16 sets per week: The goldilocks zone, and probably a nice target volume for a majority of people in the intermediate stage. Recovery demands will be quite low if this is the only training you do for the lower body, but if you add in deadlifts and squat accessory training, the total volume will place quite high demands on your recovery. This might be a suitable volume for an advanced lifter who is tapering. High volume, 17–24 sets per week: For the intermediate lifter who is stuck on a plateu and wants his or her squat to ascend to the next level, or for the advanced lifter. Recovery demands are high, especially if this is coupled with deadlift training and accessory work. Most will have to gradually increase their volume to this level over a long period of time, and some lifters might simply find it to be too much for them, and that medium volume works better.",
            "Training Frequency for the Squat": "Training frequency might be an important mediator for training volume. Do you want to train a lot? Then sooner or later you’ll have to distribute the training on more days, before your current workouts swell beyond the scope of what is productive to do in one session. A rough limit on the number of work sets of squats in a single session might be somewhere in the neighbourhood of 10 sets. About 2–3 squat sessions per week is probably a good starting point for someone who also trains deadlifts or similar lower-body movements. Recovery after squatting seems to happen about as fast as recovery after both deadlifting and bench pressing. Habituation to a high training frequency thus seems most important.",
            "Load & Reps": "Your strength can improve from training with both high and low loads, but when you compare them head to head, lifting heavy weights is slightly more effective if you want to get better at lifting heavy weights. There are several rep and loading strategies that work, as long as you heed the principle of specificity (lifting heavy every once in a while) and progressive overload (adding weight or reps progressively). A couple of basic templates for how to structure your workouts in the context of the two principles mentioned above are: \n1. Pyramid training. Increase/decrease the weights in a pyramid fashion during your workout. E.g. go from 6–10 reps at 60% of 1RM, up to 1+ reps at 90%, and back down to 60% again. That way you’ll get some practice at heavier weights, while still getting a good amount of volume in. \n2. Slug away at 80%. The range of about 75–85% of 1RM is the powerlifters bread and butter. It’s heavy enough to be specific training for max attempts, but not so heavy that it burns you out. It’s typically possible to accumulate a large, effective volume at this intensity. Something like 6–10 sets x 2–4 reps might be appropriate for one workout.",
            "Pro-tip: How to improve general squat mobility?":"There are two common problem areas where people lack the mobility to be able to perform the squat in a safe and efficient manner: the hips, and the ankles. 4 different ways to approach this to find a solution: \n1. Squat more. Using a joint in the desired movement is often the best way to improve its mobility and range of motion. If you’ve never squatted before, give yourself lot’s of time in the beginning to accustom yourself and your body to squatting. Your body will adapt, and you will get a little better each week. It might benefit you to spread your training volume over a little more workouts per week, to get more frequent practice. \n2. Experiment with stance. Try placing the bar lower, widening your stance, opening up your hips and pointing your toes out. This kind of low bar-style reduces the requirement of ankle mobility, but has higher requirements of hip mobility. Alternatively, try placing the bar higher on your back, feet closer together and toes poinint forward. This requires good ankle mobility, but lower hip mobility. \n3. Get lifting shoes with raised heels. A raised heel acts like “artificial ankle mobility”, and can work wonders for your squat technique. Test if shoes with a raised heel might be for you by placing your heels on small weight plates or a thin wooden plank or such, and squat. Note: We DO NOT recommend training like this, as it could easily lead to accidents. \n 4. Try to increase your joint mobility directly. A common exercise for increasing your mobility for the squat is to squat down and hold onto a support in front of you to keep your balance, and then try to stretch out everything that feels tight. You can also use a kettlebell or other weight for balance by holding it to your chest. Repeat this a few times daily for quick mobility gains, or as a warm-up before squatting. A more aggressive approach for increasing your ankle mobility is to squat down, and place a barbell on top of your knees, pushing them down. Hold it on top of your knees with your hands, and oscillate up and down in this position."
        },
        "alternativesAndVariations": {
            "Hypertrophy: Exercises that will strengthen and grow the muscles used in the lift.": "The primary movers in the squat are the knee extensors (quadriceps), hip extensors (glutes, adductor magnus), and back extensors (erector spinae), so that is the muscles you should be most concerned about getting to grow. The options for hypertrophy exercises are many, and more a matter of personal preference than anything else. We will now share some exercises that you might use to supplement your training for the muscles involved in the squat. If you are not sure, we recommend to pick deadlift + 1–2 of the exercises below, and do 2–3 sets at 1–2 workouts per week. If you squat with a low volume (relative to your training level), you can increase the volume of supplementary exercises: 1. Deadlift (knee, hip and back extensors), 2. Front squat (knee, hip and back extensors), 3. Bulgarian split squat (knee and hip extensors), 4. Leg press (knee and hip extensors), 5. Belt squat (knee and hip extensors), 6. Leg extension (knee extensors), 7. Hip thrust (hip extensors), 8. Kettlebell swing (hip and back extensors), 9. Good morning (hip and back extensors).",
            "Technique: Exercises that strengthen the movement, or improve the performance or technique of the lift.":"These are generally more taxing than the hypertrophy exercises listed earlier, and also cut in more into your other squat volume. Working sets of the exercises listed below should probably be traded in for your regular sets of squats if you’re already training at a high volume, rather than piled on top of it. \n1. Pause squats. Can be used to improve overall technique, and strength around the position that you pause in. We generally recommend pausing in the bottom position, and for a count of three. Pausing in the bottom position also helps engraining a feeling of what correct depth is. \n2. Tempo squats. Slowing things down increases your control and body-awareness, and also gives to more time to correct errors. This can be used as an aid to improve technique, e.g. it could be used to correct errors like knees caving in, butt wink, and going up on the toes. You can choose to slow down the tempo on the way down, up, or both.\n3. Box squats. Can be used for a variety of purposes, including: Finding correct depth, limiting the movement in case of injury, practicing technique and body awareness in the bottom, and training your strength from the bottom. \n4. Front squats. Shifts the workload more to your quadriceps and unloads the hip extensors slightly. Increases the demands of especially upper back strength. It can be used to strengthen quadriceps and upper back, and teach a more upright squatting posture."
        }
    },

    "bench_press": {
        "form": {
            "Steps": "1. Lie on the bench, pull your shoulder blades together and down, and slightly arch your back. \n2. Grip the bar slightly wider than shoulder-width apart. \n3. Inhale, hold your breath, and unrack the bar. \n4. Lower the bar with control, until it touches your chest somewhere close to your sternum. \n5. Push the bar up to the starting position while exhaling. \n6. Take another breath while in the top position, and repeat for reps.",
            "Form": "Position on the Bench. In most bench press federations, the back of your head, your upper back, and your glutes must remain in contact with the bench at all times, and your feet must touch the floor. You should place yourself close enough to the bar so that you can easily unrack it. If you are too close to the foot end of the bench, unracking the bar will be excessively heavy. If you are too close to the head end, you will hit the rack with the bar when you’re lifting. A good rule of thumb is to lie down so that your eyes or nose are directly below the racked bar. This will be close enough for you to unrack it easily, but not close enough to hit the rack while you’re benching. If you’re tall, you can probably slide even closer to the head end without hitting the rack, and if you’re short, you might have to be a little bit closer to the foot end. \nHand position: There are two major points to consider regarding how you grip the bar: 1. Your thumb must be on the opposing side of your other fingers, meaning that you grip around the bar. 2. The bar should rest in a comfortable place. As you’re lifting heavier and heavier weights, this might become tricky. For most people, the most comfortable and stable position is to hold the bar as close to the base of your palm as possible, i.e. close to or directly above your wrist. This minimizes the leverage the bar works on your wrist and makes it easier to hold. Combining the two points (keeping your thumb around the bar, while still keeping it low in your hand) above might be tricky, and one solution is to slightly rotate your hands inwards so that the barbell rests in a diagonal line in your palm. Don’t keep a completely straight wrist. This puts you at risk of losing balance, tilting your wrist forward, and dropping the barbell. Instead, tilt your wrist back slightly, to better rest the barbell in your hand. \nShoulder Blades: Your shoulders are mobile joints. But when you’re bench pressing, you want to trade some of that mobility for stability. Therefore, you will want to contract the scapulae (pull your shoulder blades down and back before you unrack the bar), and keep them in this position throughout the lift. If you don't know what this means, visualize that you’re putting them in your back pockets, but on the opposing side, i.e. your right shoulder blade into your left back pocket, and vice versa. Note that you will have to “set” your shoulder blades in this manner before you even unrack the bar, because when you’ve got a heavy bar in your hands, it’s too late. Then, your shoulder blades stay in this position until you re-rack the barbell again. That means you will keep your shoulder blades retracted and pulled down even as you’re pressing the bar up, which might require some practice. Pulling your shoulder blades down and back and keeping them in this position during your entire set will protect your shoulder joints and provide you with a solid base, enabling you to lift more. \nFoot position: The goal of your foot position is to keep you stable and support you throughout the lift. You will want to place your feet firmly on the floor and keep them still throughout the lift. Don’t fidget with your feet, as that will rob you of any stability. Don’t move your feet around after you’ve unracked the bar. Plant them, unrack, and then keep your feet still until you’ve racked the bar again. An exception is if you go up on your toes when you’re unracking, but in that case, plant your feet on the floor again as soon as you’re in position. \nLeg Drive (pro): Leg drive simply means that you apply a slight push with your legs. This will contract and tense your leg muscles, which in turn makes your whole body a little harder and more stable. And as the bench press is a lift that thrives on stability, you will likely be able to lift a little more weight because of this. To use leg drive in the bench press, push with your legs like if you tried to slide yourself over the head end of the bench. Meaning, you should apply force horizontally with your feet, away from the foot end of the bench. Note that you should only apply just enough force so that your feet don’t move. Your feet should still be completely still throughout the entire lift. You’re only pushing just enough to stay within the limits of friction, in order to tense your legs and stabilize your body."
        },
        "tempo": "2010 or 3010. Why? A controlled eccentric is key for proper form and muscle activation. You can experiment with a 2- or 3-second eccentric based on your strength and experience.",
        "commonMistakes":"1. Use a thumbless grip (this is having the thumb in the same side than all fingers). Firstly, it is not allowed in powerlifting. More importantly, it is also known as the suicide grip. This is because you can easily slip and drop the bar with a high risk of injury. Don’t use it. \n2. Round shoulders instead of contracting the scapulae (right position is with shoulder blades down). \n3. Push your feet down into the floor when using leg drive. This will only lead to you lifting your butt off the bench, which is, once again, not allowed in competition and not a recommended technique. ",
        "comments": {
            "Popularity":"The barbell bench press is one of the most popular exercises in the world and one of the best chest exercises you can do",
            "How Wide Should You Grip the Bar?": "Your correct grip width will depend on your anatomy, and also your goal with the exercise. Typically, people are stronger (can lift more weight) with a wider grip than with a narrower grip. The wider you grip the bar, the greater is the contribution of your chest and front delts. Conversely, the narrower you grip the bar, the greater is the contribution of your triceps. In a wide-grip bench press, your chest and front delts contribute 78% of the force necessary to lift the bar, while your triceps contribute 22%. In a close-grip bench press, the same numbers are 63% vs. 37%. The maximum grip width allowed in powerlifting is 81 cm between your hands. A powerlifting bar has rings marking this distance, and so your maximum grip width is when your index fingers cover these rings.",
            "Elbow Position: Where should your elbows be during the lift, close to your body or out to the sides?": "It depends on your grip width, your anatomy, and also your purpose with bench pressing. Grip width generally determines elbow position, with a wide grip typically leading to your elbows pointing out, and a close grip leading to your elbows being closer to your sides. If you bench press in order to grow your chest muscles, a rather wide elbow position and a wide grip is effective. If you bench press in order to train your triceps, a close grip with your elbows close to your sides is effective. If you want to lift as much weight as possible, something in between (around 45° to your sides) is probably best. You will, however, have to experiment for yourself and see what feels the best and suits your body",
            "Pro tip on Foot position": "Place your feet somewhere where you feel comfortable, stable, where you are able to produce some manner of leg drive. If you don’t know where to start, try placing your feet about hip-width apart, with your legs bent at a 90-degree angle or slightly more.",
            "Should You Pause With the Bar on Your Chest, or “Touch and Go”?": "If you don’t train for powerlifting, pausing in the bottom position is optional. It probably doesn’t have any additional benefits for building muscle compared to a controlled reversal. It might, however, help you improve your technique because you slow things down and get more practice in one of the hardest parts of the lift. Similarly, pausing can improve your strength off your chest. Bench pressing without a pause on your chest is called touch and go. You lower the bar down and touch your chest, without neither pausing nor bouncing, and then press the bar up again. Avoid bouncing the bar on your chest. It puts you at risk of injuring your ribs or your sternum, which can put a stop to your training for a long time.",
            "Pro tip:": "Push-ups work the same muscles as the bench press (= your chest, front deltoid, and triceps) in a similar movement, and can therefore be used as an bench press accessory exercise."
        },
      "alternativesAndVariations": "1. Close-Grip Bench Press, which puts more emphasis on your triceps. \n2. Feet-Up Bench Press, which greatly inhibits the amount of arch you can create with your lower back, and thus forces you into a more flat bench press technique. This leads to a longer range of motion, which, in turn, might benefit both your strength gains and muscle growth. \n3. Close-Grip Feet-Up Bench Press, combining Close-Grip Bench Press and Feet-Up Bench Press. Greater triceps emphasis, more training for your lockout, and stability training. \n4. Incline Bench Press. Inclining the bench emphasizes your upper chest muscles and anterior deltoids. Typically, a slight decline of about 30° is enough to get this effect. A popular variation of the incline bench press is to trade the barbell for a pair of dumbbells and perform incline dumbbell presses instead. Many people feel that the freedom of motion of the dumbbells enable them to lift in a more comfortable movement path. \n5. Smith Machine Bench Press. Doing bench press in a Smith Machine has pros and cons. On the pro side is the extra stability, which might enable you to work your muscles a little harder than usual because you don’t have to worry about balance. On the negative side, we have the fact that a normal, free barbell bench press doesn’t move in a vertical bar path (see the section on bar path for more info). The smith machine, however, forces you to work in a straight line, which an experienced bench presser might perceive as uncomfortable."
    },

    "bench_press_against_band": {
        "form": {
            "Steps": "1. Attach the resistance band under the bench, loop it around the barbell, and back under the bench. \n2. Lie on the bench with feet flat, back slightly arched, and shoulder blades retracted. \n3. Grip the barbell at your preferred width. \n4. Unrack the barbell and position it above your chest. \n5. Lower the barbell to your chest, keeping tension in your upper body. \n6. Press the barbell back up to the starting position against the band. \n7. Repeat for reps.",
            "Form": "Position on the Bench. In most bench press federations, the back of your head, your upper back, and your glutes must remain in contact with the bench at all times, and your feet must touch the floor. You should place yourself close enough to the bar so that you can easily unrack it. If you are too close to the foot end of the bench, unracking the bar will be excessively heavy. If you are too close to the head end, you will hit the rack with the bar when you’re lifting. A good rule of thumb is to lie down so that your eyes or nose are directly below the racked bar. This will be close enough for you to unrack it easily, but not close enough to hit the rack while you’re benching. If you’re tall, you can probably slide even closer to the head end without hitting the rack, and if you’re short, you might have to be a little bit closer to the foot end. \nHand position: There are two major points to consider regarding how you grip the bar: 1. Your thumb must be on the opposing side of your other fingers, meaning that you grip around the bar. 2. The bar should rest in a comfortable place. As you’re lifting heavier and heavier weights, this might become tricky. For most people, the most comfortable and stable position is to hold the bar as close to the base of your palm as possible, i.e. close to or directly above your wrist. This minimizes the leverage the bar works on your wrist and makes it easier to hold. Combining the two points (keeping your thumb around the bar, while still keeping it low in your hand) above might be tricky, and one solution is to slightly rotate your hands inwards so that the barbell rests in a diagonal line in your palm. Don’t keep a completely straight wrist. This puts you at risk of losing balance, tilting your wrist forward, and dropping the barbell. Instead, tilt your wrist back slightly, to better rest the barbell in your hand. \nShoulder Blades: Your shoulders are mobile joints. But when you’re bench pressing, you want to trade some of that mobility for stability. Therefore, you will want to contract the scapulae (pull your shoulder blades down and back before you unrack the bar), and keep them in this position throughout the lift. If you don't know what this means, visualize that you’re putting them in your back pockets, but on the opposing side, i.e. your right shoulder blade into your left back pocket, and vice versa. Note that you will have to “set” your shoulder blades in this manner before you even unrack the bar, because when you’ve got a heavy bar in your hands, it’s too late. Then, your shoulder blades stay in this position until you re-rack the barbell again. That means you will keep your shoulder blades retracted and pulled down even as you’re pressing the bar up, which might require some practice. Pulling your shoulder blades down and back and keeping them in this position during your entire set will protect your shoulder joints and provide you with a solid base, enabling you to lift more. \nFoot position: The goal of your foot position is to keep you stable and support you throughout the lift. You will want to place your feet firmly on the floor and keep them still throughout the lift. Don’t fidget with your feet, as that will rob you of any stability. Don’t move your feet around after you’ve unracked the bar. Plant them, unrack, and then keep your feet still until you’ve racked the bar again. An exception is if you go up on your toes when you’re unracking, but in that case, plant your feet on the floor again as soon as you’re in position. \nLeg Drive (pro): Leg drive simply means that you apply a slight push with your legs. This will contract and tense your leg muscles, which in turn makes your whole body a little harder and more stable. And as the bench press is a lift that thrives on stability, you will likely be able to lift a little more weight because of this. To use leg drive in the bench press, push with your legs like if you tried to slide yourself over the head end of the bench. Meaning, you should apply force horizontally with your feet, away from the foot end of the bench. Note that you should only apply just enough force so that your feet don’t move. Your feet should still be completely still throughout the entire lift. You’re only pushing just enough to stay within the limits of friction, in order to tense your legs and stabilize your body."
        },
        "tempo": "2010 or 3010. Bands add accommodating resistance, making the lift harder at the top. The focus remains on a controlled eccentric, but the concentric might be slightly faster due to the band's assistance at the bottom.",
        "commonMistakes":"1. Use a thumbless grip (this is having the thumb in the same side than all fingers). Firstly, it is not allowed in powerlifting. More importantly, it is also known as the suicide grip. This is because you can easily slip and drop the bar with a high risk of injury. Don’t use it. \n2.Round shoulders instead of contracting the scapulae (right position is with shoulder blades down). \n3. Push your feet down into the floor when using leg drive. This will only lead to you lifting your butt off the bench, which is, once again, not allowed in competition and not a recommended technique.",
        "comments": "The bench press against bands is a variation of the bench press in which resistance bands increase the tension as you press up. This makes it more challenging to lock out the lift, enhancing strength and power. It’s typically used to improve explosive strength and stability. Make sure to use the safety racks or to have a spotter while performing this exercise.",
        "alternativesAndVariations": "Bench press and all its variations"
    },
    "board_press": {
        "form": {
            "Steps": "1. Lie on a bench and have a partner place a board on your chest. Alternatively, secure it with a band on the barbell. \n2. Grip the barbell at your desired width and unrack the weight. \n3. Lower the bar until it touches the board, and make sure to keep the tension in your upper body to maintain position. \n4. Press the barbell back up to the starting position in a controlled, explosive movement."
        },
        "tempo": "2010. Why? The board press emphasizes the top half of the bench press movement. A controlled eccentric is still important, and the brief pause at the top helps reinforce lockout strength.",
        "commonMistakes": "",
        "comments": "",
        "alternativesAndVariations": "Bench press and all its variations"
    },

    "cable_chest_press": {
        "form": {
            "Steps": "1. Fasten a pair of handles in the top position of a cable cross. Grip the handles, step forward, and lean slightly forward. \n2. Push the handles forward until they meet in front of your body. \n3. With control, let the handles go back to the starting position.",
            "Form":" "
        },
        "tempo": "2010. Why? Cables provide constant tension, so a 2-second eccentric and smooth transition to the concentric maintain that tension for optimal muscle growth.",
        "commonMistakes": " ",
        "comments": "Cable chest press is a pressing exercise with a different resistance curve than for example dumbbell chest press, as the direction of resistance comes more from the sides. That might make it easier to keep tension on the chest muscles throughout the whole movement, and thus possibly benefit muscle growth.",
        "alternativesAndVariations": "Dumbbel chest press, Bench press and all its variations."
    },

    "deadlift": {
        "form": {
            "Steps": "1. Step up close to the bar so that it is about over the middle of your foot. \n2. Bend over and grip the bar with hands about shoulder-width apart. \n3. Inhale, brace your core slightly, and lift the bar by extending your hips and knees. \n4. Pull the bar close to your body, with a straight back, until you are standing straight up, with hips and knees locked out. \n5. Lower the bar back to the ground with control. \n6. Take another breath, and repeat for reps.",
            "Form": {
                "1. Foot Position": "A rule of thumb is to point your toes in the same direction that your knee travels. This is not set in stone, however, and you still have some leeway to divert from this. You can choose to place your feet all the way together until your heels are touching. This will probably also require you to point your toes out a bit. More common and the best fit for most people, however, is to simply place the feet directly under your hip joints, with your toes pointing straight forward or only slightly out. What you’ll want to avoid is a stance so wide that your knees push your arms out. You’ll want your arms to be perpendicular to the floor as seen from the front, as this will result in the shortest and strongest range of motion. With a wide grip, you’d have to lean over more to reach the bar, resulting in a weaker starting position. It is a good idea to experiment a bit with different foot positions when you’re learning the deadlift, as your individual limb lengths will dictate what position suits you better.",
                "2. Arms": "The best visualization of your arms’ roles in the deadlift is to act like ropes, attaching the bar to your shoulders. Preferrably, these should also be both long and straight ropes, as that will allow you to maximize your starting height in the lift. The first few inches of a deadlift is the biomechanically weakest part of the lift, and the more you can extend your knees and hips from the start, the easier it will be to pass this point. If you deadlift with your arms bent or excessively wide, you will have to lean over more, and thus end up in a weaker starting position.",
                "3. Grip": "How to grip the bar? There are 4 common ways: \n1. Double overhand grip. This is the standard, intuitive way to grab a barbell. You simply hold on to it with both palms facing your body (pronated), and the thumbs opposing the other fingers. Pros: Comfortable and intuitive. The way you usually grab stuff. Symmetrical for your arms and shoulders. Cons: Weak! The barbell will want to roll out of your grip. This grip technique is usually fine for beginners learning the deadlift form, but quickly becomes a greatly limiting factor for how much you can lift. \n2. Hook grip. Common in weightlifting and  an evolution of the double overhand grip. Despite them being very similar, the hook grip increases the weights you can lift by 20–30% or more. You still grab the bar with a double overhand grip, with the difference that you stick your thumb under your index finger (and maybe also your middle finger). The thumb will act like a wedge or a chock and hinder the bar from rolling out of your grip. Pros: Much stronger than a regular overhand grip. Symmetrical for your arms and shoulders. Cons: Painful! It gets better with time, but will still be more uncomfortable than the normal way of gripping a bar. \n3. Mixed grip. Most common grip technique in powerlifting. Here, you counter the barbell’s rotation by supinating one hand – that is, turning one palm facing away from you. Like the hook grip, this greatly increases the weight you can lift. Pros: Much stronger than a regular overhand grip. Not very painful or wearing on your skin (compared to hook grip). Con: Asymmetrical for your arms and shoulders, which might transfer to an asymmetrical spine and hip position. It is unclear, however, if this actually is a problem. \n4. Lifting straps (not allowed in most powerlifting competitions). Pros: Using lifting straps will remove any grip related limitations for your pulls, will spare your skin, and also enable you to pull with a symmetrical overhand grip. Cons: 1. You won’t reap the benefit of developing your grip strength during training. 2. One more thing to carry around in your gym bag.",
                "4. Hip position": "How high should your hips be in the starting position of a deadlift? Should you begin in more of a “squat” position, or something more along the lines of a stiff-legged deadlift? The answer can be deduced from three instructions: 1. Keep your arms vertical as seen from the side (or very close to vertical) during the entire lift. This is easy: once the bar gets heavy enough, it’ll be positioned right below your shoulder joint, or at least very close to it. 2. Keep the systems (your body + the bar = the system) center of mass roughly above your mid foot. How do you find this position? It’s the position in which you don’t lose your balance forward or backward during the pull – e.g. where you’ll automatically end up positioning the bar to keep your balance, without thinking about it. You can explore and reinforce this position by performing a pause deadlift, with the pause very low towards the floor. 3. Keep your shins as close to the bar as possible while still allowing for number 1 and 2 above, as that will enable you to more effectively use both your knee and hip extensors. For many people, this means having your shins touching the bar. These three points will have narrowed down your possible hip starting height quite a lot, but there is still some leeway regarding the exact height. The final adjustments of your hip position will depend on your personal strengths and weaknesses, especially in your back, hip and knee extensors. If you have a strong back and strong hip extensors but weak knee extensors, you’ll be the strongest (and naturally drift towards) when you are a little bit more bent over and thus shifting more of the load towards your hip. If you have strong knee extensors but a weaker back or weak hip extensors, you’ll be the strongest (and naturally drift towards) when you have a more vertical torso and your shins/knees closer to the bar (or even past the bar, for taller lifters). Note that your ideal starting position probably is one that you already know and use. When we perform movements, we usually experience a bit of micro-variation. The movement simply doesn’t look exactly the same each rep, and if we by chance discover a slightly easier and more efficient way of performing a rep, we usually take notice – either consciously or subconsciously. That is why, as long as you’re not doing something fundamentally wrong – like keeping the bar way ahead of your shins – your current starting position is probably also your most effective one. At least right now. As your body and musculature changes with continued training, so will your strengths and weaknesses change. That means that the most effective deadlift position in the beginning of your lifting career, might not be the same as your most effective lifting position when you are on your peak. Do experiment with a slightly higher or lower hip position in the start – although my bet is that you’ll find that you’re either weaker with the new position, or will end up in your old position anyway when the load gets heavy enough.",
                "5. Back position & Bracing":"In general, you should deadlift with a neutral spine. Generally avoid lifting with a flexed back in your training, as it could increase your risk of injury – if you cannot maintain a neutral spine, lower the weight or perform less reps per set. To maintain a neutral spine, you can implement bracing, which refers to the act of keeping your core rigid during a lift. Start by taking a deep breath just before lifting, about 80% of maximum. Then, it’s time to tense up your core muscles. Effective deadlifting requires efficient force transfer. The force must be transferred from the bar, via your grip, arms and shoulders, through your torso down to your hips, and finally down via your legs and feet to the floor. A key to effective force transfer is stiffness, and this ties in with the previous section on bracing. Arms and legs won't heavily help here.  The core however, with it’s pelvis connected to the spine  is in great need of stabilization – especially in the conventional deadlift since it places greater demands on your low back. A braced and stiff core will be essential for effective force transfer. Before you push the pedal to the metal and revv up those strong prime movers in your back, hip and knee extensors, you’d better take a moment to make sure your core is good to go, and this is done by building tension. It is simply the act of consciously tensing your body to prepare it for what is about to come.",
                "6. Lift-Off":"The lift-off is really about nailing down two things: 1. Knowing your strongest pulling technique, and 2. Using and maintaining that technique. Your own strongest pulling technique will entail things like: how you distribute work between hip and knee extensors, what sequence and speed you will extend different joints in, and whether or not you are going to pull with a rounded or straight back. The deadlift is more segmented into three distinct phases: 1. Mostly knee extension, 2. Mostly hip extension, 3. Simultaneous knee and hip extension until lock-out. Some generally  helpful cues for lift-off: Push the floor away. Instead of pulling the barbell up, you focus on pushing the floor away, or down. Chest up, this is one of the best ways to help a lifter maintain a more straight back.",
                "7. Lock-Down":"Assuming you are strong enough to complete the lift, the lock-out part of a deadlift is  pretty simple. All you have to do is: extend your knees, hips and back, and keep your shoulder back for the lift to be considered completed. Simply drive your hips forward, kind of like a hip thrust. If you’re having troubles extending your spine in the top or having “soft knees” (not fully extended), a helpful visualization might be to imagine a chain attached to the top of your head, pulling you upwards.",
                "8. Setting the Bar Down":"How to set the bar down safely. acktrack your steps from the pull, even though we compress it slightly into two distinct phases: 1. Hip hinge. Initiate the eccentric by pushing your butt back and leaning your torso forward. The knees bend, but not as fast as your hip. Lower the bar along your legs like this until you’ve cleared the knees. 2. Knee bend. When the bar has cleared your knees, you are probably leaning as far forward as you’re going to get. At this point you take out the rest of the movement with your knees, and simply bend them until the bar touches the ground."
            }
        },
        "tempo": "11X1: 1021, 1031, oe 1041: 1 second to lift the weight explosively, 1 second to pause at the top, and control the bar on the way down for X seconds (2-4 seconds depending on the weight and individual preference). Why? The explosive lifting phase (1 second) recruits the maximum number of muscle fibers and develops power. Controlling the weight on the way down (eccentric phase) helps maintain tension in the muscles, promotes hypertrophy, and reinforces good form. The brief pause at the top prevents loss of tension and ensures continuous muscle engagement. The variable tempo (X) on the eccentric phase allows for individual adjustment based on experience level and training goals. Beginners may benefit from a slower descent (4 seconds) to focus on technique and control, while experienced lifters may use a faster tempo (2 seconds) to increase training volume and intensity.",
        "commonMistakes": {
            "Feet & Legs stance - Have  the stance is so wide that the knees push the elbows out":"This forces you to lean forward, thus bringing you closer to the floor, and into a biomechanically weaker position. Avoid this if possible. It may be, however, that your thighs and abdomen are too big for a narrow stance, and thus forcing you to adopt a stance similar to this.",
            "Arms - Bend the arms or grip the barbell excesively wide":"This will make you have to lean over more, and thus end up in a weaker starting position, making it harder to start the movement and increasing the injury risk.",
            "Hip position":"[E - Leave only if image present] Here (image) I am trying to show different hip positions. My anatomy doesn’t change between the pics, so only one of these three are really a viable option for me. The left pic with a high hip position is just fake posing: note the angle of the arm. As soon as I would try to lift a heavy weight that way, my arm would swing out to an angle perpendicular to the direction of gravity, and the moment arm from the weight to my hips would be very long and ineffective for heavy pulls. In the right pic with a low hip position on the other hand, the knees would be in the way of the bar. My personal starting position is the middle one. Just right for me."
        },
        "comments": {
            "Conventional or Sumo Deadlift?": "\n",
            "Discover your ideal Lift-Off position":"You will have to experiment to find out for yourself: Are you stronger when you let your butt shoot up in the start, or when your patiently push with your legs until the bar finally gives? Are you stronger when you deadlift with a straight back during the whole lift, or when you initally round your back but re-extend it during the lock-out? Your individual optimal deadlift technique will vary, but if we yet again shall revert to generalizations, we believe that most lifters will eventually have their greatest performances when they patiently let their quadriceps contribute to the lift, resulting in a pronounced knee extension in the start, as well as pulling with a more or less straight back through the first phase of the lift, thereby ridding themselves the task of re-extending their spine. So, how do you go about accomplishing this? Both depend on grooving the right neuromuscular motor patterns, which in plain English means train a lot. With the desired technique. With progressively heavier weights, as you get increasingly good at maintaining your technique with heavier weights. To train this, you will be needing some kind of feedback to discern whether you’re doing it right or wrong: A coach/friend/GymAlly who knows what to look for might give you feedback after a set or even after every rep.",
            "Strength advantage to controlled Eccentric":"Is there a strength advantage to setting the bar down slowly in your training (controlled Eccentric)? The tricky part of a deadlift is the way up – the concentric phase. That is what you compete with in powerlifting, and the way down (the eccentric phase) is mostly a formality, where the only rule is to lower the bar with control and maintaining your grip on it until it rests on the floor. However, for general training, it's good to know that several studies has compared the concentric strength gains from training protocols where you either perform concentric reps only or concentric+eccentric (that is, normal training) reps, and found that concentric+eccentric training yields greater concentric strength gains. This means that even if you perform twice as many reps where you set the bar down quickly (without really braking it’s fall), you’re still not getting as good gains as if you were to really slow down the bar, and lower it under, say, at least two seconds. Thus, a little bit more work and discomfort invested in your deadlift training in the shape of more prolonged eccentrics might pay good dividends.",
            "How to Become Stronger in the Deadlift?":"The weight you can lift in the deadlift is determined by the amount of force you can produce in your muscles (primarily the extensors of the hip, knee, and back) and transfer into the bar. To deadlift more weight, you must generate more force into the bar. There are three different domains in which you can improve in order to accomplish this: \n1. Muscle & tendon. A bigger muscle produces more force, and a stiffer tendon transfers that force into your bones more efficiently. Skeletal muscle mass is strongly correlated with deadlift performance. To build bigger muscles, you need to train them in any reasonable way. You can train them deadlifting, but also doing other exercises. E.g. If you build bigger and stronger glutes using hip thrusts, you will still have a bigger and stronger hip extensor when you go back to the deadlift. Tendons increase in stiffness from all heavy training. Improvements in neuromuscular efficiency and especially technique require more specificity, and you will actually have to practice the lift in which you want to improve. Preferrably at pretty heavy loads.",
            "Training Volume for the Deadlift":"The optimal training volume varies widely between individuals and is dependent on several factors, such as training status, age, nutrition (especially calories and protein ingestion), and recovery. The relationship between strength gains and training volume follows an inverted U-shape, where both too little and too much training leads to inferior gains. The key is to find the Optimal training volume. You’ll neither want to train too little nor too much for optimal gains. But if you have to choose, erring on the side of too little will at least spare you time and decrease your injury risk. Some general volume recommendations in terms of working sets of deadlifts. That is sets that are challenging but are generally not performed to failure but leaving 1–2 reps in the tank. \n1. Low volume, 3–5 sets per week: This is a suitable volume for the beginner lifter that is simultaneously getting used to squatting maybe 1–2 times a week and thus is acclimatizing to a lot of new stress. It might also be suitable for the intermediate lifter, either tapering or taking a minimalistic approach to deadlifting while perhaps focusing on hypertrophy work for the deadlifting musculature. \n2. Medium volume, 6–13 sets per week: The goldilocks zone, and probably a nice target volume for most people in the intermediate stage. Recovery demands will be quite low if this is the only training you do for the lower body, but if you add in squats and deadlift accessory training, the total volume will place quite high demands on your recovery. This might be a suitable volume for an advanced lifter who is tapering. \n3. High volume, 14–20 sets per week: For the intermediate lifter who is stuck on a plateau and wants his or her deadlift to ascend to the next level, or for the advanced lifter. Recovery demands are high, especially if this is coupled with squat training and accessory work. Most will have to gradually increase their volume to this level over a long time, and some lifters might find it too much for them, and that medium volume works better.",
            "Training for Muscles Used in the Deadlift":"For optimal deadlift gains, you will probably want to train the prime mover muscles more than you can do if you’d only use deadlifts, by doing assistance exercises. By varying your exercises, you can probably lower the risk of over-use injuries. Assistance exercises are usually for hypertrophy, in this case, exercises that strengthen and grow the muscles used in the lift. Major muscles worked in the deadlift: Knee extensors (Quadriceps), Hip extensors (Glutes, Hamstrings, Adductors), and Back extensors (Lower back). The options for hypertrophy exercises are many and more a matter of personal preference. However, here is a sample list of exercises that you might use to supplement your training for the muscles involved in the deadlift. If you are hitting squats and deadlifts hard, you might only want to pick 1–2 of the exercises below and do 2–3 sets x 1–2 workouts per week. If you deadlift with a low volume (relative to your training level), you can increase the volume of assistance exercises. Sample exercises: Squat (if you’re not already doing them) (knee, hip and back extensors), Bulgarian split squat (knee and hip extensors), Hip thrust (hip extensors), Kettlebell swing (hip and back extensors), Hyperextension (hip and back extensors), Good morning (hip and back extensors), Romanian deadlift (hip and back extensors), Barbell row (upper back and isometric training for back and hip extensors), Farmers walk (core, grip, trapezius, and stability training for hips)",
            "Training Frequency for the Deadlift":"Training frequency might be an important mediator for training volume. Do you want to train a lot? Well, sooner or later you’ll have to distribute the training on more days, before your current workouts swell beyond the scope of what is productive to do in one session. A rough limit on the number of work sets of deadlifts in a single session might be somewhere in the neighbourhood of 8-10 sets for an experienced lifter. About 1–2 deadlift sessions per week is not a bad starting point for someone who also trains squats or similar lower-body movements. Most lifters can probably do one hard deadlift session per week, while two sessions per week might require most lifters to dial down the intensity a bit. A classic recommendations for adapting to a larger workload that you might use for the deadlift is this: \n1. First increase the frequency. Go from one deadlift session to two, more or less by splitting your current training volume in two. \n 2. Then increase the volume. Slowly ramp up the volume by adding easy sets, so that you are well on the safe side of doing too much, too soon. \n 3. Finally increase the intensity (load). When you are accustomed to two deadlift sessions per week, you might start to increase the intensity of load you’re using.",
            "Load & Reps for the Deadlift":"Your strength can improve from training with both high and low loads, but when you compare them head to head, lifting heavy weights is slightly more effective if you want to get better at lifting heavy weights. There are several rep and loading strategies that work, as long as you heed the principle of specificity (i.e. lifting heavy every once in a while) and progressive overload (e.g. adding weight or reps). One basic template you could try is to Slug away at 75-80% of 1RM. That range is heavy enough to be specific training for max attempts, but not so heavy that it burns you out. It’s typically possible to accumulate a large, effective volume at this intensity. Something like 6-14 sets x 2–3 reps weekly might be appropriate for an intermediate level practitioner, divided in 1-2 sessions, and with an expected increase of 2.5kg per workout."
        },
        "alternativesAndVariations": {
            "Hypertrophy: Exercises that will strengthen and grow the muscles used in the lift.": "The primary movers in the deadlift are the knee extensors (quadriceps), hip extensors (glutes, hamstrings, adductors), and back extensors (mostly your lower back), so that is the muscles you should be most concerned about strengthening and growing. The options for hypertrophy exercises are many, and more a matter of personal preference than anything else. We will now share some exercises that you might use to supplement your training for the muscles involved in the squat. If you are not sure, we recommend to pick squats + 1–2 of the exercises below, and do 2–3 sets at 1–2 workouts per week. If you squat with a low volume (relative to your training level), you can increase the volume of supplementary exercises: 1. Squat (knee, hip and back extensors), 2. Bulgarian split squat (knee and hip extensors), 3. Hip thrust (hip extensors), 4. Kettlebell swing (hip and back extensors), 5. Hyperextension (hip and back extensors), 6. Good morning (hip and back extensors), 7. Romanian deadlift (hip and back extensors), 8. Barbell row (upper back and isometric training for back and hip extensors), 9. Farmers walk (core, grip, trapezius, and stability training for hips)",
            "Technique: Exercises that strengthen the movement, or improve the performance or technique of the lift.":"These are generally more taxing than the hypertrophy exercises listed earlier, and also cut in more into your other deadlift volume. Working sets of the exercises listed below should probably be traded in for your regular sets of deadlift if you’re already training at a high volume, rather than piled on top of it. \n1. Pause deadlifts. Can be used to improve overall technique and strength around the position that you pause in. We generally recommend pausing as close to the floor as possible (just 3-5cm or so above), and for a count of three. \n2. Deficit deadlifts. Can be used to challenge and strengthen the start in the deadlift, and also might bring about more training for your legs. Do these by standing on a weight plate or some sturdy block, around 1–4 inches high, so that you’ll have to reach down further to grab and lift the bar. \n3. Rack pulls. Useful for getting used to heavier weights in your hands, and overloading the later part of a deadlift. Choose rack height at your own discretion, but a common height is to begin with the bar just below your knees. \n4. Trap bar deadlifts. Distributes the work more evenly between hip and knee extensors, and unloads the back a bit. Can be useful for more balanced development of the lower body, and is a back-friendly substitute."
        }    
    },

    "dumbbell_curl": {
        "form": {
            "Steps": "\n1. Hold a pair of dumbbells in an underhand (supinated) grip, arms hanging by your sides.\n2. Lift the dumbbells with control, by flexing your elbows.\n3. Don’t let your upper arms travel back during the curl. Keep them at your sides, or move them slightly forward.\n4. Reverse the movement and lower the dumbbells back to the starting position.",
            "Form": {
                "1. Stance": "Stand with your feet shoulder-width apart, maintaining a slight bend in your knees.",
                "2. Grip": "Hold the dumbbells with an underhand grip (palms facing forward).",
                "3. Elbows": "Keep your elbows close to your body throughout the exercise.",
                "4. Posture": "Stand with your chest up and shoulders slightly retracted and depressed.",
                "5. Core": "Remember to keep a light tension in your core during the entire movement."
            }
        },
        "tempo": "2110: 2 seconds eccentric, 1 second concentric, 1 second pause at the top, and 0 seconds at the bottom. Why? A 2-second eccentric emphasizes the stretch and promotes muscle growth, while a 1-second concentric ensures a controlled lift. The brief pauses at the top and bottom maintain tension and prevent momentum.",
        "commonMistakes": {
            "1. Elbow positioning": "If your elbows move forward while you’re lifting the weight, it will put an additional load on your front delts, instead of focusing on your biceps. If your elbows move backward, you’ll also move the load from your biceps and be able to “cheat up” the weight.",
            "2. Using too heavy weights": "By adding more weight than you can lift, you might start to swing your body and use momentum to get the weight up. Another sign of using too much weight is if you’re not using the full range of motion and start doing half reps instead.",
            "3. Not locking your wrists": "Keep your wrists straight during the movement. If they’re bent, it can put an unnecessary load on them and lead to discomfort and maybe even injuries."
        },
        "comments": {
            "Popularity": "The Dumbbell Curl is a classic and effective exercise that targets the biceps. This exercise is renowned for its simplicity, all you need is a pair of dumbbells (of the same weight) and you’re ready to start pumping those biceps. Whether you’re looking to improve your arm strength, increase muscle mass, or simply tone your upper body, the Dumbbell Curl is an excellent choice.",
            "Benefits": "1. Stronger and bigger arms. Dumbbell curls primarily target the biceps brachii and brachialis muscles, which results in increased strength and size of the upper arms. \n2. Unilateral Training. Because you can perform curls with one arm at a time, dumbbell curls can help identify and correct muscular imbalances between your arms.\n3. Grip strength. Dumbbell curls can significantly enhance your grip strength, which can be beneficial for improving performance in other exercises and also in your daily life.\n4. Functional. Ironically enough, bicep curls are actually very functional, as they are one of the most common movements we do with our arms in our daily life.",
            "How many reps": "How many reps you should do of an exercise depends on your goal: do you mainly want to increase your strength or build muscle? Generally, a lower rep range of about 1–5 reps per set is most effective for strength gains. However, the dumbbell curl might not be the best option if you want to work in this rep range. Not only because of the instability of doing a unilateral exercise but also because it’s easy to start cheating when it gets too heavy. For muscle gains, a slightly higher rep range of about 8–15 reps per set is generally the most effective and practical. You can cycle in periods of working in this rep range, even if your goal is to get as strong as possible. Of course, you will see an increase in both muscle and strength regardless of which rep range you choose, but you can emphasize one or the other slightly by working in the right number of reps."
        },
        "alternativesAndVariations": {
            "1. Hammer Curl": "By switching from a supinated to a neutral grip in the dumbbell curl, it becomes a hammer curl instead. It is almost the same as the dumbbell curl, but it targets the muscles brachialis and brachioradialis a bit more.",
            "2. Barbell Curl": "Barbell curls often allow for heavier weights to be lifted, but they offer less range of motion and flexibility in your wrists. It could be easier for the beginner as it is a bit more stable than working unilateral (with one arm at a time).",
            "3. Machine Bicep Curl": "The machine curl provides more stability than the dumbbell curl, as it keeps you in a fixed path of motion. This might be beneficial, especially for beginners, or if you want to be able to focus on your biceps without any distractions like balance and stabilization. However, the machines typically have less versatility, with most offering a fixed grip width and position that might not fit everyone.",
            "4. Preacher Curl": "If you have difficulties getting good muscle contact in the barbell or dumbbell curl, the preacher curl might be a good alternative. By resting your upper arms on the sloping pad of the preacher bench, you get more stabilization, and it eliminates the possibility of moving your elbows and creating excessive momentum.",
            "5. Bodyweight Curl": "The bodyweight curl is a good alternative for training biceps if you don’t have access to any external weight. All you need is a TRX or something similar to hang on to, and then use your own body weight and gravity as resistance."
        }
    },

    "hip_thrust": {
        "form": {
            "Steps": "\n1. Sit on the floor with your back against a sturdy bench. \n2. Roll the barbell up over your thighs, until it is placed over your hips. \n3. Place your feet on the floor, about shoulder-width apart, with bent knees. \n4. Place your hands on the bar to stabilize it. \n5. Push the bar towards the ceiling by extending your hips. Your knees should form a ~90 degree angle at the top. \n6. Lower the weight and repeat for reps.",
            "Form": {
                "Bench": "We recommend placing something between the bar and your pelvis to soften the pressure from the bar, like a folded yoga mat, a towel, or a barbell pad."
            }
        },
        "tempo": "2011: 2 seconds eccentric phase (lowering the weight), 0 seconds at the bottom, 1 second for lifting (concentric phase), and 1 second pause at the top. Why? A controlled eccentric phase maximizes muscle engagement and a brief pause at the top ensures peak contraction of the glutes.",
        "commonMistakes": {
            "Raising hips too high": "Raising your hips too high can put excessive stress on your lower back and reduce glute activation. Ensure your hips rise only until your torso is parallel to the floor.",
            "Foot positioning": "Your feet should be flat on the floor with your heels hip-width apart and knees at a 90-degree angle at the top of the thrust. If your feet are too close, you'll feel it more in your quads, and if they're too far away, your hamstrings will take over.",
            "Not engaging core / Back arching": "Failing to engage your core can lead to lower back pain and instability. A visual proof of this is when someone hyperextends their back when doing hip thrust, especially during the eccentric phase, which could put unnecessary stress on your spine. Maintain a tight core throughout the exercise to protect your spine.",
            "Limited range of motion": "Not lowering your hips low enough or not extending them fully can reduce muscle activation and limit results. Aim for a full range of motion, feeling a stretch in your glutes at the bottom and a strong contraction at the top.",
            "Not squeezing your glutes": "The hip thrust is all about working your glutes, so make sure you're actually using them! Focus on squeezing your glutes at the top of the movement, during that 1-2 seconds at the top, as if you're trying to crush a walnut between your cheeks.",
            "Bench height": "The ideal bench height will depend on your leg length, but you generally want that your upper back rests on the bench somewhere around the middle of your shoulder blades, not your entire back or neck. This should allow your knees to be bent at a 90-degree angle with your feet flat on the floor when you're in starting position. If the bench is too high, you'll arch your back, and if it's too low, you'll have trouble driving through your heels."
        },
        "comments": "The hip thrust is an isolation exercise for your hip extensors, particularly your glutes. The exercise can be varied by using either one or two legs, by elevating your feet for a longer range of motion, or by adding an elastic band between your knees to train your hip abductors simultaneously.",
        "alternativesAndVariations": {
            "Romanian Deadlift":"Similarly to hip thrust, romanian deadlift focuses on glutes and harmstrings as primary muscles -slightly less than the hip thrust, but in return it adds focus on the lower back too-.",
            "Squat":"Similarly to hip thrust, squat (with weights) focuses heavily on working out your glutes. It's true that it results in slightly less glutes activity than the hip thrust, but in return it adds primary focus on the quadriceps, adductors, and lower back too-.",
            "Glute Bridge": "The glute bridge is a similar exercise to the hip thrust, but it is performed with your upper back on the floor instead of a bench. This makes the exercise slightly easier and reduces the range of motion."
        }
    },

    "kettlebell_swing:": {
        "form": {
            "steps": "1. Place a kettlebell on the ground, about one or two feet in front of you.\n2. Take a wide stance, lean forward and grip the kettlebell.\n3. Brace your core slightly, and swing the kettlebell back between your legs, while inhaling.\n4. Swing the kettlebell forward by extending your hip, while exhaling.\n5. Try to swing the kettlebell to about chest height.\n6. Repeat for reps and put the kettlebell back on the ground when you're finished.",
            "form": "Remember that it is the power from your hip and back that lifts the kettlebell, not your arms. The kettlebell swing is primarily an exercise for your glutes, back, and posterior thighs, and therefore you shouldn't bend your knees more than just slightly."
        },
        "tempo": "10X0: 1 second to lift the weight explosively, and control the kettlebell on the way down for X seconds (2-4 seconds depending on the weight and individual preference). Why? The explosive lifting phase (1 second) recruits the maximum number of muscle fibers and develops power. Controlling the weight on the way down (eccentric phase) helps maintain tension in the muscles, promotes hypertrophy, and reinforces good form. The variable tempo (X) on the eccentric phase allows for individual adjustment based on experience level and training goals. Beginners may benefit from a slower descent (4 seconds) to focus on technique and control, while experienced lifters may use a faster tempo (2 seconds) to increase training volume and intensity.",
        "commonMistakes": {
            "Squatting too much": "The kettlebell swing is primarily an exercise for your glutes, back, and posterior thighs, and therefore you shouldn't bend your knees more than just slightly. If you want to train your quads (front of the thigh) with a kettlebell, then goblet squats or front squats are a better alternative."
        },
        "comments": {
            "Alternatives to make the exercise heavier": "In order to make the exercise heavier, you can of course use a heavier kettlebell, but another alternative is to hold one lighter kettlebell in each hand.",
            "One-handed kettlebell swings": "Another alternative is one-handed kettlebell swings, where you hold a single kettlebell in only one hand. This will have you fighting to resist the rotational pull of the kettlebell, and thus increasing the training effect of the obliques.",
            "Cardio training": "Lastly, the kettlebell swing is an exercise that is also suited for cardio training, for example by training short, intensive intervals."
        },
        "alternativesAndVariations": {
            "Alternatives to train your quads": "1. Goblet Squat: Works more your quads, as you need to perform a deeper squat.\n2. Front Squat: Works more your quads, as you need to perform a deeper squat.",
            "Other variations": "3. American Swing: The kettlebell is swung overhead."
        }
    },

    "squat":  {
        "form": {
            "Steps": "1. Place the bar on your upper back. Inhale and brace your core slightly, and unrack the bar. \n2. Take two steps back, and adjust your foot position. \n3. Squat as deep as possible with good technique. \n4. With control, stop and reverse the movement, extending your hips and legs again. \n5. Exhale on the way up or exchange air in the top position. \n6. Inhale and repeat for reps.",
            "Form": {
                "Foot Position and Stance Width": "Squatting is possible with anything from a narrow stance to a wide stance. Typically, you want your knees to track in the same direction that your toes are pointing, which means that in a narrow stance your toes are usually pointing more or less forward, and in a wide stance your toes point quite a bit outward. Your stance width has large implications for your squatting biomechanics, as it affects how you will have to balance and position everything else above your feet and legs, namely – your body and the bar. If you stand with a narrow feet placement, with your toes pointed forward and let your knees track forward while squatting, you will generally (but not always) have to compensate by pushing your butt slightly further back and lean your torso slightly more forward to maintain balance. This will probably also be your most efficient lifting technique in this particular stance, where you distribute the work pretty evenly between the knee and hip extensors. The opposite would be a very wide stance. As you are not shifting any weight forward, you don’t need to send your hips back, and you don’t need to lean forward to maintain balance. It is therefore generally possible to squat with a more upright torso when you are using a wide stance, while still distributing the work evently across knee and hip extensors. This is especially true for lifters with long (relative to their body) femurs. By pointing your femurs out to the sides, you are essentially “shortening” them, and don’t need to compensate as much with the rest of your body.", 
                "Bar Position: High or Low?": "When squatting, you have the option of placing the bar either high or low on your back, and everywhere in between. High bar usually refers to you placing the bar high up on your shoulders, on top of your trapezius or posterior deltoids. Low bar usually refers to you placing the bar low on your shoulders, or even down on your upper back. A common placement is just above the upper ridge of your scapulas, and you will have to lean forward to create a small shelf for the bar to rest on to keep it still. There are no lines drawn in the sand where a bar placement goes from being “high” to “low”, and neither is it necessary. The bar placement will determine primarily two things: 1. The distance from the bar to your hips. With a low bar placement, you are bringing the barbell closer to your hips. That means you are decreasing the moment arm that your back and hip extensors works against. That, in turn, means you will be able to lift more weight with the same hip and back strength. 2. Your torso lean. If you place the bar lower down your back, you will have to lean forward more to keep your centre of gravity over your mid-foot. With a high bar placement, you can keep a more vertical torso. An exaggerated example of this effect is a front squat, where the weight is even further in front of your hips, and your torso even more vertical. 3. Knee / hip weight distribution. When you lean forward, you will have to counterbalance by pushing your hips back. This will redistribute some of the workload from your quadriceps to your hips. To counter the forward lean, and to avoid your abdomen and your thighs coming together and thus limiting your ability to reach depth, it is common to combine a low bar position with a wide stance. A wide stance gets your thighs out of the way for your abdomen, and as for balance, will help you maintain a slightly more vertical torso by “shortening” your femurs in the sagittal (side-view) plane.", 
                "Balance in the Squat": "The human body’s centre of mass – aka centre of gravity – is usually located somewhere around your belly button. As you move around, you are always keeping your centre of mass roughly above the middle of your foot – otherwise you’d lose balance and fall over. The same goes for squatting. As you squat down, you will need to keep your centre of mass roughly above the middle of your foot. You can correct slight deviations back and forth (weight going back on your heels or front on your toes) by using the muscles of your feet and calves, but not much. As you add a bar to the equation, you will have to take the bar’s centre of gravity in consideration as well. Or rather, your body will do that for you automatically, to keep you from falling forward or backward. This combined centre of gravity (you + the bar) will always be centered roughly above the middle of your foot. If you’d not keep the combined centre of gravity over the middle of your foot, you would fall over. The heavier the barbell, the less significant your own body’s centre of gravity will be in terms of balance. The lighter the barbell, the less significant it’s centre of gravity will be in terms of balance. The point is that your squatting technique will change depending on how much weight you’re lifting. It has some important technical implications: You don’t need to worry about “keeping the bar above your mid-foot”. Your body and sense of balance will take care of this by their own. If you fail to keep your combined centre of gravity roughly above the middle of your foot, you will fall forward or backward. If you squat an empty 20 kgs bar in the exact same path as a 400 kg bar, you will fall back. So don’t strive to lift an empty bar in a perfectly vertical line. That makes the faulty assumption that your own body doesn’t weigh anything. Most people will have an easier time squatting with a heavier weight than a light one. Because the barbell will be placed in front of their own centre of gravity, which will help them from falling back. Most people can easily squat pretty deep and with a quite vertical torso if they do a goblet squat (a squat with a weight held at their chest), because of the forward shift in balance. A heavier bar will cause this exact same shift, but since the bar is much closer to your own centre of gravity and the leverage thus is shorter, you will need more weight to feel the effects. So what is the practical application of this? Don’t feel bad if you are having troubles squatting deep with good technique with an empty bar or a wooden stick. Probably the weight is simply too light in relation to your own body weight. Try increasing the weight on the bar, and see what happens with your technique. Most likely, you will find that you can keep a slightly more vertical torso the heavier the bar gets, since you no longer will need to lean forward to maintain balance. Ditch the apps that draw a colorful line of your bar path when you film yourself from the side. The correct bar path will depend on 1) how much the bar weighs, and 2) how much you weigh. Your body will be able to keep your balance on it’s own. So if you shouldn’t focus on the bar path itself when it comes to technical analysis, what then? Well, a much better focus would be: How you position your feet, stance and bar (high vs low placement), How you distribute work between knee, hip and back extensors. Last but not least: keep training. As you keep accumulating experience squatting, you will consciously or subconsciously feel when microvariations in performance from rep to rep leads to a little better performance, and this will refine your technique as you keep squatting.",
                "The Descent": "You have reached the point where you’re standing, with your right stance and the bar on your back. Time to squat! If leveraging the right stance, bar position and squat depth, much regarding your descent is already reined in. You will now need to squat down to the depth that you need to reach. For the powerlifter, this will be just below parallel. One consideration to make: the order in which you move your joints. This will be an individual technical consideration, but there seems to be a majority of lifters that find that their squat feels a lot better when they initiate the movement by pushing their butt back. Or in other words: begin with the hips. Yes, if you were to monitor the knees and hips closely, you’d likely find that they both start flexing simultaneously, but the hips flex more than the knees in the initial part of the descent. To try this out, simply aim to lead with the hips next time you squat.",
                "The Turning Point": "This section covers what happens when you reach your deepest point during squat. The phenomenon called the “stretch-shortening cycle” refers to the fact that a muscle can contract more forcefully if it has first been stretched. It is the reason for why you can jump higher if you squat down slightly and then immediately reverse the movement and jump, compared to if you would squat down, wait three seconds, and then jump. It is the reason for why you can bench more touch-and-go-style than with a pause. I have referred to this as the rubber-band effect earlier in this article, because it’s main mechanism is likely that energy has been stored in the muscle and tendonds elastic tissue, which then acts like a spring. Most people may squat around 10 % more if they reverse the movement instantly compared to a several second long pause squat. Utilizing this stretch reflex effectively can thus bring rich dividends in terms of added weight. The counter-part is: how fast can you change the movement (how aggressively can you “bounce”) while still keeping control and avoiding injury? The forces placed on your lower body is twice as high if you decelerate the descending weight, turn the movement, and accelerate again in 0.5 instead of 1 second. This means that your tissues and technical integrity will have to withstand twice the force compared to the slower turn. Greater skill will be required to execute all the right muscle actions and retaining balance in a quicker turning. It might increase your risk of making a technical mistake. So, while a quick “bounce” might benefit your performance, it also bears its own risks. With the turn in the squat, you will have to find your own goldilocks-squat zone of “just right”.",
                "Un-Racking and Re-Racking the Bar": "Some details we can work on putting the bar back: 1. Correct rack height. For unracking  and re-racking the bar, set the rack so that you won’t have to go up on your toes. Squat it down, don’t good morning it. When you’ve walked into the racks and are about to set the bar down in the hooks, also make sure you squat it down rather than just bend forward like a good morning. The reason for this being that you will remain in a stronger position if something should go awry. You could miss the hooks or if you are using a light rack it might even fall over. Keep control over the bar and remain in a strong position until you’re home free."            }
        }, 
        "tempo": "X010: Typical example of this: 3 seconds eccentric phase (lowering the weight), 0 seconds at the bottom, 1 second for lifting (concentric phase). Why? A controlled eccentric (3 seconds) helps you maintain tension in the muscles, promotes hypertrophy, and reinforces good form. The explosive lifting phase (1 second) recruits the maximum number of muscle fibers and develops power. Important note: the tempo of the Descent should be as fast as you can while still maintaining control. Why? Two main reasons: 1. Energy conserving. A slow eccentric costs more energy than a quick one. 2. Rebound effect. The more you are capable of using your tendons and muscles elasticity for a rubber-band effect, the more help you will get out from the bottom. Now, no amount of rebound effect or energy conservation makes a difference if you injure yourself or miss the lift due to balance or some other technical error. Hence why we say “As fast as you can while still maintaining control.”", 
        "commonMistakes": {
            "Back Rounding / Butt wink": "“Butt wink” is when your back rounds (e.g. your spine flexes) in the bottom of a squat. It is usually the symptom of one of three things: \n1. Lack of mobility. Your hip joints simply reach their maximum point of flexion, and to keep getting lower, your body has to round your back. \n2. Balance. With the stance, bar placement, bar weight, and your own body’s weight distribution, you might need to tuck your butt in to retain balance and not fall back. \n3. Motor control. You might have the requisite mobility and stance to squat without butt wink, but you lack the motor control to keep your spine erect and stable. Is butt wink dangerous? We don’t really know for sure. If you do it and get lower back pain from it, then you should most likely avoid it. If you don’t get pain from it, you’re probably fine. But still, just like we recommend you to strive for a neutral back in our deadlift guide, we recommend you to strive for a neutral back while squatting, and it might be wise to work on it, to see if you can minimize it with time.",
            "Goes Up on Toes in the Bottom": "If you find that your heels loose contact with the ground and that you shift your weight up on your toes in the bottom, you are likely having a mobility issue. Your body is simply trying to solve the task of squatting down deep enough without losing balance, and with the current movement strategy solves that by going up on your toes a little bit. Try the tips outlined in the section on general squat mobility.",
            "Knees Caving in": "Knees caving in somewhere on the way up is a common sight in especially new lifters, and seems more common in those who begin with low levels of strength and muscle mass in and around their legs and hips. It is common among young, adolescent girls that might have had a growth spurt, but whose muscle mass hasn’t yet catched up. Knees caving in might be a potential risk factor for knee injuries, and it is generally recommended to try and keep the knee in more of a straight line between your hips and feet. What is happening is that the muscles that adduct (“move in”) your thigh overpowers or outworks the muscles that abduct (“move out”) your thigh. Your adductors, especially adductor magnus, is a powerful hip extensor in the squat, but as the name implies it also adducts your leg. This movement will have to be countered by your hip abductors, two of which the bigger ones are gluteus maxmimus and medius. These muscles will have to get coordinated with each other, where they cooperate to help you squat effectively and safely. There are two good approaches to make this happen: 1. Squat with a rubber band around your knees, or have someone push your knees together. This will force you to activate your abductors (gluteus medius and maximus) more, and acts as a reminder to push your knees out. It might help engrain this in your nervous system, so that you do it even after you remove the resistance. Try this out during your warm-ups, or even in most of your squat sets for several workouts (maybe even weeks), and see if that does the trick. 2. Lower the weight and train with correct technique. This is the most obvious route: just lower the weight to a level where you can control it, and simply rack up good squat sets where you make sure to keep your knees out. This will also engrain this new technique adjustment, and from here you can gradually start increasing the weights again, without losing your new form.",
            "Hips Rise Too Fast (“Good Morning Squat”": "When weights are approaching 1RM, or you are getting close to failure, it is very common that the squat turns more and more into a so called “good morning squat”. This is the phenomenon where, after the turn in the bottom, you start to rise up, but your hips rise way faster than your shoulders (or the bar), leading to a very forward-leaning position. What is actually happening, when this occurs? The lift (after the bottom) gets separated into two distinct phases: 1. Your legs are extending, which raises your hip, but without moving the bar much or even at all. 2. Not until the legs are more extended and your torso angle is looking kind of like the beginning of a deadlift, does the bar finally start to move as you extend your hips and raise your torso. What is the biomechanical implication of this? Your legs extend without raising the bar much (or at all). This means that your quadriceps have extended without much or any resistance, which in turn means … Your hip and back extensors have to do all the heavy lifting. If your legs have extended but you are left in a forward leaning stance, that means you will have to lift the weight using the muscles that extend your hips and keep your spine straight, like in a good morning or a deadlift. Essentially, work has been shifted from the knee extensors to the hip and back extensors. There might be several reasons for this, but the most likely one is simply that your quads aren’t strong enough to extend against the weight bearing down on them, so they pass over part of the work to the hip extensors. It is very unlikely that this is due to a weak core or weak glutes, both of which seem to be common (mis-)conceptions. If your core or glutes are weak, it would make sense to pass work away from the core and glutes to your quadriceps, thus leading to a more upright, knee-dominant squat. Which is the complete opposite of a good morning-squat. Is it a problem? Not necessarily. It is rather an indicator of where your strengths and weaknesses are right now. Most people will be limited by their quad strength in the squat, and if you display this kind of lifting style, you are likely no exception. The solution in that case would be to focus training on the quadriceps, without overtraining them and risking injury. Here are three examples of routes you could take to prioritize your quad strength while still practicing the squat: 1. Train squats as usual, but add in extra direct quad work. Like leg extensions, leg presses, or bulgarian split squats. 2. Switch some of your squats to more quad-intensive variations where it is harder to pass over the work to the hips. Like front squats, safety bar squats, or zercher squats. 3. Train squats, but lower the weight and reps to the point where you can complete all reps without your hips shooting up. Counter the volume loss in weight and reps by increasing the number of sets."
        },
        "comments": {
            "Popularity": "The squat is known as “the king of all exercises” – and for good reason. Squats have been the staple for bodybuilders looking to grow their leg muscles for decades, and in strength and conditioning, they have been used (and still are used) to improve almost every athletic endeavor that is undertaken on two feet. A reminder here: Squats don’t work your hamstrings. They primarily work your quads, adductors, glutes, and lower back.",
            "Which Squat style to choose, narrow or wide stance -or something in between-?": "World records have been squatted by both styles, and the optimal choice for you is more a matter of individualization than “one style is better than the other”. Try out both narrow and wide stances and everything in between, and see what suits your body better. Some people find that they can squat decently with both a wide and a narrow stance, while others are more distinctly suited to one, and may even be unable to squat with the other. Since the squat is in some essence a balancing act (you must keep your body + the bar’s centre of gravity over the middle of your foot, or you will fall over), the decisions you make in one part of the squat technique, might affect other aspects.",
            "How Deep Should You Squat?": "If you want general leg strength and maximal hypertrophy: Squat as deep as you safely can, but at least down to parallel (= where your thigh is parallel to the floor).",
            "Which Joints Move First in the Descent?": "This will be a highly individual technical consideration. But, there do seem to be a majority of lifters that find that their squat feels a lot better when they initiate the movement by pushing their butt back. Or in other words: begin with the hips. Yes, if you were to monitor the knees and hips closely, you’d likely find that they both start flexing simultaneously, but the hips flex more than the knees in the initial part of the descent.",
            "Shoes": "Firstly and most important: Any shoe you might choose for squatting should be firm and stable. Squatting in a squishy running shoe will hinder your performance, and will in the worst case scenario set you up for an accident. Secondly: Flat or raised heel? Squatting requires a decent amount of ankle dorsiflexion – meaning, bending your ankle joint as you squat down. A narrow stance, feet forward squatting style usually requires more ankle dorsiflexion than a wide stance, feet outward style. Therefore, if you squat with the latter, you might only need to look for a firm and hard-soled shoe and then you’re set. But if you squat more narrow-stanced with feet forward, odds are that you might benefit from a shoe with a raised heel. These are typically called “weightlifting shoes” or “powerlifting shoes”, and come in a variety of brand and heel raise. Some peoples body types and squatting styles will mean that they will never have the need of shoes with a raised heel. For others, a raised heel might mean the difference between squatting pain-free or not. Before you make an expensive purchase, try out for yourself if shoes with a raised heel might be something for you. Stand with your heels on small weightplates (about an inch thick) while squatting with an easy load, and see how it feels. Note: We DO NOT recommend training like this, as it could easily lead to accidents.", 
            "The Core Muscles and the Squat": "The core musculature is made up of at least a dozen muscles, both superficial (like your abs and spinal erectors) and deep (like your diaphragm and pelvic floor). The core muscles also surround your spine on all sides: the four abdominals (rectus abdominis, transversus abdominis, and the internal and external obliques) on the front and sides, and the large muscle group erector spinae on the back, are some of the larger ones. Depending on the challenge, different parts of your core will have to work. Are you loading your core from the front, like when standing in a plank, a push-up position, or pushing a car in front of you? Then your abdominals will have to work hard, especially your rectus abdominus and the anterior (forward-most) parts of your inner and outer obliques. Are you loading your core from the side, e.g. standing in a side plank, or carrying something heavy in one hand? Then your inner and outer obliques will have to work hard to keep you straight. Are you loading your core from the back? Like when you place a bar over your shoulders and do a good morning – or a squat. Then the muscles on the back of your core will have to work hard, meaning your erector spinae and multifidus (= your back extensors). The posterior (back-most) parts of your obliques will also aid a little, but not much. Overall, your abs are not very active (nor do they need to be) when squatting. That is not to say that your abs aren’t working at all in a squat, but they are very unlikely to be a limiting factor for performance or technique. The confusion likely stems from confusion about the intra-abdominal pressure (IAP), the term describing that when you trap air in your lungs, and your guts and intestants in your abdomen, and tense the muscles surrounding all of this, you increase the pressure in your abdomen. This acts kind of like a supporting balloon of air, stabilizing your spine and torso. Your core muscles participate in creating this pressure, but that does not mean that all of your core muscles should be maximally active for every given task. The optimal core activation depends on what you are doing! During a squat, your core musculature is trying to keep the bar on your back, without flexing. This is solved by doing two things: 1. The back extensors are working as hard as they can to resist the barbell and keep the spine straight. 2. The other core muscles generate intra-abdominal pressure to aid the back extensors, without creating an unneccessarily large flexing force on the spine which would add to the workload of the back extensors. In summary, the squat does not train your abdominals to any high extent, nor should it be expected to do so. Don’t over-analyze the art of bracing during a squat. Focus on the rest of steps, and let your body figure out what muscles need to be contracted, how much, and when.",
            "Improving the Descent tempo":"The squat descent ideal tempo should be “As fast as you can while still maintaining control.”. In general, if your descent takes ages you are wasting energy and losing your rebound effect at the bottom. If you find that you descend very slowly and want to increase your speed, one way to address that is to train a little more in higher rep-ranges, like several sets around 10 reps or so. The high number of repetitions will subconsciously teach you to conserve your energy while you are repping, and thus might make you chip away at some of your technical unneccessarities, like a too-slow descent. Rotate this high-rep work with regular heavier training every now and then, and try to keep the speed in your heavier sets. It will not happen overnight, but can lead to big changes if you practice it during a regular training block of a month or two. Now, if you descend slowly and it works just fine for you – keep doing it! This is a highly individual technicality, and you must find what works for you. If you however feel that you might gain a little on the ascent if you could speed up your descent just a little bit, then it might be worth giving it some attention. ",
            "Pro tip on the Sticking Point and Lock-Out  - Just if you’re training at very heavy weights": "The sticking point in the squat is typically considered to be somewhere above parallel. If the weight is way too heavy for the lifter, they doesn’t even start lifting it. But when the weight is just barely too heavy, they seem to fail somewhere above parallel. When the thigh angle relative to the floor is 33°, you will (depending on your squat style) have squatted down to about a 70–80° knee flexion. That is, somewhere between a quarter and a half squat. Why does the sticking point occur here? The explanation may be the bounce. Due to the stretch-shortening cycle mentioned earlier, you get some help from your muscles’ and tendons’ elasticity, and this powers you through much of the demanding range of motion that is around the bottom and the parallel thigh position. But when the rubber band effect wears off, you are left to rely on your own muscle force, while still being pretty close to a very demanding position. Logically, this would mean that the sticking point of a pause squat (where you have eliminated the stretch reflex) is different from that of a normal squat. Intuitively, this may be the case: in a pause squat that is just barely too heavy, you’d get stuck lower than a 33° degree thigh angle. Perhaps around parallel, or even just below it? However, besides just making your knee and hip extensors stronger as well as trying to utilize the stretch-shortening cycle, there isn’t too much you can do about the sticking point. Except maybe one thing. There is a technique that some lifters use, which is to drive the hips under the bar when you reach or approach the sticking point. The rationale is that the demands of the knee extensors have decreased at that point, and by shifting your hips forward you might “lend” some work from the quadriceps to the hip extensors via this shift in moment arms. Good squatters utilize it often and it might be worth giving it a shot. If you clear the sticking point, the final lock-out will generally be a breeze.", 
            "How to Become Stronger in the Squat?": "The weight you can squat is determined by the amount of force you can produce in your muscles (primarily the extensors of the knees, hips and back) and transfer into the bar. To squat more weight, that is what you will have to improve. If you strip it down to the essentials, there are three different domains in which you can improve in order to accomplish this, and those are: 1. Muscle & tendon. This is your hardware. A bigger muscle produces more force, and a stiffer tendon transfers that force into your bones more efficiently. Skeletal muscle mass is strongly correlated with squat performance. To build bigger muscles, you simply have to train them in any reasonable way. Yes, strength gains can be quite specific in terms of vectors, but if you build bigger and stronger quadriceps using leg extensions (for example), you will still have bigger and stronger knee extensors when you go back to the squat. Tendons increase in stiffness from all heavy training, and the degree of specificity in terms of exercise choice is quite low here as well. Improvements in neuromuscular efficiency and especially technique require more specificity, and you will actually have to practice the lift in which you want to improve. Preferrably at pretty heavy loads. This means that you can roughly divide your squat training into two distinct parts, or goals: 1. Building bigger and stronger muscles. 2. Specific squat practice. Now, squatting in and of itself of course works all the relevant muscles for squatting, but limiting yourself to squats only might limit the amount of productive muscle-building training that you could do, and thus hamper your strength gains – especially in the long term, where muscle mass plays a greater role.",
            "Training Volume for the Squat": "The optimal training volume varies widely between individuals and is dependent on several factors, such as: Training status. The more accustomed you are to training, the more you can handle and will likely need. Age. Young to middle-aged adults likely recover easier than elderly ones. Nutrition. Calories and protein the currencies of adaption. The more you put in, the more you can spend. Recovery. Good sleep and low stress increases your ability to endure and adapt to the training. The relationship between strength (and hypertrophy) gains and training volume follows an inverted U-shape, where both too little and too much training leads to inferior gains. Some general volume recommendations in terms of working sets of squats: sets that are challenging, but are generally not performed to failure, instead leaving 1–2 reps in the tank. Low volume, 6–9 sets per week: This is a suitable volume for the beginner lifter that is simultaneously getting used to deadlifting maybe once a week, and thus is acclimatizing to a lot of new stress. It might also be suitable for the intermediate lifter that is either tapering, or taking a minimalistic approach to squatting while perhaps focusing on hypertrophy work for the squat musculature. Medium volume, 10–16 sets per week: The goldilocks zone, and probably a nice target volume for a majority of people in the intermediate stage. Recovery demands will be quite low if this is the only training you do for the lower body, but if you add in deadlifts and squat accessory training, the total volume will place quite high demands on your recovery. This might be a suitable volume for an advanced lifter who is tapering. High volume, 17–24 sets per week: For the intermediate lifter who is stuck on a plateu and wants his or her squat to ascend to the next level, or for the advanced lifter. Recovery demands are high, especially if this is coupled with deadlift training and accessory work. Most will have to gradually increase their volume to this level over a long period of time, and some lifters might simply find it to be too much for them, and that medium volume works better.",
            "Training Frequency for the Squat": "Training frequency might be an important mediator for training volume. Do you want to train a lot? Then sooner or later you’ll have to distribute the training on more days, before your current workouts swell beyond the scope of what is productive to do in one session. A rough limit on the number of work sets of squats in a single session might be somewhere in the neighbourhood of 10 sets. About 2–3 squat sessions per week is probably a good starting point for someone who also trains deadlifts or similar lower-body movements. Recovery after squatting seems to happen about as fast as recovery after both deadlifting and bench pressing. Habituation to a high training frequency thus seems most important.",
            "Load & Reps": "Your strength can improve from training with both high and low loads, but when you compare them head to head, lifting heavy weights is slightly more effective if you want to get better at lifting heavy weights. There are several rep and loading strategies that work, as long as you heed the principle of specificity (lifting heavy every once in a while) and progressive overload (adding weight or reps progressively). A couple of basic templates for how to structure your workouts in the context of the two principles mentioned above are: \n1. Pyramid training. Increase/decrease the weights in a pyramid fashion during your workout. E.g. go from 6–10 reps at 60% of 1RM, up to 1+ reps at 90%, and back down to 60% again. That way you’ll get some practice at heavier weights, while still getting a good amount of volume in. \n2. Slug away at 80%. The range of about 75–85% of 1RM is the powerlifters bread and butter. It’s heavy enough to be specific training for max attempts, but not so heavy that it burns you out. It’s typically possible to accumulate a large, effective volume at this intensity. Something like 6–10 sets x 2–4 reps might be appropriate for one workout."
        },
        "alternativesAndVariations": {
            "Hypertrophy: Exercises that will strengthen and grow the muscles used in the lift.": "The primary movers in the squat are the knee extensors (quadriceps), hip extensors (glutes, adductor magnus), and back extensors (erector spinae), so that is the muscles you should be most concerned about getting to grow. The options for hypertrophy exercises are many, and more a matter of personal preference than anything else. We will now share some exercises that you might use to supplement your training for the muscles involved in the squat. If you are not sure, we recommend to pick deadlift + 1–2 of the exercises below, and do 2–3 sets at 1–2 workouts per week. If you squat with a low volume (relative to your training level), you can increase the volume of supplementary exercises: 1. Deadlift (knee, hip and back extensors), 2. Front squat (knee, hip and back extensors), 3. Bulgarian split squat (knee and hip extensors), 4. Leg press (knee and hip extensors), 5. Belt squat (knee and hip extensors), 6. Leg extension (knee extensors), 7. Hip thrust (hip extensors), 8. Kettlebell swing (hip and back extensors), 9. Good morning (hip and back extensors).",
            "Technique: Exercises that strengthen the movement, or improve the performance or technique of the lift.":"These are generally more taxing than the hypertrophy exercises listed earlier, and also cut in more into your other squat volume. Working sets of the exercises listed below should probably be traded in for your regular sets of squats if you’re already training at a high volume, rather than piled on top of it. \n1. Pause squats. Can be used to improve overall technique, and strength around the position that you pause in. We generally recommend pausing in the bottom position, and for a count of three. Pausing in the bottom position also helps engraining a feeling of what correct depth is. \n2. Tempo squats. Slowing things down increases your control and body-awareness, and also gives to more time to correct errors. This can be used as an aid to improve technique, e.g. it could be used to correct errors like knees caving in, butt wink, and going up on the toes. You can choose to slow down the tempo on the way down, up, or both.\n3. Box squats. Can be used for a variety of purposes, including: Finding correct depth, limiting the movement in case of injury, practicing technique and body awareness in the bottom, and training your strength from the bottom. \n4. Front squats. Shifts the workload more to your quadriceps and unloads the hip extensors slightly. Increases the demands of especially upper back strength. It can be used to strengthen quadriceps and upper back, and teach a more upright squatting posture."
        }
    },

    "new_exercise": {
        "form": {
            "Steps": "1. ... \n 2. ... \n 3. ... ",
            "Form": " "
        },
        "tempo": "XXXX. Why? ...",
        "commonMistakes": " ",
        "comments": {
            "X": "",
            "Y": "",
            "Z": ""
        },
        "alternativesAndVariations": " "
    }
}
