{
    "air_squat": {
        "form": {
            "Steps": "\n1. Stand with your feet about shoulder width apart. \n2. Squat as deep as possible. \n3. Reverse the movement, and return to a standing position.", 
            "Form": {
                "Foot position": "If you're a beginner, stand with your feet about shoulder-width apart, with toes pointing slightly outward. This provides a stable base and allows for proper knee tracking. Experiment with slight variations in foot placement to find what feels most comfortable and allows you to squat deepest with good form.", 
                "Shoulders": "Keep your shoulders down and back throughout the movement. Avoid letting them shrug up towards your ears, as this can make the movement less efficient, increase stress on the shoulder joint, and cause discomfort in the neck and shoulder area. Actively pull your shoulder blades down and back, as if trying to put them in your back pockets.", 
                "Core": "Engage your core muscles throughout the exercise. This helps maintain a stable spine and prevents excessive forward lean. Imagine bracing your core as if you were about to be punched in the stomach.", 
                "Depth": "Squat as deep as your mobility allows while maintaining good form. Aim to reach a depth where your thighs are at least parallel to the ground, or lower if possible. If you have mobility restrictions, work on improving your flexibility to gradually increase your squat depth.", 
                "Movement Control": "Perform the entire movement with full control. Avoid rushing or using momentum. Focus on smooth, deliberate movements, both on the descent and ascent. This helps develop strength and control throughout the entire range of motion."
            }
        }, 
        "tempo": "3010: 3 seconds eccentric phase (lowering the weight), 0 seconds at the bottom, 1 second for lifting (concentric phase), 0 seconds at the top. Why? Air squats are primarily for form and mobility, so a controlled 3-second eccentric emphasizes proper movement mechanics.", 
        "commonMistakes": {
            "Not keeping your shoulders down": "By letting your shoulders shrug up towards your ears, you’ll make the movement less efficient, increase the stress on the shoulder joint, and could cause discomfort in the neck and shoulder area rather than exercising the targeted muscles.", 
            "Half reps": "Since the air squat is a bodyweight exercise, it’s easy to start to cut off depth to be able to do more reps. Don’t do this. Focus instead on maintaining a full range of motion (in line with your mobility).", 
            "Not maintaining form": "Using momentum, swinging the body to complete the movement, arching your lower back, rather than relying on controlled, targeted muscle activation, is a common mistake while doing air squats.",
            "Back Rounding / Butt wink": "“Butt wink” is when your back rounds (e.g. your spine flexes) in the bottom of a squat. It is usually the symptom of one of three things: \n1. Lack of mobility. Your hip joints simply reach their maximum point of flexion, and to keep getting lower, your body has to round your back. \n2. Balance. With the stance, bar placement, bar weight, and your own body’s weight distribution, you might need to tuck your butt in to retain balance and not fall back. \n3. Motor control. You might have the requisite mobility and stance to squat without butt wink, but you lack the motor control to keep your spine erect (neutral spine) and stable.",
            "Goes Up on Toes in the Bottom": "If you find that your heels loose contact with the ground and that you shift your weight up on your toes in the bottom, you are likely having a mobility issue. Your body is simply trying to solve the task of squatting down deep enough without losing balance, and with the current movement strategy solves that by going up on your toes a little bit. Try to increase your general squat mobility (pro-tip).",
            "Knees Caving in": "Knees caving in somewhere on the way up is a common sight in especially new lifters, and seems more common in those who begin with low levels of strength and muscle mass in and around their legs and hips. Knees caving in might be a potential risk factor for knee injuries, and it is generally recommended to try and keep the knee in more of a straight line between your hips and feet. What is happening is that the muscles that adduct (“move in”) your thigh overpowers or outworks the muscles that abduct (“move out”) your thigh. Your adductors, especially adductor magnus, is a powerful hip extensor in the squat, but as the name implies it also adducts your leg. This movement will have to be countered by your hip abductors, two of which the bigger ones are gluteus maxmimus and medius. These muscles will have to get coordinated with each other, where they cooperate to help you squat effectively and safely. A good approach to make this happen is to squat with a rubber band around your knees, or have someone push your knees together. This will force you to activate your abductors (gluteus medius and maximus) more, and acts as a reminder to push your knees out. It might help engrain this in your nervous system, so that you do it even after you remove the resistance. Try this out during your warm-ups, or even in most of your squat sets for several workouts (maybe even weeks), and see if that does the trick."
        }, 
        "comments": {
            "Popularity": "The squat is known as “the king of all exercises” – and for good reason. Squats have been the staple for bodybuilders looking to grow their leg muscles for decades, and in strength and conditioning, they have been used (and still are used) to improve almost every athletic endeavor that is undertaken on two feet. A reminder here: Squats don’t work your hamstrings. They primarily work your quads, adductors, glutes, and lower back.",
            "How Deep Should You Squat?": "If you want general leg strength and maximal hypertrophy: Squat as deep as you safely can, at least down to parallel (= where your thigh is parallel to the floor).",
            "The Core Muscles and the Squat": "The core musculature is made up of at least a dozen muscles, both superficial (like your abs and spinal erectors) and deep (like your diaphragm and pelvic floor). The core muscles also surround your spine on all sides: the four abdominals (rectus abdominis, transversus abdominis, and the internal and external obliques) on the front and sides, and the large muscle group erector spinae on the back, are some of the larger ones. Depending on the challenge, different parts of your core will have to work. Are you loading your core from the front, like when standing in a plank, a push-up position, or pushing a car in front of you? Then your abdominals will have to work hard, especially your rectus abdominus and the anterior (forward-most) parts of your inner and outer obliques. Are you loading your core from the side, e.g. standing in a side plank, or carrying something heavy in one hand? Then your inner and outer obliques will have to work hard to keep you straight. Are you loading your core from the back? Like when you place a bar over your shoulders and do a good morning – or a barbell squat. Then the muscles on the back of your core will have to work hard, meaning your erector spinae and multifidus (= your back extensors). The posterior (back-most) parts of your obliques will also aid a little, but not much. Overall, your abs are not very active (nor do they need to be) when squatting. That is not to say that your abs aren’t working at all in a squat, but they are very unlikely to be a limiting factor for performance or technique. The confusion likely stems from confusion about the intra-abdominal pressure (IAP), the term describing that when you trap air in your lungs, and your guts and intestants in your abdomen, and tense the muscles surrounding all of this, you increase the pressure in your abdomen. This acts kind of like a supporting balloon of air, stabilizing your spine and torso. Your core muscles participate in creating this pressure, but that does not mean that all of your core muscles should be maximally active for every given task. The optimal core activation depends on what you are doing! During a squat, your core musculature is trying to keep the bar on your back, without flexing. This is solved by doing two things: 1. The back extensors are working as hard as they can to resist the barbell and keep the spine straight. 2. The other core muscles generate intra-abdominal pressure to aid the back extensors, without creating an unneccessarily large flexing force on the spine which would add to the workload of the back extensors. In summary, the squat does not train your abdominals to any high extent, nor should it be expected to do so. Don’t over-analyze the art of bracing during a squat. Focus on the rest of steps, and let your body figure out what muscles need to be contracted, how much, and when.",
            "Improving the Descent tempo":"The squat descent ideal tempo should be “As fast as you can while still maintaining control.”. In general, if your descent takes ages you are wasting energy and losing your rebound effect at the bottom. If you find that you descend very slowly and want to increase your speed, one way to address that is to train a little more in higher rep-ranges, like several sets around 10 reps or so. The high number of repetitions will subconsciously teach you to conserve your energy while you are repping, and thus might make you chip away at some of your technical unneccessarities, like a too-slow descent. Rotate this high-rep work with regular heavier training every now and then, and try to keep the speed in your heavier sets. It will not happen overnight, but can lead to big changes if you practice it during a regular training block of a month or two. Now, if you descend slowly and it works just fine for you – keep doing it! This is a highly individual technicality, and you must find what works for you. If you however feel that you might gain a little on the ascent if you could speed up your descent just a little bit, then it might be worth giving it some attention.",
            "Pro-tip: How to improve general squat mobility?":"There are two common problem areas where people lack the mobility to be able to perform the squat in a safe and efficient manner: the hips, and the ankles. 4 different ways to approach this to find a solution: \n1. Squat more. Using a joint in the desired movement is often the best way to improve its mobility and range of motion. If you’ve never squatted before, give yourself lot’s of time in the beginning to accustom yourself and your body to squatting. Your body will adapt, and you will get a little better each week. It might benefit you to spread your training volume over a little more workouts per week, to get more frequent practice. \n2. Experiment with stance. Try placing the bar lower, widening your stance, opening up your hips and pointing your toes out. This kind of low bar-style reduces the requirement of ankle mobility, but has higher requirements of hip mobility. Alternatively, try placing the bar higher on your back, feet closer together and toes poinint forward. This requires good ankle mobility, but lower hip mobility. \n3. Get lifting shoes with raised heels. A raised heel acts like “artificial ankle mobility”, and can work wonders for your squat technique. Test if shoes with a raised heel might be for you by placing your heels on small weight plates or a thin wooden plank or such, and squat. Note: We DO NOT recommend training like this, as it could easily lead to accidents. \n 4. Try to increase your joint mobility directly. A common exercise for increasing your mobility for the squat is to squat down and hold onto a support in front of you to keep your balance, and then try to stretch out everything that feels tight. You can also use a kettlebell or other weight for balance by holding it to your chest. Repeat this a few times daily for quick mobility gains, or as a warm-up before squatting. A more aggressive approach for increasing your ankle mobility is to squat down, and place a barbell on top of your knees, pushing them down. Hold it on top of your knees with your hands, and oscillate up and down in this position."
        }, 
        "alternativesAndVariations": {
            "Goblet Squat": "Holding a weight in front of your chest can help improve balance and core engagement.",
            "Box Squat": "Squatting to a box can help improve depth and control.", 
            "Jump Squat": "Adding a jump at the top of the squat can increase explosiveness."
        }
    }
}