{
    "back-extension": {
        "form": {
            "Steps": "\n1. Adjust the machine: The top pad should be positioned against the top of your thighs. \n2. Step onto the machine and position yourself with your feet shoulder-width apart and your upper thighs against the top pad. \n3. Your upper body should be hanging off the edge of the machine, with your arms crossed over your chest or your hands behind your head. \n4. Hold a weight plate against your chest or a barbell across your shoulders if you want to use additional weight. \n5. Prepare to lift: Take a deep breath in, and as you exhale, engage your lower back muscles to lift your upper body until your body forms a straight line. \n6. Hold this position for a second, then inhale as you slowly lower your upper body back down to the starting position. Make sure to keep your movements slow and controlled, and don’t use momentum to swing your body up or down.",
            "Form": "When lifting your upper body, make sure to squeeze your glutes hard. You can also hold the top position (with your glutes squeezed hard) for a second or two before lowering yourself back again."
        },
        "tempo": "2011",
        "commonMistakes": "Hyperextending at the top. Going beyond a straight line can strain your lower back. Focus on controlled movement and stop at the point where your body forms a straight line.",
        "comments": {
            "Spinal Flexibility": "Performing the back extension exercise can improve your spinal flexibility, which can help you maintain a comfortable posture and reduce the risk of back pain and injury. By engaging your spinal muscles and lifting your upper body, you can stretch and strengthen the muscles along your spine, which can improve your overall spinal mobility.",
            "Variation from neutral spine training": "In many heavy compound exercises, like the deadlift or squat, a neutral spine position throughout the lift is often emphasized. While that may be a good idea in those exercises, the reality is that in our real life, we bend our spine all the time, and often under load. Allowing for spinal movement in the back extension prepares and strengthens your back for these situations, which might lead to a more resilient and healthy back."
        },
        "alternativesAndVariations": {
            "Good Morning": "The good morning exercise targets your lower back, glutes, and hamstrings, and can be performed using a barbell or dumbbells. To do a good morning, place a bar across your shoulders, and hinge forward while keeping your back straight and your knees just slightly bent. A good cue for nailing the proper form is to think “butt back”. The key to the good morning is to start with very light weights and focus on control and form. Then you can gradually increase the weights from there.",
            "Deadlift": "The barbell deadlift is one of the most popular back exercises in the world. It is a compound exercise that works many of your major muscle groups at the same time, with an emphasis on your glutes, lower back, and hamstrings. You perform a deadlift by lifting a barbell off the floor up to a standing position, using your back and lower body muscles. Once again, proper form and starting light while you build up your back’s tolerance are key here. If the traditional barbell deadlifts feel uncomfortable, you might want to try trap bar deadlifts.",
            "Trap Bar Deadlift": "The trap bar deadlift is a variation of the traditional deadlift where you use a trap bar (also known as hex bar). Trap bars usually have two levels of handles: one pair at standard barbell height, and one pair slightly higher off the ground. Thanks to the high handles and the slight change in position, the trap bar deadlift moves some of the load away from your back and hips and instead onto your legs. This can be useful if you want to train your back and lower body, but feel that the regular deadlift is to intense or uncomfortable.",
            "Romanian Deadlift": "The Romanian deadlift exercise is another variation of the traditional deadlift, emphasizing your glutes and hamstrings, although it also works your lower back. To perform the Romanian deadlift, lift a bar up to the starting position (the top position of a deadlift). Then hinge forward and lower the barbell close to your thighs and knees. Like in the good morning exercise, thinking “butt back” can help you maintain proper form.",
            "Kettlebell Swing": "The kettlebell swing is the most classic kettlebell exercise, and works similar muscles to the barbell deadlift or good morning. Perform a kettlebell by swinging it back between your legs, then forcefully extend your hips to send it flying forward and up. Let the kettlebell travel to about chest height before you lower it and swing it back between your legs again. Think of the kettlebell swing as a hip hinge exercise, not a squat.",
            "Floor Back Extension": "Finally, the floor back extension is a body-weight alternative when no equipment is available. This exercise works your lower body muscles, but the resistance is fairly light, meaning that well-trained people might find this exercise too easy. For beginners or for just getting some blood flow to your lower back muscles, it’s still useful."
        }
    }
}