{
    "banded-muscle-up": {
        "form": {
            "Steps": "\n1. Use a rubber band of self-selected resistance. The thicker the band, the easier it’ll be to get over the bar.\n2. Start with the band wrapped around one or both feet. \n3. Hang with straight elbows and a firm grip on the bar. \n4. Pull hard and use the assistance from the band to get through the transition part. \n5. Find a balanced position to land above the bar. It might help to make a stomach-to-bar contact. \n6. Finish with a press to locked elbows.",
            "Form": {
                "Grip": "Use a firm overhand grip, slightly wider than shoulder-width apart. An overhand grip promotes better shoulder health and stability during the movement. Ensure your thumbs are wrapped around the bar for a secure hold.",
                "Pull-up": "Initiate the movement by pulling yourself upward as if performing a regular pull-up. Keep your core engaged and your body as straight as possible. As you pull up, try to lean slightly forward to facilitate the transition.",
                "Transition": "As your chest approaches the bar, aggressively drive your elbows forward and over the bar. This is the most crucial part of the exercise and requires a combination of strength, timing, and coordination. Visualize yourself “rolling” over the bar.",
                "Dip": "Once your chest is above the bar, push yourself upward, extending your arms to complete the dip portion of the exercise. Keep your core tight and your body stable throughout the movement.",
                "Lockout": "Finish the exercise by fully extending your arms at the top, ensuring your elbows are locked out. This ensures you’ve completed the full range of motion and maximizes muscle activation."
            }
        },
        "tempo": "1011",
        "commonMistakes": {
            "1. Not leaning forward during the pull-up": "This can make the transition more difficult, as it requires a greater degree of upper body strength and coordination to get your body over the bar.",
            "2. Not driving the elbows forward during the transition": "Failing to do so can cause you to stall mid-movement, making it harder to complete the exercise.",
            "3. Rushing the transition": "The transition phase should be controlled and deliberate. Rushing it can lead to poor form and increase the risk of injury.",
            "4. Not engaging the core": "A weak core can make it difficult to maintain a stable body position throughout the exercise, reducing efficiency and increasing the risk of injury.",
            "5. Using a band that's too thin": "While a thinner band provides less assistance, using one that's too thin can make the exercise excessively challenging, potentially leading to improper form or failure to complete the movement."
        },
        "comments": {
            "What is a Banded Muscle-Up?": "In band-assisted muscle-ups, you use a rubber band to lighten the load as you perform the skill. It also gives you the exact experience of a muscle-up, since that’s precisely what you do, but only with an unloaded bodyweight. It is a great way to practice the full movement of the muscle-up but at the same time decrease the load compared to a regular muscle-up. It lets you get a feel for the transition and also tests your lock-out strength in the dip. You can perform the exercise both in rings or on a bar.",
            "Benefits of the Banded Muscle-Up": "1. Progressive Learning. The resistance band provides adjustable support, allowing you to learn and improve your muscle-up technique progressively. 2. Reduced Risk of Injury. The assistance from the band decreases the load on the muscles and joints, which can help reduce the risk of injury. 3. Technique Building. By reducing the amount of strength needed to complete the transition phase of the muscle-up, you’re able to focus on refining the technique, including body positioning and the mechanics of the transition."
        },
        "alternativesAndVariations": {
            "Low Ring Variation to Band-Assisted Strict Muscle Up": "This variation might allow for a more comfortable experience if height is considered one of your unpreferred locations. Other than that the principles remain the same as for band-assisted muscle ups in the high rings/bars. This variation emphasizes strict form and technique, especially during the transition phase, without needing to be far up in the air.",
            "Negative/Eccentric Ring Muscle-Ups": "This variation of the muscle-up focuses on the downward phase more. This exercise develops strength and muscle control, particularly in the muscles involved in the transition phase. Without the assistance of the resistance band, it could be more challenging to perform.",
            "Jumping Muscle-Up": "In the jumping muscle-up, you use an explosive jump to assist with the upward phase and transition of the muscle-up, providing momentum and reducing the amount of upper body strength required. Banded muscle-ups, on the other hand, provide a constant support and can be adjusted for tension to gradually increase the exercise’s difficulty."
        }
    }
}