{
    "bar-dip": {
        "form": {
            "Steps": "\n1. Grip a dip station about shoulder-width apart, and climb or jump to get into the starting position. \n2. Lower yourself with control until your shoulder is below your elbow, or as deep as you comfortably can. \n3. Reverse the motion and return to the starting position",
            "Form": {
                "Grip and Hand Positioning": "Make sure to find bars where you can grip about shoulder-width apart. If the bars are too far away from each other, you’ll end up with a weird movement for your shoulders, and it will be hard to maintain a proper form. If they are too close together, it will be hard to reach a good depth.",
                "Core and Posture": "When you’ve jumped/climbed up to the starting position, make sure to embrace your core and to have a good posture. Keep your shoulders down and back. If you don’t keep the tension in your core, the movement will be much more unstable and wobbly.",
                "Legs": "By crossing your ankles and having a slight bend in your knees, you’ll help to make the movement even more stable.",
                "Movement": "Make sure to do the entire movement with full control. Do not rush, and keep your form strict. Your elbows should go backward, not out, and your shoulders should stay down and back.",
                "Adapt the Weight to Your Strength Level": "If the bar dip is too heavy for you, you can adjust the weight by taking a resistance band and placing it around your wrists. Let the band hang between your arms, forming a U shape. Place your feet or knees on the band, which will help you on the way up. If the exercise is too easy, you can add extra weight by getting a weight belt and attaching weight plates to it."
            }
        },
        "tempo": "2011. Why? Dips require a controlled descent to protect your shoulders. The 2-second eccentric helps with this. A smooth transition from the bottom to the top maintains tension in the triceps and chest.",
        "commonMistakes": {
            "Bars too far from each other": "Make sure to find bars where you can grip about shoulder-width apart. If the bars are too far away from each other, you’ll end up with a weird movement for your shoulders, and it will be hard to maintain a proper form. If they are too close together, it will be hard to reach a good depth.",
            "Not keeping your shoulders down": "By letting your shoulders shrug up towards your ears, you’ll make the movement less efficient, increase the stress on the shoulder joint, and could cause discomfort in the neck and shoulder area rather than exercising the targeted muscles.",
            "Half reps":"Since the bar dip is quite a heavy exercise, it’s easy to start to cut off depth to be able to do more reps. Don’t do this. Focus instead on maintaining a full range of motion (in line with your mobility). If the movement is too heavy, add a resistance band to reduce some of the weight.",
            "Not maintaining form": "Using momentum, swinging the body to complete the movement, arching your lower back, and/or flaring your elbows out to the sides, rather than relying on controlled, targeted muscle activation, is a common mistake while doing bar dips."
        },
        "comments": {
            "Muscles involved": "The bar dip primarily targets your chest and front delts, and secondary targets the triceps. This is for the bar dip. In some dip variations, like the bench dip, you’ll primarily target the triceps, and secondary the chest and front delts.",
            "Benefits of Bar Dips or Chest Dips": "\n1. Accessible. The only thing you need to get started is two parallel bars, which makes the bar dip a great choice for exercising your chest, shoulders, and triceps without needing a fully equipped gym. \n2. Easy to adapt to your strength level. The bar dip is an exercise that could easily be made harder or easier with help of weight belts and resistance bands. \n3. Improved upper body strength. The bar dip is a very effective exercise for gaining strength in your chest and shoulders and for building muscle mass.",
            "How Many Sets and Reps Should You Do of the Bar Dip?": "How many reps you should do of an exercise depends on your goal: do you mainly want to increase your strength or build muscle? Generally, a lower rep range of about 1–5 reps per set is most effective for strength gains. If you want to be able to do one heavy single in weighted bar dips, this might be a good rep range to work within. For muscle gains, a slightly higher rep range of about 8–15 reps per set is generally the most effective and practical. You can cycle in periods of working in this rep range, even if your goal is to get as strong as possible. Of course, you will see an increase in both muscle and strength regardless of which rep range you choose, but you can emphasize one or the other slightly by working in the right number of reps. If you are unaccustomed to dips, they might feel quite stressful on your shoulders and sternum, and in that case (and actually in almost all cases), it might be a good idea to increase the training volume very gradually. Most people prefer to work in a higher rep range while doing the bar dip, especially when you’ve gotten a bit stronger so that you don’t need to add so much extra load apart from your body weight. How many sets you do of an exercise depends on your training experience, how many times you work out in a week, and your other training. But around ten sets per week for a given muscle group is a good starting point, and you can go even higher when you are used to training or if you stop your sets short of failure."
        },
        "alternativesAndVariations": {
            "Bench Dip":"The bench dip utilizes a bench instead of a dip station. This exercise puts more emphasis on your triceps than the bar dip does. Since you’re not lifting your entire body weight, this exercise could be a bit easier than the bar dip.",
            "Bench Press":"The bench press is a great alternative to the bar dip. It targets the same muscles as the bar dip, but it’s a bit easier to perform and puts less pressure into the shoulders, so if you have shoulder pain when performing bar dip or chest dip, then bench press could be a great alternative. The bench press is a great exercise for building strength and muscle mass in your chest, shoulders, and triceps.",
            "Close-Grip Push-Up":"By keeping your hands closer together than in regular push-ups, you’ll put more emphasis on the triceps, and a bit less on the chest and front delts (while they are also targeted)."
        }
    }
}