{
    "barbell-squat": {
        "form": {
            "Steps": "\n1. Place the bar on your upper back. Inhale and brace your core slightly, and unrack the bar. \n2. Take two steps back, and adjust your foot position. \n3. Squat as deep as possible with good technique. \n4. With control, stop and reverse the movement, extending your hips and legs again. \n5. Exhale on the way up or exchange air in the top position. \n6. Inhale and repeat for reps.",
            "Form": {
                "Foot Position and Stance Width": "Squatting is possible with anything from a narrow stance to a wide stance. Typically, you want your knees to track in the same direction that your toes are pointing, which means that in a narrow stance your toes are usually pointing more or less forward, and in a wide stance your toes point quite a bit outward. Your stance width has large implications for your squatting biomechanics, as it affects how you will have to balance and position everything else above your feet and legs, namely – your body and the bar. If you stand with a narrow feet placement, with your toes pointed forward and let your knees track forward while squatting, you will generally (but not always) have to compensate by pushing your butt slightly further back and lean your torso slightly more forward to maintain balance. This will probably also be your most efficient lifting technique in this particular stance, where you distribute the work pretty evenly between the knee and hip extensors. The opposite would be a very wide stance. As you are not shifting any weight forward, you don’t need to send your hips back, and you don’t need to lean forward to maintain balance. It is therefore generally possible to squat with a more upright torso when you are using a wide stance, while still distributing the work evently across knee and hip extensors. This is especially true for lifters with long (relative to their body) femurs. By pointing your femurs out to the sides, you are essentially “shortening” them, and don’t need to compensate as much with the rest of your body.",
                "Bar Position: High or Low?": "When squatting, you have the option of placing the bar either high or low on your back, and everywhere in between. High bar usually refers to you placing the bar high up on your shoulders, on top of your trapezius or posterior deltoids. Low bar usually refers to you placing the bar low on your shoulders, or even down on your upper back. A common placement is just above the upper ridge of your scapulas, and you will have to lean forward to create a small shelf for the bar to rest on to keep it still. There are no lines drawn in the sand where a bar placement goes from being “high” to “low”, and neither is it necessary. The bar placement will determine primarily two things: 1. The distance from the bar to your hips. With a low bar placement, you are bringing the barbell closer to your hips. That means you are decreasing the moment arm that your back and hip extensors works against. That, in turn, means you will be able to lift more weight with the same hip and back strength. 2. Your torso lean. If you place the bar lower down your back, you will have to lean forward more to keep your centre of gravity over your mid-foot. With a high bar placement, you can keep a more vertical torso. An exaggerated example of this effect is a front squat, where the weight is even further in front of your hips, and your torso even more vertical. 3. Knee / hip weight distribution. When you lean forward, you will have to counterbalance by pushing your hips back. This will redistribute some of the workload from your quadriceps to your hips. To counter the forward lean, and to avoid your abdomen and your thighs coming together and thus limiting your ability to reach depth, it is common to combine a low bar position with a wide stance. A wide stance gets your thighs out of the way for your abdomen, and as for balance, will help you maintain a slightly more vertical torso by “shortening” your femurs in the sagittal (side-view) plane.",
                "Balance in the Squat": "The human body’s centre of mass – aka centre of gravity – is usually located somewhere around your belly button. As you move around, you are always keeping your centre of mass roughly above the middle of your foot – otherwise you’d lose balance and fall over. The same goes for squatting. As you squat down, you will need to keep your centre of mass roughly above the middle of your foot. You can correct slight deviations back and forth (weight going back on your heels or front on your toes) by using the muscles of your feet and calves, but not much. As you add a bar to the equation, you will have to take the bar’s centre of gravity in consideration as well. Or rather, your body will do that for you automatically, to keep you from falling forward or backward. This combined centre of gravity (you + the bar) will always be centered roughly above the middle of your foot. If you’d not keep the combined centre of gravity over the middle of your foot, you would fall over. The heavier the barbell, the less significant your own body’s centre of gravity will be in terms of balance. The lighter the barbell, the less significant it’s centre of gravity will be in terms of balance. The point is that your squatting technique will change depending on how much weight you’re lifting. It has some important technical implications: You don’t need to worry about “keeping the bar above your mid-foot”. Your body and sense of balance will take care of this by their own. If you fail to keep your combined centre of gravity roughly above the middle of your foot, you will fall forward or backward. If you squat an empty 20 kgs bar in the exact same path as a 400 kg bar, you will fall back. So don’t strive to lift an empty bar in a perfectly vertical line. That makes the faulty assumption that your own body doesn’t weigh anything. Most people will have an easier time squatting with a heavier weight than a light one. Because the barbell will be placed in front of their own centre of gravity, which will help them from falling back. Most people can easily squat pretty deep and with a quite vertical torso if they do a goblet squat (a squat with a weight held at their chest), because of the forward shift in balance. A heavier bar will cause this exact same shift, but since the bar is much closer to your own centre of gravity and the leverage thus is shorter, you will need more weight to feel the effects. So what is the practical application of this? Don’t feel bad if you are having troubles squatting deep with good technique with an empty bar or a wooden stick. Probably the weight is simply too light in relation to your own body weight. Try increasing the weight on the bar, and see what happens with your technique. Most likely, you will find that you can keep a slightly more vertical torso the heavier the bar gets, since you no longer will need to lean forward to maintain balance. Ditch the apps that draw a colorful line of your bar path when you film yourself from the side. The correct bar path will depend on 1) how much the bar weighs, and 2) how much you weigh. Your body will be able to keep your balance on it’s own. So if you shouldn’t focus on the bar path itself when it comes to technical analysis, what then? Well, a much better focus would be: How you position your feet, stance and bar (high vs low placement), How you distribute work between knee, hip and back extensors. Last but not least: keep training. As you keep accumulating experience squatting, you will consciously or subconsciously feel when microvariations in performance from rep to rep leads to a little better performance, and this will refine your technique as you keep squatting.",
                "The Descent": "You have reached the point where you’re standing, with your right stance and the bar on your back. Time to squat! If leveraging the right stance, bar position and squat depth, much regarding your descent is already reined in. You will now need to squat down to the depth that you need to reach. For the powerlifter, this will be just below parallel. One consideration to make: the order in which you move your joints. This will be an individual technical consideration, but there seems to be a majority of lifters that find that their squat feels a lot better when they initiate the movement by pushing their butt back. Or in other words: begin with the hips. Yes, if you were to monitor the knees and hips closely, you’d likely find that they both start flexing simultaneously, but the hips flex more than the knees in the initial part of the descent. To try this out, simply aim to lead with the hips next time you squat.",
                "The Turning Point": "This section covers what happens when you reach your deepest point during squat. The phenomenon called the “stretch-shortening cycle” refers to the fact that a muscle can contract more forcefully if it has first been stretched. It is the reason for why you can jump higher if you squat down slightly and then immediately reverse the movement and jump, compared to if you would squat down, wait three seconds, and then jump. It is the reason for why you can bench more touch-and-go-style than with a pause. I have referred to this as the rubber-band effect earlier in this article, because it’s main mechanism is likely that energy has been stored in the muscle and tendonds elastic tissue, which then acts like a spring. Most people may squat around 10 % more if they reverse the movement instantly compared to a several second long pause squat. Utilizing this stretch reflex effectively can thus bring rich dividends in terms of added weight. The counter-part is: how fast can you change the movement (how aggressively can you “bounce”) while still keeping control and avoiding injury? The forces placed on your lower body is twice as high if you decelerate the descending weight, turn the movement, and accelerate again in 0.5 instead of 1 second. This means that your tissues and technical integrity will have to withstand twice the force compared to the slower turn. Greater skill will be required to execute all the right muscle actions and retaining balance in a quicker turning. It might increase your risk of making a technical mistake. So, while a quick “bounce” might benefit your performance, it also bears its own risks. With the turn in the squat, you will have to find your own goldilocks-squat zone of “just right”.",
                "Un-Racking and Re-Racking the Bar": "Some details we can work on putting the bar back: 1. Correct rack height. For unracking  and re-racking the bar, set the rack so that you won’t have to go up on your toes. Squat it down, don’t good morning it. When you’ve walked into the racks and are about to set the bar down in the hooks, also make sure you squat it down rather than just bend forward like a good morning. The reason for this being that you will remain in a stronger position if something should go awry. You could miss the hooks or if you are using a light rack it might even fall over. Keep control over the bar and remain in a strong position until you’re home free."
            }
        },
        "tempo": "X010: Typical example of this: 3 seconds eccentric phase (lowering the weight), 0 seconds at the bottom, 1 second for lifting (concentric phase). Why? A controlled eccentric (3 seconds) helps you maintain tension in the muscles, promotes hypertrophy, and reinforces good form. The explosive lifting phase (1 second) recruits the maximum number of muscle fibers and develops power. Important note: the tempo of the Descent should be as fast as you can while still maintaining control. Why? Two main reasons: 1. Energy conserving. A slow eccentric costs more energy than a quick one. 2. Rebound effect. The more you are capable of using your tendons and muscles elasticity for a rubber-band effect, the more help you will get out from the bottom. Now, no amount of rebound effect or energy conservation makes a difference if you injure yourself or miss the lift due to balance or some other technical error. Hence why we say “As fast as you can while still maintaining control.”",
        "commonMistakes": {
            "Back Rounding / Butt wink": "“Butt wink” is when your back rounds (e.g. your spine flexes) in the bottom of a squat. It is usually the symptom of one of three things: \n1. Lack of mobility. Your hip joints simply reach their maximum point of flexion, and to keep getting lower, your body has to round your back. \n2. Balance. With the stance, bar placement, bar weight, and your own body’s weight distribution, you might need to tuck your butt in to retain balance and not fall back. \n3. Motor control. You might have the requisite mobility and stance to squat without butt wink, but you lack the motor control to keep your spine erect and stable. Is butt wink dangerous? We don’t really know for sure. If you do it and get lower back pain from it, then you should most likely avoid it. If you don’t get pain from it, you’re probably fine. But still, just like we recommend you to strive for a neutral back in our deadlift guide, we recommend you to strive for a neutral back while squatting, and it might be wise to work on it, to see if you can minimize it with time.",
            "Goes Up on Toes in the Bottom": "If you find that your heels loose contact with the ground and that you shift your weight up on your toes in the bottom, you are likely having a mobility issue. Your body is simply trying to solve the task of squatting down deep enough without losing balance, and with the current movement strategy solves that by going up on your toes a little bit.",
            "Knees Caving in": "Knees caving in somewhere on the way up is a common sight in especially new lifters, and seems more common in those who begin with low levels of strength and muscle mass in and around their legs and hips. Knees caving in might be a potential risk factor for knee injuries, and it is generally recommended to try and keep the knee in more of a straight line between your hips and feet. What is happening is that the muscles that adduct (“move in”) your thigh overpowers or outworks the muscles that abduct (“move out”) your thigh. Your adductors, especially adductor magnus, is a powerful hip extensor in the squat, but as the name implies it also adducts your leg. This movement will have to be countered by your hip abductors, two of which the bigger ones are gluteus maxmimus and medius. These muscles will have to get coordinated with each other, where they cooperate to help you squat effectively and safely. There are two good approaches to make this happen: 1. Squat with a rubber band around your knees, or have someone push your knees together. This will force you to activate your abductors (gluteus medius and maximus) more, and acts as a reminder to push your knees out. It might help engrain this in your nervous system, so that you do it even after you remove the resistance. Try this out during your warm-ups, or even in most of your squat sets for several workouts (maybe even weeks), and see if that does the trick. 2. Lower the weight and train with correct technique. This is the most obvious route: just lower the weight to a level where you can control it, and simply rack up good squat sets where you make sure to keep your knees out. This will also engrain this new technique adjustment, and from here you can gradually start increasing the weights again, without losing your new form.",
            "Hips Rise Too Fast (“Good Morning Squat”": "When weights are approaching 1RM, or you are getting close to failure, it is very common that the squat turns more and more into a so called “good morning squat”. This is the phenomenon where, after the turn in the bottom, you start to rise up, but your hips rise way faster than your shoulders (or the bar), leading to a very forward-leaning position. What is actually happening, when this occurs? The lift (after the bottom) gets separated into two distinct phases: 1. Your legs are extending, which raises your hip, but without moving the bar much or even at all. 2. Not until the legs are more extended and your torso angle is looking kind of like the beginning of a deadlift, does the bar finally start to move as you extend your hips and raise your torso. What is the biomechanical implication of this? Your legs extend without raising the bar much (or at all). This means that your quadriceps have extended without much or any resistance, which in turn means … Your hip and back extensors have to do all the heavy lifting. If your legs have extended but you are left in a forward leaning stance, that means you will have to lift the weight using the muscles that extend your hips and keep your spine straight, like in a good morning or a deadlift. Essentially, work has been shifted from the knee extensors to the hip and back extensors. There might be several reasons for this, but the most likely one is simply that your quads aren’t strong enough to extend against the weight bearing down on them, so they pass over part of the work to the hip extensors. It is very unlikely that this is due to a weak core or weak glutes, both of which seem to be common (mis-)conceptions. If your core or glutes are weak, it would make sense to pass work away from the core and glutes to your quadriceps, thus leading to a more upright, knee-dominant squat. Which is the complete opposite of a good morning-squat. Is it a problem? Not necessarily. It is rather an indicator of where your strengths and weaknesses are right now. Most people will be limited by their quad strength in the squat, and if you display this kind of lifting style, you are likely no exception. The solution in that case would be to focus training on the quadriceps, without overtraining them and risking injury. Here are three examples of routes you could take to prioritize your quad strength while still practicing the squat: 1. Train squats as usual, but add in extra direct quad work. Like leg extensions, leg presses, or bulgarian split squats. 2. Switch some of your squats to more quad-intensive variations where it is harder to pass over the work to the hips. Like front squats, safety bar squats, or zercher squats. 3. Train squats, but lower the weight and reps to the point where you can complete all reps without your hips shooting up. Counter the volume loss in weight and reps by increasing the number of sets."
        },
        "comments": {
            "Popularity": "The squat is known as “the king of all exercises” – and for good reason. Squats have been the staple for bodybuilders looking to grow their leg muscles for decades, and in strength and conditioning, they have been used (and still are used) to improve almost every athletic endeavor that is undertaken on two feet. A reminder here: Squats don’t work your hamstrings. They primarily work your quads, adductors, glutes, and lower back.",
            "Which Squat style to choose, narrow or wide stance -or something in between-?": "World records have been squatted by both styles, and the optimal choice for you is more a matter of individualization than “one style is better than the other”. Try out both narrow and wide stances and everything in between, and see what suits your body better. Some people find that they can squat decently with both a wide and a narrow stance, while others are more distinctly suited to one, and may even be unable to squat with the other. Since the squat is in some essence a balancing act (you must keep your body + the bar’s centre of gravity over the middle of your foot, or you will fall over), the decisions you make in one part of the squat technique, might affect other aspects.",
            "How Deep Should You Squat?": "If you want general leg strength and maximal hypertrophy: Squat as deep as you safely can, but at least down to parallel (= where your thigh is parallel to the floor).",
            "Which Joints Move First in the Descent?": "This will be a highly individual technical consideration. But, there do seem to be a majority of lifters that find that their squat feels a lot better when they initiate the movement by pushing their butt back. Or in other words: begin with the hips. Yes, if you were to monitor the knees and hips closely, you’d likely find that they both start flexing simultaneously, but the hips flex more than the knees in the initial part of the descent.",
            "Shoes": "Firstly and most important: Any shoe you might choose for squatting should be firm and stable. Squatting in a squishy running shoe will hinder your performance, and will in the worst case scenario set you up for an accident. Secondly: Flat or raised heel? Squatting requires a decent amount of ankle dorsiflexion – meaning, bending your ankle joint as you squat down. A narrow stance, feet forward squatting style usually requires more ankle dorsiflexion than a wide stance, feet outward style. Therefore, if you squat with the latter, you might only need to look for a firm and hard-soled shoe and then you’re set. But if you squat more narrow-stanced with feet forward, odds are that you might benefit from a shoe with a raised heel. These are typically called “weightlifting shoes” or “powerlifting shoes”, and come in a variety of brand and heel raise. Some peoples body types and squatting styles will mean that they will never have the need of shoes with a raised heel. For others, a raised heel might mean the difference between squatting pain-free or not. Before you make an expensive purchase, try out for yourself if shoes with a raised heel might be something for you. Stand with your heels on small weightplates (about an inch thick) while squatting with an easy load, and see how it feels. Note: We DO NOT recommend training like this, as it could easily lead to accidents.",
            "The Core Muscles and the Squat": "The core musculature is made up of at least a dozen muscles, both superficial (like your abs and spinal erectors) and deep (like your diaphragm and pelvic floor). The core muscles also surround your spine on all sides: the four abdominals (rectus abdominis, transversus abdominis, and the internal and external obliques) on the front and sides, and the large muscle group erector spinae on the back, are some of the larger ones. Depending on the challenge, different parts of your core will have to work. Are you loading your core from the front, like when standing in a plank, a push-up position, or pushing a car in front of you? Then your abdominals will have to work hard, especially your rectus abdominus and the anterior (forward-most) parts of your inner and outer obliques. Are you loading your core from the side, e.g. standing in a side plank, or carrying something heavy in one hand? Then your inner and outer obliques will have to work hard to keep you straight. Are you loading your core from the back? Like when you place a bar over your shoulders and do a good morning – or a squat. Then the muscles on the back of your core will have to work hard, meaning your erector spinae and multifidus (= your back extensors). The posterior (back-most) parts of your obliques will also aid a little, but not much. Overall, your abs are not very active (nor do they need to be) when squatting. That is not to say that your abs aren’t working at all in a squat, but they are very unlikely to be a limiting factor for performance or technique. The confusion likely stems from confusion about the intra-abdominal pressure (IAP), the term describing that when you trap air in your lungs, and your guts and intestants in your abdomen, and tense the muscles surrounding all of this, you increase the pressure in your abdomen. This acts kind of like a supporting balloon of air, stabilizing your spine and torso. Your core muscles participate in creating this pressure, but that does not mean that all of your core muscles should be maximally active for every given task. The optimal core activation depends on what you are doing! During a squat, your core musculature is trying to keep the bar on your back, without flexing. This is solved by doing two things: 1. The back extensors are working as hard as they can to resist the barbell and keep the spine straight. 2. The other core muscles generate intra-abdominal pressure to aid the back extensors, without creating an unneccessarily large flexing force on the spine which would add to the workload of the back extensors. In summary, the squat does not train your abdominals to any high extent, nor should it be expected to do so. Don’t over-analyze the art of bracing during a squat. Focus on the rest of steps, and let your body figure out what muscles need to be contracted, how much, and when.",
            "Improving the Descent tempo": "The squat descent ideal tempo should be “As fast as you can while still maintaining control.”. In general, if your descent takes ages you are wasting energy and losing your rebound effect at the bottom. If you find that you descend very slowly and want to increase your speed, one way to address that is to train a little more in higher rep-ranges, like several sets around 10 reps or so. The high number of repetitions will subconsciously teach you to conserve your energy while you are repping, and thus might make you chip away at some of your technical unneccessarities, like a too-slow descent. Rotate this high-rep work with regular heavier training every now and then, and try to keep the speed in your heavier sets. It will not happen overnight, but can lead to big changes if you practice it during a regular training block of a month or two. Now, if you descend slowly and it works just fine for you – keep doing it! This is a highly individual technicality, and you must find what works for you. If you however feel that you might gain a little on the ascent if you could speed up your descent just a little bit, then it might be worth giving it some attention. ",
            "Pro tip on the Sticking Point and Lock-Out  - Just if you’re training at very heavy weights": "The sticking point in the squat is typically considered to be somewhere above parallel. If the weight is way too heavy for the lifter, they doesn’t even start lifting it. But when the weight is just barely too heavy, they seem to fail somewhere above parallel. When the thigh angle relative to the floor is 33°, you will (depending on your squat style) have squatted down to about a 70–80° knee flexion. That is, somewhere between a quarter and a half squat. Why does the sticking point occur here? The explanation may be the bounce. Due to the stretch-shortening cycle mentioned earlier, you get some help from your muscles’ and tendons’ elasticity, and this powers you through much of the demanding range of motion that is around the bottom and the parallel thigh position. But when the rubber band effect wears off, you are left to rely on your own muscle force, while still being pretty close to a very demanding position. Logically, this would mean that the sticking point of a pause squat (where you have eliminated the stretch reflex) is different from that of a normal squat. Intuitively, this may be the case: in a pause squat that is just barely too heavy, you’d get stuck lower than a 33° degree thigh angle. Perhaps around parallel, or even just below it? However, besides just making your knee and hip extensors stronger as well as trying to utilize the stretch-shortening cycle, there isn’t too much you can do about the sticking point. Except maybe one thing. There is a technique that some lifters use, which is to drive the hips under the bar when you reach or approach the sticking point. The rationale is that the demands of the knee extensors have decreased at that point, and by shifting your hips forward you might “lend” some work from the quadriceps to the hip extensors via this shift in moment arms. Good squatters utilize it often and it might be worth giving it a shot. If you clear the sticking point, the final lock-out will generally be a breeze.",
            "How to Become Stronger in the Squat?": "The weight you can squat is determined by the amount of force you can produce in your muscles (primarily the extensors of the knees, hips and back) and transfer into the bar. To squat more weight, that is what you will have to improve. If you strip it down to the essentials, there are three different domains in which you can improve in order to accomplish this, and those are: 1. Muscle & tendon. This is your hardware. A bigger muscle produces more force, and a stiffer tendon transfers that force into your bones more efficiently. Skeletal muscle mass is strongly correlated with squat performance. To build bigger muscles, you simply have to train them in any reasonable way. Yes, strength gains can be quite specific in terms of vectors, but if you build bigger and stronger quadriceps using leg extensions (for example), you will still have bigger and stronger knee extensors when you go back to the squat. Tendons increase in stiffness from all heavy training, and the degree of specificity in terms of exercise choice is quite low here as well. Improvements in neuromuscular efficiency and especially technique require more specificity, and you will actually have to practice the lift in which you want to improve. Preferrably at pretty heavy loads. This means that you can roughly divide your squat training into two distinct parts, or goals: 1. Building bigger and stronger muscles. 2. Specific squat practice. Now, squatting in and of itself of course works all the relevant muscles for squatting, but limiting yourself to squats only might limit the amount of productive muscle-building training that you could do, and thus hamper your strength gains – especially in the long term, where muscle mass plays a greater role.",
            "Training Volume for the Squat": "The optimal training volume varies widely between individuals and is dependent on several factors, such as: Training status. The more accustomed you are to training, the more you can handle and will likely need. Age. Young to middle-aged adults likely recover easier than elderly ones. Nutrition. Calories and protein the currencies of adaption. The more you put in, the more you can spend. Recovery. Good sleep and low stress increases your ability to endure and adapt to the training. The relationship between strength (and hypertrophy) gains and training volume follows an inverted U-shape, where both too little and too much training leads to inferior gains. Some general volume recommendations in terms of working sets of squats: sets that are challenging, but are generally not performed to failure, instead leaving 1–2 reps in the tank. Low volume, 6–9 sets per week: This is a suitable volume for the beginner lifter that is simultaneously getting used to deadlifting maybe once a week, and thus is acclimatizing to a lot of new stress. It might also be suitable for the intermediate lifter that is either tapering, or taking a minimalistic approach to squatting while perhaps focusing on hypertrophy work for the squat musculature. Medium volume, 10–16 sets per week: The goldilocks zone, and probably a nice target volume for a majority of people in the intermediate stage. Recovery demands will be quite low if this is the only training you do for the lower body, but if you add in deadlifts and squat accessory training, the total volume will place quite high demands on your recovery. This might be a suitable volume for an advanced lifter who is tapering. High volume, 17–24 sets per week: For the intermediate lifter who is stuck on a plateu and wants his or her squat to ascend to the next level, or for the advanced lifter. Recovery demands are high, especially if this is coupled with deadlift training and accessory work. Most will have to gradually increase their volume to this level over a long period of time, and some lifters might simply find it to be too much for them, and that medium volume works better.",
            "Training Frequency for the Squat": "Training frequency might be an important mediator for training volume. Do you want to train a lot? Then sooner or later you’ll have to distribute the training on more days, before your current workouts swell beyond the scope of what is productive to do in one session. A rough limit on the number of work sets of squats in a single session might be somewhere in the neighbourhood of 10 sets. About 2–3 squat sessions per week is probably a good starting point for someone who also trains deadlifts or similar lower-body movements. Recovery after squatting seems to happen about as fast as recovery after both deadlifting and bench pressing. Habituation to a high training frequency thus seems most important.",
            "Load & Reps": "Your strength can improve from training with both high and low loads, but when you compare them head to head, lifting heavy weights is slightly more effective if you want to get better at lifting heavy weights. There are several rep and loading strategies that work, as long as you heed the principle of specificity (lifting heavy every once in a while) and progressive overload (adding weight or reps progressively). A couple of basic templates for how to structure your workouts in the context of the two principles mentioned above are: \n1. Pyramid training. Increase/decrease the weights in a pyramid fashion during your workout. E.g. go from 6–10 reps at 60% of 1RM, up to 1+ reps at 90%, and back down to 60% again. That way you’ll get some practice at heavier weights, while still getting a good amount of volume in. \n2. Slug away at 80%. The range of about 75–85% of 1RM is the powerlifters bread and butter. It’s heavy enough to be specific training for max attempts, but not so heavy that it burns you out. It’s typically possible to accumulate a large, effective volume at this intensity. Something like 6–10 sets x 2–4 reps might be appropriate for one workout.",
            "Pro-tip: How to improve general squat mobility?": "There are two common problem areas where people lack the mobility to be able to perform the squat in a safe and efficient manner: the hips, and the ankles. 4 different ways to approach this to find a solution: \n1. Squat more. Using a joint in the desired movement is often the best way to improve its mobility and range of motion. If you’ve never squatted before, give yourself lot’s of time in the beginning to accustom yourself and your body to squatting. Your body will adapt, and you will get a little better each week. It might benefit you to spread your training volume over a little more workouts per week, to get more frequent practice. \n2. Experiment with stance. Try placing the bar lower, widening your stance, opening up your hips and pointing your toes out. This kind of low bar-style reduces the requirement of ankle mobility, but has higher requirements of hip mobility. Alternatively, try placing the bar higher on your back, feet closer together and toes poinint forward. This requires good ankle mobility, but lower hip mobility. \n3. Get lifting shoes with raised heels. A raised heel acts like “artificial ankle mobility”, and can work wonders for your squat technique. Test if shoes with a raised heel might be for you by placing your heels on small weight plates or a thin wooden plank or such, and squat. Note: We DO NOT recommend training like this, as it could easily lead to accidents. \n 4. Try to increase your joint mobility directly. A common exercise for increasing your mobility for the squat is to squat down and hold onto a support in front of you to keep your balance, and then try to stretch out everything that feels tight. You can also use a kettlebell or other weight for balance by holding it to your chest. Repeat this a few times daily for quick mobility gains, or as a warm-up before squatting. A more aggressive approach for increasing your ankle mobility is to squat down, and place a barbell on top of your knees, pushing them down. Hold it on top of your knees with your hands, and oscillate up and down in this position."
        },
        "alternativesAndVariations": {
            "Hypertrophy: Exercises that will strengthen and grow the muscles used in the lift.": "The primary movers in the squat are the knee extensors (quadriceps), hip extensors (glutes, adductor magnus), and back extensors (erector spinae), so that is the muscles you should be most concerned about getting to grow. The options for hypertrophy exercises are many, and more a matter of personal preference than anything else. We will now share some exercises that you might use to supplement your training for the muscles involved in the squat. If you are not sure, we recommend to pick deadlift + 1–2 of the exercises below, and do 2–3 sets at 1–2 workouts per week. If you squat with a low volume (relative to your training level), you can increase the volume of supplementary exercises: 1. Deadlift (knee, hip and back extensors), 2. Front squat (knee, hip and back extensors), 3. Bulgarian split squat (knee and hip extensors), 4. Leg press (knee and hip extensors), 5. Belt squat (knee and hip extensors), 6. Leg extension (knee extensors), 7. Hip thrust (hip extensors), 8. Kettlebell swing (hip and back extensors), 9. Good morning (hip and back extensors).",
            "Technique: Exercises that strengthen the movement, or improve the performance or technique of the lift.": "These are generally more taxing than the hypertrophy exercises listed earlier, and also cut in more into your other squat volume. Working sets of the exercises listed below should probably be traded in for your regular sets of squats if you’re already training at a high volume, rather than piled on top of it. \n1. Pause squats. Can be used to improve overall technique, and strength around the position that you pause in. We generally recommend pausing in the bottom position, and for a count of three. Pausing in the bottom position also helps engraining a feeling of what correct depth is. \n2. Tempo squats. Slowing things down increases your control and body-awareness, and also gives to more time to correct errors. This can be used as an aid to improve technique, e.g. it could be used to correct errors like knees caving in, butt wink, and going up on the toes. You can choose to slow down the tempo on the way down, up, or both.\n3. Box squats. Can be used for a variety of purposes, including: Finding correct depth, limiting the movement in case of injury, practicing technique and body awareness in the bottom, and training your strength from the bottom. \n4. Front squats. Shifts the workload more to your quadriceps and unloads the hip extensors slightly. Increases the demands of especially upper back strength. It can be used to strengthen quadriceps and upper back, and teach a more upright squatting posture."
        }
    }
}