{
    "barbell-lying-triceps-extension": {
        "form": {
            "Steps": "\n1. Lie down on a bench with your head close to the edge. Hold a barbell with a shoulder-width grip, and lift it up to straight arms over yourself. \n2. Lower the barbell down behind your head. Try to keep the same distance between your elbows throughout the movement. \n3. Reverse the motion and extend your arms again.",
            "Form": {
                "1. Positioning": "Make sure to keep your spine neutral, and your whole feet on the ground. Place yourself on the bench so that your head is in line with the top of the bench.",
                "2. Movement": "Keep your wrists locked, and lower the barbell down behind your head. Keep your core engaged during the entire movement, so that you prevent your lower back from arching. Go as far down as your mobility lets you, and then reverse the movement."
            }
        },
        "tempo": "3110",
        "commonMistakes": {
            "1. Flaring elbows": "Letting the elbows flare out to the sides during the movement makes the exercise less effective, and can also be stressful for the shoulder joint. Keep your elbows at the same length apart throughout the movement.",
            "2. Hyperextending the lower back": "Arching the lower back excessively can place strain on the spine and increase the risk of injury. Maintain a neutral spine and engage your core throughout the exercise to provide stability.",
            "3. Adding too much weight": "Using weights that are too heavy can lead to poor form, reduced range of motion, and increased risk of injury. Choose a weight that allows you to complete the desired number of repetitions with proper form.",
            "4. Shortened range of motion": "Limiting the range of motion by not lowering the barbell enough or not fully extending the arms can hinder triceps development. Aim for a full range of motion, lowering the barbell behind the head and extending the arms fully on each repetition."
        },
        "comments": {
            "Muscle Growth": "A Brazilian training study found that the barbell lying triceps extension was effective for growing the triceps: a 10% increase in muscle volume after eight weeks, compared to a 5% volume increase in another group that only trained the bench press. Interestingly, the barbell lying triceps extension mainly elicited growth in the long and medial head of the triceps, and the bench press mainly elicited growth in the lateral head, meaning that if you couple this exercise with a pressing exercise, you get complete triceps development.",
            "Long Head Emphasis": "The reason lying tricep extensions are so effective at working the long head of the triceps, is that when you lower the barbell behind your head, you raise your arms relative to your torso. This engages the long head of the triceps that originates from your shoulder blade, and not your upper arm like the other two heads.",
            "Sets and Reps": "How many reps you should do of an exercise depends on your goal: do you mainly want to increase your strength or build muscle? Generally, a lower rep range of about 1–5 reps per set is most effective for strength gains. For muscle gains, a slightly higher rep range of about 8–15 reps per set is generally the most effective and practical. Of course, you will see an increase in both muscle and strength regardless of which rep range you choose, but you can emphasize one or the other slightly by working in the right number of reps. Most lifters prefer to work in the upper rep range while doing the barbell lying triceps extension. It’s an isolation exercise, and while a strong triceps could be a goal for many lifters, heavy weights and low reps in this exercise is often uncomfortable. How many sets you do of an exercise depends on your training experience, how many times you work out in a week, and your other training. But around ten sets per week for a given muscle group is a good starting point, and you can go even higher when you are used to training or if you stop your sets short of failure."
        },
        "alternativesAndVariations": {
            "1. Dumbbell Lying Triceps Extension": "This variation is performed with dumbbells instead of a barbell, allowing for a greater range of motion and independent movement of each arm. The movement pattern should be the same as in the barbell version, and make sure to keep your elbows from flaring.",
            "2. Dumbbell Standing Triceps Extension": "The standing triceps extension places an even greater stretch on the triceps, and likely emphasizes the long head of the triceps even more because of the elevated position of the upper arm. The standing version requires you to engage your core a bit more to maintain your posture and balance throughout the exercise. In contrast, the lying triceps extension provides more stability as the body is supported by the bench.",
            "3. Overhead Cable Triceps Extension": "Overhead cable triceps extension provides constant tension throughout the entire range of motion, leading to potentially greater muscle activation than the barbell lying triceps extension which relies on gravity and, therefore, may not have constant tension throughout the movement. However, the overhead cable triceps extension could be a bit tougher on your lower back, so make sure to keep your core activated to support it throughout the movement. Like the dumbbell overhead triceps extension, the cable overhead extension allows for an even greater stretch and longer range of motion than the lying triceps extension.",
            "4. Barbell Lying Triceps Extension vs Skull Crushers": "Both exercises are very similar, but there can be subtle differences in the range of motion or angle of the movement depending on how they are performed. In the barbell lying triceps extension, the barbell is lowered behind the head rather than towards the forehead, resulting in a longer range of motion than the skull crusher. Lowering the barbell behind the head engages the long head of the triceps more effectively due to the increased stretch. The skull crusher involves lowering the barbell towards the forehead, which can limit the range of motion but still effectively targets the triceps muscles. Both are good exercises for the triceps and while you might not need to do them both during the same workout, you can incorporate them during different training blocks for some variation."
        }
    }
}