{
"barbell_row": {
"form": {
"Steps": "\n1. Stand with your feet about shoulder-width apart, with your toes pointing forward or slightly out. \n2. Bend at your hips to lower your torso, keeping your back straight. \n3. Grip the bar with an overhand grip, slightly wider than shoulder-width apart. \n4. Let the bar hang from straight arms. \n5. Inhale and pull the bar towards you. \n6. Pull the bar as high as you can, aiming for your lower chest. \n7. With control, lower the bar back to the starting position.",
"Form": {
"1. Feet": "Your feet should be about shoulder-width apart, with your toes pointing forward or slightly out. Try to keep your weight evenly distributed under your feet during the exercise.",
"2. Forward Lean": "How much you lean forward will determine what muscles are working. As a rule of thumb, the muscles on “the other side” of your body, relative to gravity and the position of the weight, will be the most worked. More of an upright row? You will work your upper trapezius and shoulders more. More of a horizontal back angle? You will work a little more of your mid-to-upper back. A cue for getting a horizontal back angle is to think “butt back”. That is, try to push your butt as far back as possible. That will help maintain your center of gravity over your feet despite the horizontal back angle.",
"3. Back": "Aim to keep your back in a neutral position; neither flexed forward nor arched.",
"4. Grip": "Grip the bar with a double overhand grip. Try a grip that is slightly wider than shoulder-width apart. Your optimal grip width will be determined by your arm length and torso thickness, and you should experiment with different hand placements to see what feels best for you. Generally, a narrower grip will allow for a longer range of motion but also a more difficult top of the movement (where the barbell meets your abdomen).",
"5. Shoulder Blades": "Your shoulder blades should be moving in this exercise. \n1. In the bottom position, let your shoulder blades slide forward to a neutral or even slightly protracted (forward) position. \n2. As you pull the bar up, pull your shoulder blades back and together.",
"6. Line of Pull": "In barbell rows, you typically row the barbell toward your abdomen or low chest. If you row the barbell higher on your chest, the exercise starts to resemble barbell rear delt rows. That will mostly work your rear delts and the top parts of your back, and not as much of your mid-back as regular barbell rows do. If you row the barbell further down on your belly, towards your belly button, you will decrease the involvement of your biceps and move more work to your back muscles. Do you have to touch the barbell to your abdomen every rep? Well, there’s a few ways to see it: Touching the bar to your abdomen makes for a clear end point of the repetition for most people. If you can’t get the barbell all the way up, perhaps you should consider using lighter weights. Some people’s anatomy, however, will make that very difficult. You might have very long arms, which makes this more difficult. This is doubly true if your forearms, in particular, are long. Couple this with having a flat belly, and touching the barbell to your abdomen might be a very different ordeal than it is for a short-armed person with a thick torso. The point of interest is this: do you feel like you are getting a good enough workout for your back muscles with a decent range of motion? Then you’re probably fine, no matter where the barbell ends up. It is also fine to do the first bunch of reps to your abdomen and then row as high as you can for the last few reps of the set. That can be an efficient way to tire out your muscles, and there are no right or wrongs here.",
"7. Swinging": "When you “swing” the weight up in the barbell row, you use your hips (glutes and lower back) to generate momentum, which takes away work from your upper back muscles. If your purpose of doing the barbell row is to work those upper back muscles, you should avoid swinging the barbell up. The most common cause of swinging in the barbell row is that you are using too much weight. Try lowering the weight and performing the row with a more strict form. If your goal is pure strength, however, it might align with your goal to use a bit of momentum in the barbell row. In real life (or competitions), we often use momentum to be more effective when we lift stuff. Therefore, if you are training for sports or strongman competitions, some swinging in your barbell rows might be beneficial. Just keep an eye on your total training volume for your lower back, as heavier weights mean more stress."
}
},
"tempo": "2110",
"commonMistakes": {
"1. Swinging": "Using momentum from your hips to pull the bar up, you increase the amount of work done by your lower back and your glute muscles but decrease the work done by your upper back. If your purpose of doing the barbell row is to work those upper back muscles, you should avoid swinging the barbell up. The most common cause of swinging in the barbell row is that you are using too much weight. Try lowering the weight and performing the row with a more strict form.",
"2. Yates Row": "The Yates row (named after bodybuilder Dorian Yates) is a barbell row with an underhand (supinated) grip. This change in grip moves some of the work away from your back muscles and to your biceps. It should also be noted that this grip probably increases the risk of a biceps tear."
},
"comments": {
"Popularity": "The barbell row is a classic back exercise and one of the most popular strength training exercises.",
"Grip": "Don’t hesitate to use lifting straps if necessary, if your purpose for doing this exercise is to build your back muscles and not to train your grip strength. Most people can do significantly more reps or use heavier weights if they use lifting straps, which means a better training effect for your back muscles.",
"Reps": "The number of reps you do in the barbell row should be guided by your purpose for doing the exercise. For muscle growth, around 6–15 reps per set is suitable in the barbell row. For strength, around 3–8 reps per set is good. There are no clear-cut lines between these two goals, however. Training in the “muscle growth range” will still increase your strength, and training in the “strength range” will still cause your muscles to grow. It’s just a matter of what you are emphasizing."
},
"alternativesAndVariations": {
"1. Seated Cable Row": "The seated cable row is fairly similar to the barbell bent-over row in terms of muscles worked; you’re pulling in a similar direction relative to your torso, and hit many of the same muscles in your mid-back. The main difference is the lack of (or lower) loading of the lower back. While your lower back is still involved slightly in seated rows, it’s not on the same level as in the barbell row. This can be beneficial if you want to work your upper back without loading your lower back.",
"2. Machine Row": "The seated machine row, or chest-supported row, is a rowing exercise that almost completely unloads your lower back. This makes it easier to focus on the muscles working in your upper back, and isolate them in your training. This exercise is a good alternative if you have lower back issues, don’t want to add to your lower back training volume, or want to focus on and isolate your upper back muscles.",
"3. Dumbbell Row": "The dumbbell row is a unilateral (one-sided) rowing exercise, as opposed to the barbell row which is bilateral (two-sided). This typically allows for greater focus on the muscles of each side, but with the added cost that you have to perform twice as many sets. Another benefit of dumbbell rows is that you can often get a longer range of motion in this exercise compared to other rowing exercises, which is good for your muscle growth. This is yet another exercise in which your lower back isn’t loaded as heavily as in the barbell row, which can be both a benefit and a drawback.",
"4. Pendlay Row": "The difference between barbell rows and Pendlay rows is that in the Pendlay row, you put the barbell back on the floor between each repetition. In the regular barbell row, you don’t put the barbell down until your set is finished. By putting the barbell down between reps, your lower back gets a little rest. It also means that you will begin each rep from a dead start, not having as much tension in your muscles as if you would have kept it off the ground.",
"5. T-Bar Row": "The t-bar row is another variation of the classic barbell row, where you use a t-bar instead of a regular barbell. The t-bar makes the exercise more stable, which often means you can use more weight and exhaust your muscles more. You still have to engage your lower body and your core to maintain position, though."
}
}
}
