{
    "barbell-standing-triceps-extension": {
        "form": {
            "Steps": "\n1. Grip a barbell with a close grip, and lift it up to straight arms over your head. \n2. Lower the barbell behind your head while keeping your upper arms still and vertical. \n3. Reverse the motion and extend your arms again.",
            "Form": {
                "1. Grip": "Grip the bar with a firm, but not excessively tight, grip, and keep your hands closer than shoulder-width apart.",
                "2. Stance": "Hold the barbell overhead, and keep your feet shoulder-width apart to maintain balance.",
                "3. Back & Core": "Keep your back straight and engage your core for stability throughout the exercise.",
                "4. Wrists": "Keep your wrists locked.",
                "5. Elbows": "Keep your elbows at the same length apart throughout the movement.",
                "6. Movement": "Lower the barbell down behind your head. Keep your core engaged during the entire movement so that you prevent your lower back from arching. Go as far down as your mobility lets you, and then reverse the movement."
            }
        },
        "tempo": "3110",
        "commonMistakes": {
            "1. Flaring elbows": "Letting the elbows flare out to the sides during the movement makes the exercise less effective and can also be stressful for the shoulder joint.",
            "2. Hyperextending the lower back": "Arching the lower back excessively can place strain on the spine and increase the risk of injury. Maintain a neutral spine and engage your core throughout the exercise to provide stability.",
            "3. Adding too much weight": "Using weights that are too heavy can lead to poor form, reduced range of motion, and increased risk of injury. Choose a weight that allows you to complete the desired number of repetitions with proper form."
        },
        "comments": "Standing triceps extension is an effective exercise for isolating the tricep muscle. The standing position puts a great stretch on the triceps and likely emphasizes the long head of the triceps more because of the elevated position of the upper arm.",
        "alternativesAndVariations": {
            "1. Dumbbell Standing Triceps Extension": "This variation is performed with dumbbells instead of a barbell, allowing for a greater range of motion and independent movement of each arm. This can help you to work on any imbalances between your arms. The movement pattern should be the same as in the barbell version, and make sure to keep your elbows from flaring.",
            "2. Overhead Cable Triceps Extension": "In this variation, a cable machine is used instead of a barbell. This means that you’ll have a constant throughout the movement, which might be beneficial for muscle growth. However, the barbell version might be more accessible for many lifters since you only need a barbell to perform it.",
            "3. Barbell Lying Triceps Extension": "The lying triceps extension provides more stability as the body is supported by the bench, while the standing version requires you to engage your core a bit more to maintain your posture and balance throughout the exercise.",
            "4. Dumbbell Lying Triceps Extension": "This variation offers the stabilization from the lying barbell version but also the possibility to work on any imbalances between the arms thanks to the dumbbells. It also offers a little longer range of motion than the barbell version."
        }
    }
}