{
    "barbell-preacher-curl": {
        "form": {
            "Steps": "\n1. Grab a barbell and sit down at a preacher curl bench, resting your upper arms against the pad. \n2. Lower the barbell as far as you can, with control. \n3. Reverse the motion and return to the starting position.",
            "Form": {
                "Pad Height": "Make sure to adjust the pad to a comfortable height. The top of the pad should sit comfortably under your armpits when your arms are fully extended.",
                "Feet": "Keep your feet flat on the ground for added stability.",
                "Upper Body": "It’s important to keep your upper body activated, and not just “hang” over the pad. Keep your core and back slightly activated during the entire movement",
                "Range of Motion": "If fully extending your arms feels uncomfortable, you can avoid that position by reversing the movement earlier. But try to keep the range of motion as long as possible for maximum muscle activation."
            }
        },
        "tempo": "2110",
        "commonMistakes": {
            "Using too heavy weights": "By adding more weight than you can lift, you might start to swing your body and use momentum to get the weight up. Another sign of using too much weight is if you’re not using the full range of motion and start doing half reps instead. Keep your body still and your upper arms pressed against the pad.",
            "Not locking your wrists": "Keep your wrists straight during the movement. If they’re bent, it can put an unnecessary load on them and lead to discomfort and maybe even injuries."
        },
        "comments": {},
        "alternativesAndVariations": {
            "1. Dumbbell Preacher Curl": "The dumbbell preacher curl is a one-sided variation of the preacher curl that involves using a dumbbell instead of a barbell. A benefit of this variation is that you can easily identify and work on any side-to-side differences in strength. You are also able to focus fully on the muscle worked. A downside is that performing this exercise for the same volume will take twice as long compared to the barbell preacher curl, because you’re only working one side at a time.",
            "2. Machine Bicep Curl": "The machine preacher curl is a great alternative if you find the barbell preacher curl uncomfortable. Because machines take care of the stabilization and balancing for you, it is often easier to focus on the muscles worked when using them.",
            "3. Barbell Curl": "If you don’t have access to a preacher pad or bench, the classic barbell bicep curl is an option. This is one of the best bicep exercises you can do, but be careful not to start cheating by swinging the weight up, using your upper back or hips.",
            "4. Bodyweight curl": "The bodyweight curl is a good alternative for training biceps if you don’t have access to any external weight. All you need is a TRX or something similar to hang on to, and then use your own body weight and gravity as resistance."
        }
    }
}