{
"barbell_upright_row": {
"form": {
"Steps": "\n1. Stand with your feet about shoulder-width apart. \n2. Grip the bar with an overhand grip, slightly narrower than shoulder-width apart. \n3. Let the bar hang in front of your body, with your arms fully extended. \n4. Pull the bar straight up, keeping it close to your body. \n5. Aim to bring the bar up to the level of your chin, keeping your elbows pointing out to the sides. \n6. With control, lower the bar back to the starting position.",
"Form": {
"1. Stance": "Stand with your feet about shoulder-width apart, with your toes pointing forward or slightly outward. Maintain a stable and upright posture throughout the exercise.",
"2. Grip": "Use an overhand grip, with your hands slightly narrower than shoulder-width apart. Your palms should be facing your body. Ensure that your grip is secure and firm.",
"3. Back and Core": "Keep your back straight and your core engaged throughout the movement. Avoid arching your back or leaning forward excessively. Maintaining a neutral spine helps prevent injury and ensures that the targeted muscles are effectively worked.",
"4. Elbows": "As you lift the bar, keep your elbows pointing out to the sides. This helps target the lateral deltoids (side delts) more effectively and reduces strain on the shoulder joint.",
"5. Range of Motion": "Pull the bar up until it reaches the level of your chin, or slightly lower if you experience any discomfort in your shoulders. Avoid using momentum or swinging the weight up. Focus on a controlled and deliberate movement.",
"6. Breathing": "Inhale as you lower the bar and exhale as you lift it. Proper breathing helps stabilize your core and ensures that you have enough oxygen to fuel the movement."
}
},
"tempo": "2011",
"commonMistakes": {
"1. Using incorrect grip": "Gripping the bar too wide reduces the range of motion and shifts the focus away from the targeted muscles. Your hands should be closer than shoulder-width apart.",
"2. Not keeping elbows out": "By lifting the weight with your wrists and not keeping your elbows out, you’ll move the work from the targeted muscles and the exercise will be less effective."
},
"comments": {
"1. Shoulder pain": "The barbell upright row is a good exercise for targeting your mid-delts. However, this exercise has a bad rep for causing shoulder pain from impinging your shoulders at the top of the movement. You can mitigate the risk of shoulder pain by starting with light weights and a low number of sets and by avoiding elevating your upper arms above shoulder height at the top of the movement.",
"2. Strength-building exercise": "The barbell upright row is not typically used as a primary strength-building exercise for the shoulders. Our recommendation is to perform bigger compound exercises, like the overhead press, for that purpose. The upright is an isolation exercise that lends itself better to moderate rep ranges and lighter weights with a controlled movement in this case."
},
"alternativesAndVariations": {
"1. Cable Upright Row": "By doing the upright row in a cable machine instead of using a barbell, you could get a more natural movement pattern thanks to the constant tension provided by the cable machine. So if you feel like the barbell upright row might be a bit hard on your shoulder joints, you might want to give the cable version a go.",
"2. Monkey Row": "The monkey row is a similar exercise as the barbell upright row, but involves a wider grip and a more outward pull. This exercise might feel a bit easier on your shoulder joints than the barbell upright row.",
"3. Dumbbell Lateral Raise": "The dumbbell lateral raise is a more isolating exercise, which focuses more directly on the lateral deltoids. The upright row involves more muscles, but if you find it hard to perform it, or finding muscle contact with your lateral delts, the lateral raise might be a good alternative."
}
}
}
