{
"clamshells": {
"form": {
"steps": "\n1. Lie on your side with your hips and knees bent to about a 90-degree angle, your heels together. Your head should be resting on your lower arm, and your upper arm can be resting on your torso or bent with your hand supporting your head. \n2. Tuck your pelvis in slightly to engage your core and ensure your glutes are activated. \n3. Keeping your feet together, raise your upper knee as high as you can without rotating your hip or lifting your lower leg off the floor. You should feel the contraction in your outer glute (gluteus medius). \n4. Hold for a moment at the top of the movement, then slowly lower your upper knee back to the starting position.",
"form": {
"Hips": "Keep your hips stacked on top of each other, don't let your top hip roll back.",
"Feet": "Maintain contact between your feet throughout the exercise.",
"Pelvis": "Keep your pelvis slightly tucked to engage your core and glutes.",
"Movement": "The movement should be slow and controlled, focusing on squeezing the glutes at the top."
}
},
"commonMistakes": {
"Rotating the Hip": "Rotating your hip outward instead of keeping it stable, which reduces glute activation.",
"Lifting the Lower Leg": "Lifting your lower leg off the floor, which indicates that you're using momentum instead of glute strength.",
"Rushing the Movement": "Performing the exercise too quickly, which reduces muscle activation and can lead to injury.",
"Not Engaging the Core": "Failing to engage your core, which can lead to poor form and reduced effectiveness."
},
"comments": {
"Muscle Activation": "Clamshells are a great exercise for activating and strengthening the hip abductors, particularly the gluteus medius, which is important for hip stability and preventing knee injuries.",
"Progression": "To make the exercise more challenging, you can add resistance by placing a resistance band around your thighs, just above your knees.",
"Focus on the Glutes": "Throughout the exercise, focus on contracting and squeezing your glutes to maximize muscle activation."
},
"alternativesAndVariations": {
"Side-Lying Hip Abduction": "Similar to clamshells, but with your legs straight. This variation targets the hip abductors more directly.",
"Banded Hip Abduction": "Performed standing with a resistance band around your ankles. Step sideways against the resistance of the band to work the hip abductors.",
"Hip Thrusts": "A compound exercise that works the glutes, hamstrings, and quads. It also strengthens the hip abductors to a lesser degree.",
"Lateral Band Walks": "A dynamic exercise that involves stepping sideways with a resistance band around your ankles, working the hip abductors and improving lateral stability."
},
"tempo": "2111 (2 seconds lifting, 1 second hold at the top, 1 second lowering, 1 second pause at the bottom)"
}
}
