{
"crunch": {
"form": {
"steps": "\n1. Lie on your back with your feet flat on the floor, hip-width apart, and knees bent at a 90-degree angle. Place your hands lightly behind your head, or crossed over your chest. \n2. Engage your core and lift your head, shoulders, and upper back off the ground, as if you are trying to bring your ribcage towards your hips. Your lower back should remain in contact with the floor. \n3. Exhale as you crunch up, ensuring you're using your abdominal muscles to lift your body, not your neck or shoulders. \n4. Slowly lower back down to the starting position, inhaling as you do so.",
"form": {
"Head and Neck": "Keep your head and neck relaxed, avoiding pulling on your neck. Imagine holding a tennis ball under your chin to maintain a neutral spine.",
"Shoulder and Back": "Focus on lifting your upper body off the ground using your abdominal muscles, not by momentum or by pulling with your shoulders or neck. Your lower back should maintain contact with the floor throughout the exercise.",
"Breathing": "Exhale as you contract your abs and lift your torso, and inhale as you lower back down.",
"Range of Motion": "Focus on quality over quantity. It's better to perform a controlled crunch with a shorter range of motion than to strain your neck or use momentum to achieve a larger movement."
}
},
"commonMistakes": {
"Pulling on the Neck": "Pulling on your head or neck with your hands, which can strain your neck muscles.",
"Arching the Lower Back": "Arching your lower back off the floor, which can lead to lower back pain.",
"Using Momentum": "Using momentum to swing your body up instead of engaging your abs.",
"Holding Breath": "Holding your breath throughout the exercise, which can lead to dizziness and fatigue. Remember to breathe!"
},
"comments": {
"Target Muscles": "Crunches primarily work the rectus abdominis muscle (the 'six-pack' muscle) and also engage the obliques (side abs) to a lesser extent.",
"Variations": "You can vary the crunch by performing it on a decline bench for increased difficulty or by adding a twist at the top of the movement to further engage the obliques.",
"Progression": "As you get stronger, you can increase the difficulty by holding a weight plate across your chest or by performing weighted cable crunches.",
"Alternatives": "Other effective ab exercises include planks, reverse crunches, and hanging leg raises."
},
"alternativesAndVariations": {
"Bicycle Crunches": "A variation that involves bringing opposite elbow and knee together, targeting both the upper and lower abs as well as the obliques.",
"Reverse Crunches": "Focus on the lower abs by bringing your knees towards your chest while lying on your back.",
"Plank": "An isometric exercise that strengthens the entire core, including the abs, obliques, and lower back.",
"Hanging Leg Raises": "A challenging exercise that targets the entire abdominal region, particularly the lower abs."
},
"tempo": "2011 (2 seconds lifting, 0 seconds pause at the top, 1 second lowering, 1 second pause at the bottom)"
}
}
