{
"dead-bugs": {
"form": {
"steps": "\n1. Lie on your back with your arms straight up towards the ceiling and your legs raised with your knees bent at a 90-degree angle, so that your shins are parallel to the floor. \n2. Engage your core, and make sure that your lower back maintains contact with the floor. \n3. With control, slowly straighten out one leg and lower it towards the floor, while simultaneously lowering the opposite arm over your head, reaching as far as you can. \n4. Reverse the movement, returning to the starting position, and repeat for the other side.",
"form": {
"Lower Back": "Maintain contact between your lower back and the floor throughout the entire exercise. Imagine your lower back is melting into the floor.",
"Core": "Keep your core engaged throughout the exercise. Think about drawing your belly button in towards your spine.",
"Breathing": "Don't hold your breath. Breathe deeply throughout the exercise, exhaling as you extend your arm and leg, and inhaling as you return to the starting position.",
"Limb Movement": "Move your limbs slowly and with control. Avoid any jerking or swinging movements."
}
},
"commonMistakes": {
"Arching Lower Back": "This is usually caused by weak core muscles or going too fast. Focus on engaging your core and keeping your lower back flat on the floor.",
"Holding Breath": "Remember to breathe deeply throughout the exercise. Exhale as you extend your limbs and inhale as you bring them back to the starting position.",
"Moving Too Quickly": "The dead bug is not a race. Move slowly and with control to maximize muscle engagement and minimize the risk of injury.",
"Not Extending Limbs Fully": "For a greater challenge, try to fully extend your arm and leg as far as you can while maintaining a neutral spine."
},
"comments": {
"Benefits": "The dead bug is a great core exercise that strengthens the abdominal muscles, improves stability, and enhances coordination. It is a low-impact exercise that is easy on the spine, making it suitable for people of all fitness levels.",
"Progression": "As you get stronger, you can increase the difficulty of the dead bug by adding weight to your hands or feet. You can also try variations such as the weighted dead bug, the band anti-rotation dead bug, or the dead bug with leg raise.",
"Coordination": "The dead bug is an excellent exercise for improving coordination and stability. It requires you to control the movement of your limbs while maintaining a stable core."
},
"alternativesAndVariations": {
"Plank": "A static exercise that strengthens the core, shoulders, and back. Unlike the dead bug, the plank requires you to hold a straight-arm position, supporting your body weight on your forearms and toes.",
"Hollow Body Hold": "Another great exercise for strengthening the core muscles. It involves lying on your back and raising your arms and legs off the ground, creating a hollow shape with your body.",
"Bird Dog": "An exercise that targets the core, back, and glutes. It involves kneeling on all fours and extending one arm and the opposite leg, maintaining a straight line from head to toe.",
"Flutter Kicks": "A dynamic exercise that works the lower abs. It involves lying on your back with your legs extended and lifting your feet slightly off the ground, then alternating kicking your legs up and down in a fluttering motion."
},
"tempo": "2020 (2 seconds lowering, 0 seconds pause at the bottom, 2 seconds lifting, 0 seconds pause at the top)"
}
}
