{
    "deadlift": {
        "form": {
            "Steps": "\n1. Step up close to the bar so that it is about over the middle of your foot. \n2. Bend over and grip the bar with hands about shoulder-width apart. \n3. Inhale, brace your core slightly, and lift the bar by extending your hips and knees. \n4. Pull the bar close to your body, with a straight back, until you are standing straight up, with hips and knees locked out. \n5. Lower the bar back to the ground with control. \n6. Take another breath, and repeat for reps.",
            "Form": {
                "1. Foot Position": "A rule of thumb is to point your toes in the same direction that your knee travels. This is not set in stone, however, and you still have some leeway to divert from this. You can choose to place your feet all the way together until your heels are touching. This will probably also require you to point your toes out a bit. More common and the best fit for most people, however, is to simply place the feet directly under your hip joints, with your toes pointing straight forward or only slightly out. What you’ll want to avoid is a stance so wide that your knees push your arms out. You’ll want your arms to be perpendicular to the floor as seen from the front, as this will result in the shortest and strongest range of motion. With a wide grip, you’d have to lean over more to reach the bar, resulting in a weaker starting position. It is a good idea to experiment a bit with different foot positions when you’re learning the deadlift, as your individual limb lengths will dictate what position suits you better.",
                "2. Arms": "The best visualization of your arms’ roles in the deadlift is to act like ropes, attaching the bar to your shoulders. Preferrably, these should also be both long and straight ropes, as that will allow you to maximize your starting height in the lift. The first few inches of a deadlift is the biomechanically weakest part of the lift, and the more you can extend your knees and hips from the start, the easier it will be to pass this point. If you deadlift with your arms bent or excessively wide, you will have to lean over more, and thus end up in a weaker starting position.",
                "3. Grip": "How to grip the bar? There are 4 common ways: \n1. Double overhand grip. This is the standard, intuitive way to grab a barbell. You simply hold on to it with both palms facing your body (pronated), and the thumbs opposing the other fingers. Pros: Comfortable and intuitive. The way you usually grab stuff. Symmetrical for your arms and shoulders. Cons: Weak! The barbell will want to roll out of your grip. This grip technique is usually fine for beginners learning the deadlift form, but quickly becomes a greatly limiting factor for how much you can lift. \n2. Hook grip. Common in weightlifting and  an evolution of the double overhand grip. Despite them being very similar, the hook grip increases the weights you can lift by 20–30% or more. You still grab the bar with a double overhand grip, with the difference that you stick your thumb under your index finger (and maybe also your middle finger). The thumb will act like a wedge or a chock and hinder the bar from rolling out of your grip. Pros: Much stronger than a regular overhand grip. Symmetrical for your arms and shoulders. Cons: Painful! It gets better with time, but will still be more uncomfortable than the normal way of gripping a bar. \n3. Mixed grip. Most common grip technique in powerlifting. Here, you counter the barbell’s rotation by supinating one hand – that is, turning one palm facing away from you. Like the hook grip, this greatly increases the weight you can lift. Pros: Much stronger than a regular overhand grip. Not very painful or wearing on your skin (compared to hook grip). Con: Asymmetrical for your arms and shoulders, which might transfer to an asymmetrical spine and hip position. It is unclear, however, if this actually is a problem. \n4. Lifting straps (not allowed in most powerlifting competitions). Pros: Using lifting straps will remove any grip related limitations for your pulls, will spare your skin, and also enable you to pull with a symmetrical overhand grip. Cons: 1. You won’t reap the benefit of developing your grip strength during training. 2. One more thing to carry around in your gym bag.",
                "4. Hip position": "How high should your hips be in the starting position of a deadlift? Should you begin in more of a “squat” position, or something more along the lines of a stiff-legged deadlift? The answer can be deduced from three instructions: 1. Keep your arms vertical as seen from the side (or very close to vertical) during the entire lift. This is easy: once the bar gets heavy enough, it’ll be positioned right below your shoulder joint, or at least very close to it. 2. Keep the systems (your body + the bar = the system) center of mass roughly above your mid foot. How do you find this position? It’s the position in which you don’t lose your balance forward or backward during the pull – e.g. where you’ll automatically end up positioning the bar to keep your balance, without thinking about it. You can explore and reinforce this position by performing a pause deadlift, with the pause very low towards the floor. 3. Keep your shins as close to the bar as possible while still allowing for number 1 and 2 above, as that will enable you to more effectively use both your knee and hip extensors. For many people, this means having your shins touching the bar. These three points will have narrowed down your possible hip starting height quite a lot, but there is still some leeway regarding the exact height. The final adjustments of your hip position will depend on your personal strengths and weaknesses, especially in your back, hip and knee extensors. If you have a strong back and strong hip extensors but weak knee extensors, you’ll be the strongest (and naturally drift towards) when you are a little bit more bent over and thus shifting more of the load towards your hip. If you have strong knee extensors but a weaker back or weak hip extensors, you’ll be the strongest (and naturally drift towards) when you have a more vertical torso and your shins/knees closer to the bar (or even past the bar, for taller lifters). Note that your ideal starting position probably is one that you already know and use. When we perform movements, we usually experience a bit of micro-variation. The movement simply doesn’t look exactly the same each rep, and if we by chance discover a slightly easier and more efficient way of performing a rep, we usually take notice – either consciously or subconsciously. That is why, as long as you’re not doing something fundamentally wrong – like keeping the bar way ahead of your shins – your current starting position is probably also your most effective one. At least right now. As your body and musculature changes with continued training, so will your strengths and weaknesses change. That means that the most effective deadlift position in the beginning of your lifting career, might not be the same as your most effective lifting position when you are on your peak. Do experiment with a slightly higher or lower hip position in the start – although my bet is that you’ll find that you’re either weaker with the new position, or will end up in your old position anyway when the load gets heavy enough.",
                "5. Back position & Bracing":"In general, you should deadlift with a neutral spine. Generally avoid lifting with a flexed back in your training, as it could increase your risk of injury – if you cannot maintain a neutral spine, lower the weight or perform less reps per set. To maintain a neutral spine, you can implement bracing, which refers to the act of keeping your core rigid during a lift. Start by taking a deep breath just before lifting, about 80% of maximum. Then, it’s time to tense up your core muscles. Effective deadlifting requires efficient force transfer. The force must be transferred from the bar, via your grip, arms and shoulders, through your torso down to your hips, and finally down via your legs and feet to the floor. A key to effective force transfer is stiffness, and this ties in with the previous section on bracing. Arms and legs won't heavily help here.  The core however, with it’s pelvis connected to the spine  is in great need of stabilization – especially in the conventional deadlift since it places greater demands on your low back. A braced and stiff core will be essential for effective force transfer. Before you push the pedal to the metal and revv up those strong prime movers in your back, hip and knee extensors, you’d better take a moment to make sure your core is good to go, and this is done by building tension. It is simply the act of consciously tensing your body to prepare it for what is about to come.",
                "6. Lift-Off":"The lift-off is really about nailing down two things: 1. Knowing your strongest pulling technique, and 2. Using and maintaining that technique. Your own strongest pulling technique will entail things like: how you distribute work between hip and knee extensors, what sequence and speed you will extend different joints in, and whether or not you are going to pull with a rounded or straight back. The deadlift is more segmented into three distinct phases: 1. Mostly knee extension, 2. Mostly hip extension, 3. Simultaneous knee and hip extension until lock-out. Some generally  helpful cues for lift-off: Push the floor away. Instead of pulling the barbell up, you focus on pushing the floor away, or down. Chest up, this is one of the best ways to help a lifter maintain a more straight back.",
                "7. Lock-Down":"Assuming you are strong enough to complete the lift, the lock-out part of a deadlift is  pretty simple. All you have to do is: extend your knees, hips and back, and keep your shoulder back for the lift to be considered completed. Simply drive your hips forward, kind of like a hip thrust. If you’re having troubles extending your spine in the top or having “soft knees” (not fully extended), a helpful visualization might be to imagine a chain attached to the top of your head, pulling you upwards.",
                "8. Setting the Bar Down":"How to set the bar down safely. acktrack your steps from the pull, even though we compress it slightly into two distinct phases: 1. Hip hinge. Initiate the eccentric by pushing your butt back and leaning your torso forward. The knees bend, but not as fast as your hip. Lower the bar along your legs like this until you’ve cleared the knees. 2. Knee bend. When the bar has cleared your knees, you are probably leaning as far forward as you’re going to get. At this point you take out the rest of the movement with your knees, and simply bend them until the bar touches the ground."
            }
        },
        "tempo": "11X1: 1021, 1031, oe 1041: 1 second to lift the weight explosively, 1 second to pause at the top, and control the bar on the way down for X seconds (2-4 seconds depending on the weight and individual preference). Why? The explosive lifting phase (1 second) recruits the maximum number of muscle fibers and develops power. Controlling the weight on the way down (eccentric phase) helps maintain tension in the muscles, promotes hypertrophy, and reinforces good form. The brief pause at the top prevents loss of tension and ensures continuous muscle engagement. The variable tempo (X) on the eccentric phase allows for individual adjustment based on experience level and training goals. Beginners may benefit from a slower descent (4 seconds) to focus on technique and control, while experienced lifters may use a faster tempo (2 seconds) to increase training volume and intensity.",
        "commonMistakes": {
            "Feet & Legs stance - Have  the stance is so wide that the knees push the elbows out":"This forces you to lean forward, thus bringing you closer to the floor, and into a biomechanically weaker position. Avoid this if possible. It may be, however, that your thighs and abdomen are too big for a narrow stance, and thus forcing you to adopt a stance similar to this.",
            "Arms - Bend the arms or grip the barbell excesively wide":"This will make you have to lean over more, and thus end up in a weaker starting position, making it harder to start the movement and increasing the injury risk."
        },
        "comments": {
            "Conventional or Sumo Deadlift?": "\n",
            "Discover your ideal Lift-Off position":"You will have to experiment to find out for yourself: Are you stronger when you let your butt shoot up in the start, or when your patiently push with your legs until the bar finally gives? Are you stronger when you deadlift with a straight back during the whole lift, or when you initally round your back but re-extend it during the lock-out? Your individual optimal deadlift technique will vary, but if we yet again shall revert to generalizations, we believe that most lifters will eventually have their greatest performances when they patiently let their quadriceps contribute to the lift, resulting in a pronounced knee extension in the start, as well as pulling with a more or less straight back through the first phase of the lift, thereby ridding themselves the task of re-extending their spine. So, how do you go about accomplishing this? Both depend on grooving the right neuromuscular motor patterns, which in plain English means train a lot. With the desired technique. With progressively heavier weights, as you get increasingly good at maintaining your technique with heavier weights. To train this, you will be needing some kind of feedback to discern whether you’re doing it right or wrong: A coach/friend/GymAlly who knows what to look for might give you feedback after a set or even after every rep.",
            "Strength advantage to controlled Eccentric":"Is there a strength advantage to setting the bar down slowly in your training (controlled Eccentric)? The tricky part of a deadlift is the way up – the concentric phase. That is what you compete with in powerlifting, and the way down (the eccentric phase) is mostly a formality, where the only rule is to lower the bar with control and maintaining your grip on it until it rests on the floor. However, for general training, it's good to know that several studies has compared the concentric strength gains from training protocols where you either perform concentric reps only or concentric+eccentric (that is, normal training) reps, and found that concentric+eccentric training yields greater concentric strength gains. This means that even if you perform twice as many reps where you set the bar down quickly (without really braking it’s fall), you’re still not getting as good gains as if you were to really slow down the bar, and lower it under, say, at least two seconds. Thus, a little bit more work and discomfort invested in your deadlift training in the shape of more prolonged eccentrics might pay good dividends.",
            "How to Become Stronger in the Deadlift?":"The weight you can lift in the deadlift is determined by the amount of force you can produce in your muscles (primarily the extensors of the hip, knee, and back) and transfer into the bar. To deadlift more weight, you must generate more force into the bar. There are three different domains in which you can improve in order to accomplish this: \n1. Muscle & tendon. A bigger muscle produces more force, and a stiffer tendon transfers that force into your bones more efficiently. Skeletal muscle mass is strongly correlated with deadlift performance. To build bigger muscles, you need to train them in any reasonable way. You can train them deadlifting, but also doing other exercises. E.g. If you build bigger and stronger glutes using hip thrusts, you will still have a bigger and stronger hip extensor when you go back to the deadlift. Tendons increase in stiffness from all heavy training. Improvements in neuromuscular efficiency and especially technique require more specificity, and you will actually have to practice the lift in which you want to improve. Preferrably at pretty heavy loads.",
            "Training Volume for the Deadlift":"The optimal training volume varies widely between individuals and is dependent on several factors, such as training status, age, nutrition (especially calories and protein ingestion), and recovery. The relationship between strength gains and training volume follows an inverted U-shape, where both too little and too much training leads to inferior gains. The key is to find the Optimal training volume. You’ll neither want to train too little nor too much for optimal gains. But if you have to choose, erring on the side of too little will at least spare you time and decrease your injury risk. Some general volume recommendations in terms of working sets of deadlifts. That is sets that are challenging but are generally not performed to failure but leaving 1–2 reps in the tank. \n1. Low volume, 3–5 sets per week: This is a suitable volume for the beginner lifter that is simultaneously getting used to squatting maybe 1–2 times a week and thus is acclimatizing to a lot of new stress. It might also be suitable for the intermediate lifter, either tapering or taking a minimalistic approach to deadlifting while perhaps focusing on hypertrophy work for the deadlifting musculature. \n2. Medium volume, 6–13 sets per week: The goldilocks zone, and probably a nice target volume for most people in the intermediate stage. Recovery demands will be quite low if this is the only training you do for the lower body, but if you add in squats and deadlift accessory training, the total volume will place quite high demands on your recovery. This might be a suitable volume for an advanced lifter who is tapering. \n3. High volume, 14–20 sets per week: For the intermediate lifter who is stuck on a plateau and wants his or her deadlift to ascend to the next level, or for the advanced lifter. Recovery demands are high, especially if this is coupled with squat training and accessory work. Most will have to gradually increase their volume to this level over a long time, and some lifters might find it too much for them, and that medium volume works better.",
            "Training for Muscles Used in the Deadlift":"For optimal deadlift gains, you will probably want to train the prime mover muscles more than you can do if you’d only use deadlifts, by doing assistance exercises. By varying your exercises, you can probably lower the risk of over-use injuries. Assistance exercises are usually for hypertrophy, in this case, exercises that strengthen and grow the muscles used in the lift. Major muscles worked in the deadlift: Knee extensors (Quadriceps), Hip extensors (Glutes, Hamstrings, Adductors), and Back extensors (Lower back). The options for hypertrophy exercises are many and more a matter of personal preference. However, here is a sample list of exercises that you might use to supplement your training for the muscles involved in the deadlift. If you are hitting squats and deadlifts hard, you might only want to pick 1–2 of the exercises below and do 2–3 sets x 1–2 workouts per week. If you deadlift with a low volume (relative to your training level), you can increase the volume of assistance exercises. Sample exercises: Squat (if you’re not already doing them) (knee, hip and back extensors), Bulgarian split squat (knee and hip extensors), Hip thrust (hip extensors), Kettlebell swing (hip and back extensors), Hyperextension (hip and back extensors), Good morning (hip and back extensors), Romanian deadlift (hip and back extensors), Barbell row (upper back and isometric training for back and hip extensors), Farmers walk (core, grip, trapezius, and stability training for hips)",
            "Training Frequency for the Deadlift":"Training frequency might be an important mediator for training volume. Do you want to train a lot? Well, sooner or later you’ll have to distribute the training on more days, before your current workouts swell beyond the scope of what is productive to do in one session. A rough limit on the number of work sets of deadlifts in a single session might be somewhere in the neighbourhood of 8-10 sets for an experienced lifter. About 1–2 deadlift sessions per week is not a bad starting point for someone who also trains squats or similar lower-body movements. Most lifters can probably do one hard deadlift session per week, while two sessions per week might require most lifters to dial down the intensity a bit. A classic recommendations for adapting to a larger workload that you might use for the deadlift is this: \n1. First increase the frequency. Go from one deadlift session to two, more or less by splitting your current training volume in two. \n 2. Then increase the volume. Slowly ramp up the volume by adding easy sets, so that you are well on the safe side of doing too much, too soon. \n 3. Finally increase the intensity (load). When you are accustomed to two deadlift sessions per week, you might start to increase the intensity of load you’re using.",
            "Load & Reps for the Deadlift":"Your strength can improve from training with both high and low loads, but when you compare them head to head, lifting heavy weights is slightly more effective if you want to get better at lifting heavy weights. There are several rep and loading strategies that work, as long as you heed the principle of specificity (i.e. lifting heavy every once in a while) and progressive overload (e.g. adding weight or reps). One basic template you could try is to Slug away at 75-80% of 1RM. That range is heavy enough to be specific training for max attempts, but not so heavy that it burns you out. It’s typically possible to accumulate a large, effective volume at this intensity. Something like 6-14 sets x 2–3 reps weekly might be appropriate for an intermediate level practitioner, divided in 1-2 sessions, and with an expected increase of 2.5kg per workout."
        },
        "alternativesAndVariations": {
            "Hypertrophy: Exercises that will strengthen and grow the muscles used in the lift.": "The primary movers in the deadlift are the knee extensors (quadriceps), hip extensors (glutes, hamstrings, adductors), and back extensors (mostly your lower back), so that is the muscles you should be most concerned about strengthening and growing. The options for hypertrophy exercises are many, and more a matter of personal preference than anything else. We will now share some exercises that you might use to supplement your training for the muscles involved in the squat. If you are not sure, we recommend to pick squats + 1–2 of the exercises below, and do 2–3 sets at 1–2 workouts per week. If you squat with a low volume (relative to your training level), you can increase the volume of supplementary exercises: 1. Squat (knee, hip and back extensors), 2. Bulgarian split squat (knee and hip extensors), 3. Hip thrust (hip extensors), 4. Kettlebell swing (hip and back extensors), 5. Hyperextension (hip and back extensors), 6. Good morning (hip and back extensors), 7. Romanian deadlift (hip and back extensors), 8. Barbell row (upper back and isometric training for back and hip extensors), 9. Farmers walk (core, grip, trapezius, and stability training for hips)",
            "Technique: Exercises that strengthen the movement, or improve the performance or technique of the lift.":"These are generally more taxing than the hypertrophy exercises listed earlier, and also cut in more into your other deadlift volume. Working sets of the exercises listed below should probably be traded in for your regular sets of deadlift if you’re already training at a high volume, rather than piled on top of it. \n1. Pause deadlifts. Can be used to improve overall technique and strength around the position that you pause in. We generally recommend pausing as close to the floor as possible (just 3-5cm or so above), and for a count of three. \n2. Deficit deadlifts. Can be used to challenge and strengthen the start in the deadlift, and also might bring about more training for your legs. Do these by standing on a weight plate or some sturdy block, around 1–4 inches high, so that you’ll have to reach down further to grab and lift the bar. \n3. Rack pulls. Useful for getting used to heavier weights in your hands, and overloading the later part of a deadlift. Choose rack height at your own discretion, but a common height is to begin with the bar just below your knees. \n4. Trap bar deadlifts. Distributes the work more evenly between hip and knee extensors, and unloads the back a bit. Can be useful for more balanced development of the lower body, and is a back-friendly substitute."
        }
    }
}