{"incline_dumbbell_press": {"form": {"Steps": "\n1. Adjust the incline of a bench to be around 30-45 degrees. \n2. Sit down and lift a pair of dumbbells to the starting position. \n3. Press the dumbbells up to straight arms while exhaling. \n4. Inhale at the top or while lowering the dumbbells with control back to your shoulders.", "Form": {"Bench Angle": "There is no exact rule, but most like it around 30-45 degrees. If you have it too upright, it will be more like a shoulder press. If you have it almost flat, it will feel like a regular dumbbell chest press. You can also adjust the angle depending on where you want to add the most load: If you want more load on your shoulders, the bench should be more upright.", "Positioning": "Make sure to retract your shoulder blades so that you’ll have your entire upper body stabilized. Place your feet comfortably on the floor, and keep your entire foot on the floor during the entire movement.", "Movement": "Start with the dumbbells straight above your shoulders, and lower them with control. Go as far down as possible, until the dumbbells are in line with your upper chest, and press them back up with a controlled movement."}}, "tempo": "2011", "commonMistakes": {"1. Insufficient range of motion": "It’s easy to get greedy and pick a weight that’s too heavy and therefore start to cheat on the range of motion. Lower the dumbbells until the dumbbells are in line with your upper chest, and fully extend your arms during the press to maximize the chest engagement.", "2. Not keeping your wrist straight": "By not keeping your wrists straight, you’ll place unnecessary load on your wrist joints and also lose some stability in the movement."}, "comments": {"Introduction": "The incline dumbbell press is a mixture of the dumbbell chest press and the shoulder press, and both the front deltoids and the upper portions of the chest muscles are worked in this exercise. Thanks to the inclination of the bench, many experience this exercise as easy on their shoulders and that they can get a nice, long range of motion.", "Benefits": "- Great for building muscle and strength: The incline dumbbell press works your chest and front delts through a long range of motion and in a stable position. That is a great recipe for muscle growth! Also, your triceps get some work as secondary movers. - Builds your upper chest: The incline dumbbell press works your upper chest muscles more than flat pressing exercises do. Adding incline presses to your program is therefore an effective way to develop your entire pecs. - Prevent muscle imbalance: Since you’re using dumbbells, the incline dumbbell press can be used to find and fix muscle imbalances from side to side. Let your weaker side set the pace, and it will soon catch up to your strong side. - Easy on the shoulders: Many find that incline pressing is easier on the shoulders than, for example, flat dumbbell pressing or bench pressing is.", "Dumbbells vs. Barbell": "There are three main differences between using dumbbells compared to a barbell (like in the incline bench press): - Dumbbells allow for a personalized range of motion: With barbells, you are fixed into one bar path which may or may not suit your anatomy. With dumbbells, you get another degree of freedom, which makes it easier for you to find a range of motion that suits you. If incline bench pressing feels awkward on your shoulders, try switching the barbell out for dumbbells. - Barbells are more stable: Depending on your goal, this can be a pro or a con. Greater stability usually means that you are able to tire out your muscles further before your balance becomes an issue, which is good for building muscle. On the other hand, dumbbells might be stable enough for muscle growth. Additionally, because of their greater instability, you will train shoulder stability and coordination to a greater degree, including working your rotator cuffs more. - Finding and fixing muscle imbalances:  The dumbbells will make it easier for you to find and address any side-to-side differences in strength."}, "alternativesAndVariations": {"Similar exercises": "\n1. Incline bench press. \n2. Smith machine incline bench press."}}}
