{
"dumbbell_lateral_raise": {
"form": {
"Steps": "\n1. Stand with your feet shoulder-width apart, holding a dumbbell in each hand. \n2. Keep your elbows slightly bent and raise the dumbbells out to the sides until your upper arms are parallel to the ground, or slightly higher if comfortable. \n3. Lower the dumbbells back down to your sides with control. \n4. Repeat for reps.",
"Form": {
"1. Spine and Core": "Maintain a neutral spine throughout the exercise. Avoid arching your back. Engage your core muscles to stabilize your body.",
"2. Shoulders and Elbows": "Keep your shoulders down and back, avoiding shrugging them up towards your ears. Maintain a slight bend in your elbows throughout the movement to prevent excess strain on the joints. Avoid fully extending your arms and locking the elbows.",
"3. Movement": "Raise the dumbbells in a smooth and controlled motion, without using momentum. Focus on using your shoulder muscles to lift and lower the weights. Avoid swinging the weights up using body momentum. Pause briefly at the top of the movement when your arms are parallel to the ground. Lower the weights back down to your sides in a controlled manner, without dropping them."
}
},
"tempo": "2110",
"commonMistakes": {
"1. Lifting too heavy": "Picking a weight that is too heavy can result in poor form and increase the risk of injury. Start with lighter weights and gradually increase as your strength and technique improve.",
"2. Swinging the weights": "Using body momentum to lift the dumbbells compromises muscle engagement and increases the risk of injury. Focus on maintaining control and using your shoulder muscles to raise and lower the weights.",
"3. Locking the elbows": "Fully extending your arms and locking the elbows can place excessive strain on the joints. Maintain a slight bend in the elbows throughout the movement."
},
"comments": {
"General": "The dumbbell lateral raise is an isolation exercise that primarily targets the lateral deltoid muscles. This exercise is popular for its ability to sculpt and strengthen the shoulder muscles. It is easy to perform, as the only equipment you need is a pair of dumbbells. This is an exercise where it is easy to pick a weight that is too heavy. Rather err on the lighter side, and strive for a strict form where you focus on getting a good contact with your delts.",
"Benefits": "- Boulder shoulders. This exercise primarily targets the lateral deltoid muscles, which gives you that roundness of the shoulders that many lifters are striving for. - Enhanced athletic performance. Many sports and physical activities require strong and stable shoulders. Incorporating the dumbbell lateral raise into your training program can improve your performance in sports such as swimming, tennis, baseball, and volleyball. - Easy to perform. The dumbbell lateral raise requires minimal equipment, making it an ideal exercise to perform at home or in the gym. All you need is a pair of dumbbells, and then you’re good to go.",
"Sets and Reps": "The number of reps that you should train varies depending on your goals, this goes for all exercises. For muscle growth, around 6–15 reps per set are something to aim for. For strength, around 3–8 reps per set are good. There are no clear-cut lines between these two goals, however. Training in the “muscle growth range” will still increase your strength, and training in the “strength range” will still cause your muscles to grow. It’s just a matter of what you are emphasizing. But specifically, the dumbbell lateral raise is not typically used as a primary strength-building exercise for the shoulders. Our recommendation is to perform bigger compound exercises, like the overhead press, for that purpose. The lateral raise is an isolation exercise that lends itself better to moderate rep ranges and lighter weights with a controlled movement in this case. Regarding how many sets you should do, that depends more on your training background and your capabilities. How much shoulder work are you used to doing, and how much does it take for you to stimulate growth? It also depends on how many workouts you do per week. You can tolerate (and grow from) a higher training volume if you distribute it over more workouts."
},
"alternativesAndVariations": {
"1. Machine Lateral Raise": "Machine lateral raises offer a fixed path of motion, which can help to maintain a proper form, especially for beginners. On the other hand, the dumbbell lateral offers a bigger versatility, while the predetermined movement pattern in the machine might not align with the natural range of motion in just your case. Both exercises target the lateral deltoids, and you don’t need them both at once. Which one to choose depends on your personal preference, experience level, and available equipment.",
"2. Cable Lateral Raises": "The cable lateral raises offer constant tension throughout the movement, which can lead to greater muscle activation. Depending on the pulley’s height setting, it can also offer a different resistance curve compared to dumbbells. However, some lifters might feel the same as in the machine lateral raise, that the movement pattern is a bit difficult to adapt to compared to the dumbbells. The same goes for the cable lateral raises as written above – you don’t need them both at once. Which one to choose depends on your personal preference, experience level, and available equipment."
}
}
}
