{
"dumbbell-frog-pumps": {
"form": {
"steps": "\n1. Lie on your back with your knees bent and the soles of your feet together, bringing your heels as close to your butt as possible (frog position). Place a dumbbell horizontally across your hips, just above your pubic bone. \n2. Engage your core, and press your lower back and shoulders firmly into the floor. \n3. Drive your heels into the floor and squeeze your glutes to thrust your hips upwards, maintaining the \"frog legs\" position. \n4. Pause at the top of the movement for a brief moment, feeling the contraction in your glutes. \n5. Slowly lower your hips back down to the starting position, maintaining control and tension in your glutes.",
"form": {
"Feet": "Keep the soles of your feet together throughout the exercise, maintaining the \"frog legs\" position.",
"Hips": "Drive your hips upwards in a controlled motion, squeezing your glutes at the top.",
"Core": "Engage your core throughout the exercise to stabilize your body and protect your lower back.",
"Shoulders and Back": "Keep your shoulders and upper back flat on the floor throughout the exercise.",
"Head": "Maintain a neutral head position, looking straight up at the ceiling."
}
},
"commonMistakes": {
"Arching Lower Back": "Avoid arching your lower back during the exercise. Keep your core engaged and your lower back pressed into the floor.",
"Limited Range of Motion": "Perform the exercise with a full range of motion, lowering your hips until you feel a stretch in your glutes and hamstrings.",
"Using Back Muscles": "Focus on using your glutes to drive the movement, rather than your back muscles. Squeeze your glutes at the top of the movement.",
"Fast Tempo": "Avoid using momentum or a fast tempo. Perform the exercise slowly and controlled, focusing on the mind-muscle connection with your glutes."
},
"comments": {
"Glute Activation": "Dumbbell frog pumps are a great exercise for activating and strengthening the glutes, particularly the gluteus maximus.",
"Home Workout Friendly": "This exercise can be easily performed at home with minimal equipment (just a dumbbell).",
"Warm-up Exercise": "Dumbbell frog pumps can be incorporated into your warm-up routine to activate your glutes and prepare them for heavier compound exercises.",
"Variations": "You can adjust the difficulty of the exercise by changing the weight of the dumbbell or by performing the exercise with one leg at a time.",
"Eye Contact": "It's entirely up to you whether you want to make or avoid eye contact with other people while doing frog pumps."
},
"alternativesAndVariations": {
"Glute Bridge": "A similar exercise that targets the glutes and hamstrings. The main difference is that the glute bridge is performed with your feet hip-width apart, while the frog pump is performed with your feet in a frog position.",
"Hip Thrust": "A more challenging exercise that targets the glutes, hamstrings, and quads. The hip thrust is typically performed with a barbell, but it can also be performed with dumbbells or a resistance band.",
"Donkey Kick": "An isolation exercise that targets the glutes, particularly the gluteus maximus. Donkey kicks can be performed with or without weights.",
"Barbell Hip Thrust": "A compound exercise that primarily targets the glutes, but also engages the hamstrings, quads, and core. It's considered a more advanced variation of the hip thrust."
},
"tempo": "2021 (2 seconds lifting, 0 seconds pause at the top, 2 seconds lowering, 1 second pause at the bottom)"
}
}
