{
    "dumbbell-curl": {
        "form": {
            "Steps": "\n1. Hold a pair of dumbbells in an underhand (supinated) grip, arms hanging by your sides.\n2. Lift the dumbbells with control, by flexing your elbows.\n3. Don’t let your upper arms travel back during the curl. Keep them at your sides, or move them slightly forward.\n4. Reverse the movement and lower the dumbbells back to the starting position.",
            "Form": {
                "1. Stance": "Stand with your feet shoulder-width apart, maintaining a slight bend in your knees.",
                "2. Grip": "Hold the dumbbells with an underhand grip (palms facing forward).",
                "3. Elbows": "Keep your elbows close to your body throughout the exercise.",
                "4. Posture": "Stand with your chest up and shoulders slightly retracted and depressed.",
                "5. Core": "Remember to keep a light tension in your core during the entire movement."
            }
        },
        "tempo": "2110: 2 seconds eccentric, 1 second concentric, 1 second pause at the top, and 0 seconds at the bottom. Why? A 2-second eccentric emphasizes the stretch and promotes muscle growth, while a 1-second concentric ensures a controlled lift. The brief pauses at the top and bottom maintain tension and prevent momentum.",
        "commonMistakes": {
            "1. Elbow positioning": "If your elbows move forward while you’re lifting the weight, it will put an additional load on your front delts, instead of focusing on your biceps. If your elbows move backward, you’ll also move the load from your biceps and be able to “cheat up” the weight.",
            "2. Using too heavy weights": "By adding more weight than you can lift, you might start to swing your body and use momentum to get the weight up. Another sign of using too much weight is if you’re not using the full range of motion and start doing half reps instead.",
            "3. Not locking your wrists": "Keep your wrists straight during the movement. If they’re bent, it can put an unnecessary load on them and lead to discomfort and maybe even injuries."
        },
        "comments": {
            "Popularity": "The Dumbbell Curl is a classic and effective exercise that targets the biceps. This exercise is renowned for its simplicity, all you need is a pair of dumbbells (of the same weight) and you’re ready to start pumping those biceps. Whether you’re looking to improve your arm strength, increase muscle mass, or simply tone your upper body, the Dumbbell Curl is an excellent choice.",
            "Benefits": "1. Stronger and bigger arms. Dumbbell curls primarily target the biceps brachii and brachialis muscles, which results in increased strength and size of the upper arms. \n2. Unilateral Training. Because you can perform curls with one arm at a time, dumbbell curls can help identify and correct muscular imbalances between your arms.\n3. Grip strength. Dumbbell curls can significantly enhance your grip strength, which can be beneficial for improving performance in other exercises and also in your daily life.\n4. Functional. Ironically enough, bicep curls are actually very functional, as they are one of the most common movements we do with our arms in our daily life.",
            "How many reps": "How many reps you should do of an exercise depends on your goal: do you mainly want to increase your strength or build muscle? Generally, a lower rep range of about 1–5 reps per set is most effective for strength gains. However, the dumbbell curl might not be the best option if you want to work in this rep range. Not only because of the instability of doing a unilateral exercise but also because it’s easy to start cheating when it gets too heavy. For muscle gains, a slightly higher rep range of about 8–15 reps per set is generally the most effective and practical. You can cycle in periods of working in this rep range, even if your goal is to get as strong as possible. Of course, you will see an increase in both muscle and strength regardless of which rep range you choose, but you can emphasize one or the other slightly by working in the right number of reps."
        },
        "alternativesAndVariations": {
            "1. Hammer Curl": "By switching from a supinated to a neutral grip in the dumbbell curl, it becomes a hammer curl instead. It is almost the same as the dumbbell curl, but it targets the muscles brachialis and brachioradialis a bit more.",
            "2. Barbell Curl": "Barbell curls often allow for heavier weights to be lifted, but they offer less range of motion and flexibility in your wrists. It could be easier for the beginner as it is a bit more stable than working unilateral (with one arm at a time).",
            "3. Machine Bicep Curl": "The machine curl provides more stability than the dumbbell curl, as it keeps you in a fixed path of motion. This might be beneficial, especially for beginners, or if you want to be able to focus on your biceps without any distractions like balance and stabilization. However, the machines typically have less versatility, with most offering a fixed grip width and position that might not fit everyone.",
            "4. Preacher Curl": "If you have difficulties getting good muscle contact in the barbell or dumbbell curl, the preacher curl might be a good alternative. By resting your upper arms on the sloping pad of the preacher bench, you get more stabilization, and it eliminates the possibility of moving your elbows and creating excessive momentum.",
            "5. Bodyweight Curl": "The bodyweight curl is a good alternative for training biceps if you don’t have access to any external weight. All you need is a TRX or something similar to hang on to, and then use your own body weight and gravity as resistance."
        }
    }
}