{"face_pull": {"form": {"Steps": "\n1. Fasten a rope handle in a high position on a cable pulley. Grip the ropes with an overhand grip, and take a step or two back. \n2. With elbows held high, pull the rope towards you by letting your upper arms move straight out towards your sides while simultaneously rotating your forearms up. \n3. Return with control to the starting position by letting your arms move forward again.", "Form": {"Positioning": "Stand up straight, a couple of steps back from the machine. Some lifters prefer to keep one foot in front of the other, while some prefer to stand with the feet in line, hip-width apart. Keep tension in your glutes and your core active so that you keep your entire body still and stable during the movement.", "Movement": "Pull the rope against you, aiming for the height of your forehead. Keep your elbows high, and rotate your forearms up. Keep the movement slow and controlled."}}, "tempo": "2011: 2 seconds eccentric phase (returning to starting position), 0 seconds pause at the bottom, 1 second concentric phase (pulling the rope), 1 second pause at the top. Why? The face pull is an exercise that targets smaller muscles, so a controlled tempo is crucial for proper form and muscle activation. The 2-second eccentric emphasizes the stretch and helps maintain tension in the rear delts and rotator cuff. The brief pauses at the top and bottom reinforce good form and prevent momentum from taking over.", "commonMistakes": "\n1. Adding too much weight. The face pull is an exercise where it’s easy to start taking shortcuts by involving muscles other than the targeted ones, or by using excessive momentum. \n2. Not keeping position. By keeping your elbows below shoulder height, not lifting up your forearms, and pulling more towards your chest instead of your head, the exercise will become easier, but it will also target the wrong muscles. Be mindful of your form so that your face pulls won’t end up being high rows instead.", "comments": {"Good shoulder health": "The face pull helps strengthen and stabilize the muscles around the shoulder joint, which can benefit lifters who frequently engage in overhead movements like weightlifting, etc.", "Helps with building a balanced upper body": "By adding face pulls to your workout routine, you can help to build a bigger and stronger back, which is needed if you also do a lot of press work, to balance it out."}, "alternativesAndVariations": {"Alternatives": "\n1. Dumbbell Rear Delt Row: Good alternative if you don’t have access to a cable machine. \n2. Barbell Rear Delt Row: Another exercise for your rear delts that involves rowing a barbell high up on your chest. Like in the dumbbell rear delt row, aim to move your upper arms out towards your sides. \n3. Cable Rear Delt Row: Similar to the face pull, with the main difference being that you don’t rotate your forearms up. This turns the exercise into more of a rear delt row, that will challenge your trapezius more than the face pull."}}}
