{
"frog-pumps": {
"form": {
"steps": "\n1. Lie on your back with your knees bent and the soles of your feet together, bringing your heels as close to your butt as possible, into a frog-like position. \n2. Engage your core, and press your lower back and shoulders firmly into the floor. \n3. Drive through your heels and squeeze your glutes to thrust your hips upwards, maintaining the \"frog legs\" position. \n4. Pause at the top of the movement, feeling the contraction in your glutes. \n5. Slowly lower your hips back down to the starting position, maintaining control and tension in your glutes.",
"form": {
"Feet": "Keep the soles of your feet together throughout the exercise, like a frog.",
"Hips": "Drive your hips upwards using your glutes, not your lower back.",
"Core": "Keep your core engaged throughout the exercise to protect your lower back and maintain stability.",
"Shoulders and Upper Back": "Keep your shoulders and upper back flat on the floor throughout the exercise."
}
},
"commonMistakes": {
"Arching Lower Back": "This can put stress on your spine. Ensure to keep your core engaged and your lower back flat on the floor.",
"Limited Range of Motion": "Not going through the full range of motion will limit glute activation. Focus on squeezing your glutes at the top of the movement.",
"Using Momentum": "Using momentum instead of muscle strength reduces the effectiveness of the exercise. Perform the movement slowly and with control."
},
"comments": {
"Glute Activation": "The frog pump is an excellent exercise for isolating and activating the glute muscles.",
"Warm-up": "It can be used as a warm-up exercise for compound movements like squats and deadlifts.",
"Home Workouts": "This exercise requires no equipment, making it ideal for home workouts.",
"Variations": "You can increase the difficulty by adding a resistance band around your thighs or holding a weight on your hips."
},
"alternativesAndVariations": {
"Glute Bridge": "A similar exercise that targets the glutes and hamstrings, but with feet placed hip-width apart on the floor.",
"Hip Thrust": "A more challenging exercise that targets the glutes, performed with your upper back supported on a bench.",
"Donkey Kicks": "An exercise that isolates the glutes, performed on all fours by extending one leg back and up towards the ceiling.",
"Hip Abduction": "An exercise that targets the gluteus medius (side of the glutes), performed by raising one leg out to the side."
},
"tempo": "2020 (2 seconds lifting, 0 seconds pause at the top, 2 seconds lowering, 0 seconds pause at the bottom)"
}
}
