{
    "hammer-curl": {
        "form": {
            "Steps": "\n1. Stand with your feet about hip-width apart and make sure that you’re standing in a stable position. Keep a good posture, and brace your core during the entire movement to avoid your body to start swinging back and forward. \n2. Hold a pair of dumbbells in a neutral grip (palms facing each other), arms hanging by your sides. \n3. Lift the dumbbells with control by flexing your elbows. \n4. Don’t let your upper arms travel back during the curl. Keep them at your sides, or move them slightly forward. \n5. Reverse the movement and lower the dumbbells back to the starting position.",
            "Form": {
                "Elbow positioning": "If your elbows move forward while you’re lifting the weight, it will put an additional load on your front delts, instead of focusing on your biceps. If your elbows move backward, you’ll also move the load from your biceps and be able to “cheat up” the weight.",
                "Grip": "Hold the dumbbells with a firm grip, with your palms facing your thighs (neutral grip). Avoid twisting the wrists or changing your grip during the curl.",
                "Movement": "Curl up the dumbbells, and make sure that you keep your elbows close to your body the entire time. Your body shouldn’t move, just the arms. If you start to swing to move the weights with help from the momentum of the body, you should probably remove some weight instead and focus on performing the movement with control."
            }
        },
        "tempo": "2011",
        "commonMistakes": {
            "1. Elbow positioning": "If your elbows move forward while you’re lifting the weight, it will put an additional load on your front delts, instead of focusing on your biceps. If your elbows move backward, you’ll also move the load from your biceps and be able to “cheat up” the weight.",
            "2. Using too heavy weights": "By adding more weight than you can lift, you might start to swing your body and use its momentum to get the weight up. Another sign of using too much weight is if you’re not using the full range of motion and start doing half reps instead.",
            "3. Changing grip": "Keep your grip neutral during the movement. It’s easy to start twisting the wrists during the lift, without thinking about it. Avoid this to maintain the correct form and maximize the benefit to the intended muscles."
        },
        "comments": {
            "Stronger and bigger arms.": "Hammer curls emphasize the brachialis and the brachioradialis more than regular curls, which primarily target the biceps brachii muscle. Therefore, including the hammer curl into your routine is a good idea if you want those big guns.",
            "Accessible.": "All you need to perform the exercise is a pair of dumbbells, which are available at most gyms. This makes the exercise very accessible.",
            "Variety in training": "Incorporating different exercises into your workout routine can stimulate muscles in different ways, and can make your training more fun. Hammer curls can offer a nice variation from standard curls.",
            "Functional.": "Ironically enough, most bicep curls are actually very functional, as they are one of the most common movements we do with our arms in our daily life."
        },
        "alternativesAndVariations": {
            "1. Dumbbell Curl": "In a standard dumbbell curl, you have a supinated grip as you curl the weight. This grip places a greater emphasis on the biceps brachii. With hammer curls, your palms face towards each other in a neutral grip. This grip targets more of the brachialis and brachioradialis. They are both good for developing big biceps, and you might benefit from incorporating both into your workout routine.",
            "2. Cable Curl with Rope": "The cable curl with rope is similar to the hammer curl, but with the difference that the cable machine provides constant tension, which can lead to a longer time under tension than the hammer curl. By pulling the rope apart at the top of the movement, you can also make the movement a bit longer than the regular hammer curl.",
            "3. Bodyweight curl": "The bodyweight curl is a good alternative for working your biceps if you don’t have access to any external weight. All you need is a TRX or something similar to hang on to, and then use your own body weight and gravity as resistance."
        }
    }
}