{
"lat_pulldown_with_pronated_grip": {
"form": {
"Steps": "\n1. Begin by adjusting the thigh pad to fit snugly against your thighs to prevent your body from lifting off the seat. \n2. Grasp the bar with an overhand (pronated) grip, with your hands slightly wider than shoulder-width apart. \n3. Sit with your thighs under the thigh pad, keep your chest up, and look at the bar. \n4. Pull the bar down towards your chest, leading with your elbows. Pull until the bar is below your chin or touches your upper chest. \n5. Squeeze your shoulder blades together at the bottom of the movement. \n6. Exhale and slowly release the bar back up to the starting position.",
"Form": {
"Grip": "Find a grip that is comfortable for you, and that enables you to get good contact with the muscles you want to work. Most studies find that both wide (up to two times shoulder-width) and close grip lat pulldowns (one times shoulder-width or V-handle) lead to similar muscle activation, with a only a small tendency of higher lat activation in the wide grip lat pulldown.",
"Shoulders": "Squeezing the shoulder blades together at the bottom of the movement helps to engage your back muscles and will maximize the benefits of the exercise. A common cue is that you should try to put your shoulder blades in your back pockets.",
"Eccentric phase": "With control, let the bar travel up again. Don’t just let it fly up without resistance; keep tension in your muscles and let it slowly move up. Return the bar all the way up until your arms are straightened again."
}
},
"tempo": "3110",
"commonMistakes": {
"1. Using too much weight": "Choose a weight that allows you to perform the exercise with proper form, so start light and master the technique, and build from there.",
"2. Using the biceps to pull the weight down": "Focus on using your back muscles. One trick to get a better contact with your back muscles is to “pull with your elbows”, and just think of your hands and forearms as hooks on the handle.",
"3. Relying on momentum": "When you use momentum to pull the weight down, you remove the work from the lats and other muscles of the back. If you want to train your back muscles effectively, use a slow and controlled movement, focusing on squeezing your working muscles.",
"4. Failing to squeeze the shoulder blades": "Squeezing the shoulder blades together at the bottom of the movement helps to engage your back muscles and will maximize the benefits of the exercise.",
"5. Not using a full range of motion": "Failing to fully extend the arms at the top of the movement or failing to fully contract the back muscles at the bottom of the movement can reduce the effectiveness of the exercise, as full range of motion training generally leads to better strength and muscle gains."
},
"comments": {
"1. Pronated vs Supinated grip": "In general, it doesn’t seem to make much of a difference in muscle activation whether you use an overhand grip (pronated) or underhand grip (supinated) in the lat pulldown. This is in line with studies on pull-ups vs chin-ups, which also doesn’t find any meaningful differences in muscle activity. But that is in general. If you, as an individual, prefer or feel that you can target a muscle more effectively with one type of grip, then go with that one no matter what the studies say. When it comes to exercise technique, the devil is in the details and small changes can have big effects.",
"2. Lat Pulldowns in Front or Behind Your Neck?": "Most people are better off doing their lat pulldowns in front of the neck, for three reasons: \n1. Front lat pulldowns seem to activate the latissimus dorsi slightly more than behind-the-neck lat pulldowns. \n2. Doing lat pulldowns in front of your neck eliminates the risk of you slamming the lat bar into the vertebrates of your neck. \n3. The range of motion in front-of-the-neck lat pulldowns is slightly longer, with more elbow flexion and more shoulder extension. A final point is the issue of mobility: some people might lack the mobility around their shoulder joint to do the behind-the-neck lat pulldown. On one hand, this would make that exercise challenging, but on the other hand, by trying to do lat pulldowns behind the neck and slowly increasing the range of motion, one could probably improve one’s shoulder mobility quickly.",
"3. Lat Pulldowns or Pull-ups?": "If you cannot yet do pull-ups, the lat pulldown is a great exercise for building the necessary strength in your back and arm muscles. If you can do both, then it becomes a matter of what your fitness goal is. If your goal is to get really good at pull-ups, then you should mostly do pull-ups because of the specificity principle. If your goal is functional strength and improved control of your body, then pull-ups are still a great choice. If you goal is muscle growth, then suddenly lat pulldowns rise in relevance because of the increased stability and the control you have over the load. Regarding muscle activity, the pull-up and the lat pulldown activate your latissimus dorsi muscle similarly, but the pull-up activates your biceps slightly more.",
"4. Lat Pulldowns or Rows?": "Deciding whether to do lat pulldowns or rows largely depends on your personal fitness goals and the type of workout you are looking for. Both exercises target muscles in your upper back, but not exactly the same ones, and the exercises also differ in the equipment required. Lat pulldowns primarily target your lats and works them very effectively in a long range of motion. In addition, lat pulldowns work the lower portion of your trapezius muscle. Rows, such as barbell rows or cable rows, also work your lats but from a different angle, which utilizes slightly different portions of the muscle. Additionally, rows target more of your mid and upper trapezius. Both exercises work your rear delts, biceps, and grip strength. Whether you should do lat pulldowns or rows depends on which muscles you want to work. The best choice, however, is to do both, as they cover slightly different muscles. Throw in a third exercise for your lower back (like deadlifts or Romanian deadlifts), and you have a complete back workout put together."
},
"alternativesAndVariations": {
"1. Pull-ups": "Pull-ups are a great alternative to lat pulldowns, especially if you are looking for a more functional exercise that challenges your entire body. Pull-ups require more core strength and stability than lat pulldowns, and they also work your biceps more effectively.",
"2. Chin-ups": "Chin-ups are another great alternative to lat pulldowns. Chin-ups are similar to pull-ups, but they are performed with an underhand grip. This grip places more emphasis on your biceps, making chin-ups a good choice if you want to build bigger arms.",
"3. Barbell Rows": "Barbell rows are a great compound exercise that works your lats, traps, rear delts, and biceps. Barbell rows are a good choice if you want to build overall back strength and muscle mass.",
"4. Dumbbell Rows": "Dumbbell rows are a unilateral exercise that allows you to work each side of your back independently. Dumbbell rows are a good choice if you want to correct muscle imbalances or if you find barbell rows uncomfortable.",
"5. Cable Rows": "Cable rows are a versatile exercise that can be performed with a variety of grips and attachments. Cable rows are a good choice if you want to target specific areas of your back or if you want to add variety to your workouts."
}
}
}
