{"leg_extension": {"form": {"Steps": "\n1. Adjust the machine so that you are correctly positioned. Your knees should be in line with the machine's joint. \n2. Extend your knees with control, until they are completely straight. \n3. Slowly lower the weight again.", "Form": "\n- **Positioning**: Adjust the machine so that it fits your body properly. Make sure that the joint of the machine aligns with your knee joint, and that the back pad is adjusted so that you can press your back against it. \n- **Movement**: When you’ve ensured you have a good position in the machine, brace your core and start the movement by extending your legs as far as possible. Keep the motion slow and controlled to maximize muscle engagement. Make sure not to overextend your knees in the top position."}, "tempo": "3110", "commonMistakes": "\n1. **Adding too much weight**: Loading more weight than you can handle can increase the risk of injury and probably lead to using excessive momentum to move the weight. It’s not only a way of making the exercise less effective, but it can increase your injury risk. Keep the movement slow and controlled. \n2. **Not activating your core**: Not activating your core, and therefore arching your lower back during the exercise can lead to discomfort and also move the focus from your quads. Let them do the work, and keep your back pressed firmly against the backrest during the entire movement. \n3. **Too short range of motion**: Not fully extending your legs reduce the effectiveness of the exercise. Aim for a long and consistent movement, and go as far as possible without compromising form.", "comments": "The seated leg curl is an isolation exercise for the quadriceps. Whether your goal is to get big quads or to get stronger legs, the leg extension is a great exercise to incorporate into your workout routine.", "alternativesAndVariations": "\n1. **Squat**: The king of all exercises! It can initially feel scary, but it’s a great exercise once you master it. Apart from your quads, the barbell squat also targets your glutes, adductors, and lower back. \n2. **Leg Press**: The leg press requires less balance, control, and mobility than the barbell squat. This means that this exercise can be easier to start with for a beginner and also that you can train closer to muscular failure without thinking about balance. The leg press targets your quads, but also your glutes, adductors, and hamstrings. \n3. **Hack Squat**: The hack squat is like a mix of the barbell squat and the leg press. The upright body position gives you a movement reminding of the barbell squat (or even the front squat), but the stability of the machine is more similar to the leg press. It targets your quads, glutes, and adductors."}}
