{
    "leg-press": {
        "form": {
            "Steps": "\n1. Adjust the machine so that you only need to extend your legs slightly to be able to release the weights. Adjust the safety pins so that they catch the weight if you are unable to lift it. \n2. Place your feet on the platform, about shoulder-width apart. \n3. Inhale and lower the weight by bending your legs. \n4. Lower the weight as deep as possible without rounding your back and while keeping your glutes on the seat. \n5. Press the weight back up again as you exhale.",
            "Form": {
                "Feet": "Place your feet shoulder-width apart, centered on the platform, with toes pointing slightly outward. You can change the placement of your feet depending on what muscles you want to focus on and also depending on how you’re built. For some people, it might be hard to go deep enough with their feet shoulder-width apart, and therefore more suitable to widen the stance a bit.",
                "Core and Back": "Make sure to brace your core throughout the movement. You can grasp the handles on either side of the seat or use safety straps, if available, to stabilize your upper body as well. You don’t want any movement in your lower back, so make sure to reverse the movement before your back starts rounding.",
                "The movement": "Inhale as you slowly bend your knees, lowering the platform until your thighs are close to your chest. Exhale while forcefully pushing through your heels, extending your legs to return the platform to the starting position without locking your knees. Make sure to keep the movement controlled and not let your knees fall inwards."
            }
        },
        "tempo": "2110",
        "commonMistakes": {
            "Cutting off depth.": "Since the leg press allows you to add much more weight than, for example, the barbell squat, it’s easy to get greedy and add more weight - without noticing that you start to cut off the depth. You still want the full range of motion, so make sure you do full reps before adding more weight.",
            "Going too deep.": "Going deeper than your mobility allows will add unnecessary pressure to the lower back and is an injury risk you want to avoid. Make sure to have your lower back and butt still during the entire set, and reverse the movement before you feel any rounding of your lower back or your butt leaving the seat.",
            "Overextending the knees.": "By fully locking out the knees, you’ll add a lot of pressure to the joints instead of the muscles working. Make sure that you stop the movement before overextending the knees."
        },
        "comments": {
            "Introduction": "The leg press is a popular leg exercise that, compared with barbell squats, requires less balance, control, and mobility. This means that this exercise can be easier to start with for a beginner and also that you can train closer to muscular failure without thinking about balance. Many people can use much heavier weights in the leg press than in the barbell squat, but you will probably get the best training effect if you prioritize form and range of motion over weight.",
            "How Many Sets and Reps Should You Do in the Leg Press?": "The number of reps you do in the leg press could be guided by the general recommendations of rep ranges for achieving different goals within strength training. For muscle growth, around 6–15 reps per set. For strength, around 3–8 reps per set. There are no clear-cut lines between these two goals, however. Training in the “muscle growth range” will still increase your strength, and training in the “strength range” will still cause your muscles to grow. It’s just a matter of what you are emphasizing. How many sets you do of an exercise depends on your training experience, how many times you work out in a week, and your other training. But around ten sets per week for a given muscle group is a good starting point, and you can go even higher when you are used to training or if you stop your sets short of failure. Since the leg press is an exercise that includes several muscles in your legs, you need to look at how much work you’re putting into those muscles overall and not just in the leg press. A lot of lifters like to add the leg press as a finisher after their squats or deadlifts to add more volume to their leg workouts without stressing their lower back by adding more sets of barbell exercises. They often stay in the higher rep range while doing leg presses, between 8-15 reps. Maybe 3–4 sets of leg presses per workout and 1–2 workouts per week are a good starting point. After a couple of weeks, you can evaluate and see if you think that you might benefit from adding some more."
        },
        "alternativesAndVariations": {
            "Hack Squat": "The hack squat is almost like a mix of the barbell squat and the leg press. The machine offers you stability similar to the leg press, but the upright body position is more resemblant to the squat.",
            "Belt Squat": "The belt squat isn’t as stable as the leg press but is still more stable than the barbell squat. By moving the weight placement from your shoulders, like in the barbell squat, to your waist, the belt squat will also move some tension from your lower back.",
            "Barbell Squat": "The barbell squat is a good alternative to the leg press if you don’t have access to machines. It is a more complex exercise than the leg press, and it’s harder to reach muscular failure in the squat."
        }
    }
}