{
    "machine-chest-fly": {
        "form": {
            "Steps": "\n1. Adjust the back support and handles so that you can grip the handles at shoulder height and get a long range of motion. \n2. With just a slight bend in the arms, push the handles forward until they meet in front of your body. \n3. With control, let the handles go back to the starting position.",
            "Form": {
                "Positioning": "Make sure to adjust the machine so that you have the handles of the machine in chest height. Keep you chest up and core braced, with a proud posture. Your arm should be slightly bent, just so that your elbows won’t be overextended. Keep your arms in the same position during the entire movement.",
                "Movement": "Keep the movement slow and controlled. Make sure that you keep your back against the back rest at all times, and that you don’t use any momentum to get the weight moving."
            }
        },
        "tempo": "3110",
        "commonMistakes": {
            "Incorrect seat position": "It’s important to set the machine to the right height, so that the joint of the machine are aligned with your chest/shoulders. If it’s too high or too low, it can strain your shoulders unnecessarily.",
            "Not keeping form": "You should always keep a slight bend in your elbows throughout the exercise and keep your back pressed against the backrest. This is to avoid unnecessary strain on your joints and shifting focus from the targeted muscles."
        },
        "comments": {
            "Targeted muscle activation": "The machine helps to isolate the chest muscles and lets you focus on that rather than stabilization and balance.",
            "Constant tension": "Compared to chest flyes with dumbbells, the machine chest fly offers constant tension during the entire movement."
        },
        "alternativesAndVariations": {
            "Standing Cable Chest Fly": "The standing cable chest fly offers more versatility in the movement and the range of motion than the machine chest fly since the cables allows for a more free range of motion. The machine chest fly, on the other hand, offers a more guided and stable movement and supports your body and isolates the chest muscles more directly.",
            "Standing Resistance Band Chest Fly": "If you don’t have access to a a gym, you can also do standing chest flyes with a resistance band. Just attach it at chest height and work with one side at a time. The constant tension in the movement is similar to the machine version. The downside is that it’s harder to adjust the resistance with the banded version.",
            "Dumbbell Chest Fly": "The dumbbell chest fly is a classic chest exercise that only uses a bench and a pair of dumbbells. Because of this, the dumbbell fly is an accessible chest exercise that you can do in most gyms, and even in home chest workouts. A drawback of the dumbbell chest fly is that the resistance curve is not as evenly distributed as in the machine chest fly, and your chest muscles are mostly loaded in the bottom position."
        }
    }
}