{
"oblique-crunch": {
"form": {
"steps": "\n1. Lie on your back with your knees bent and feet flat on the floor. Place your hands lightly behind your head, supporting your neck without pulling on it. \n2. Engage your core and lift your shoulder blades off the ground, focusing on using your oblique muscles to twist your upper body. Bring your right elbow towards your left knee. \n3. Slowly lower back down to the starting position, maintaining tension in your obliques. \n4. Repeat the movement on the other side, bringing your left elbow towards your right knee.",
"form": {
"Torso": "Keep your chest lifted and focus on the twisting motion coming from your obliques, not just your neck or shoulders.",
"Neck": "Maintain a neutral neck position throughout the exercise. Avoid pulling on your head with your hands.",
"Range of Motion": "Focus on quality of movement over quantity. It's better to perform a controlled crunch with a shorter range of motion than to strain your neck or use momentum.",
"Breathing": "Exhale as you crunch up and inhale as you lower back down."
}
},
"commonMistakes": {
"Pulling on the Neck": "Avoid pulling on your head with your hands, which can strain your neck. Keep your hands lightly behind your head for support.",
"Using Momentum": "Focus on using your oblique muscles to lift and twist your upper body, rather than using momentum from swinging your arms or legs.",
"Limited Range of Motion": "Make sure to fully engage your obliques by twisting your torso enough to feel the contraction in your obliques.",
"Holding Breath": "Remember to breathe throughout the exercise. Exhale as you crunch and inhale as you lower."
},
"comments": {
"Variations": "The oblique crunch can be varied by lying on a soft training ball (i.e. pilates/bosu ball), which can increase the challenge to your core stability.",
"Progressive Overload": "You can increase the load by holding a weight against your chest as you perform the exercise.",
"Mind-Muscle Connection": "Focus on contracting your obliques throughout the exercise to maximize muscle activation."
},
"alternativesAndVariations": {
"Side Plank": "An isometric exercise that targets the obliques, requiring you to hold your body sideways in a straight line supported by your forearm and feet.",
"Russian Twist": "A dynamic exercise that involves twisting your torso from side to side while holding a weight or medicine ball.",
"Bicycle Crunches": "A variation of the crunch that targets both the abs and obliques, mimicking a cycling motion with your legs while twisting your torso.",
"Cable Woodchop": "A cable machine exercise that involves rotating your torso diagonally while resisting the weight of the cable."
},
"tempo": "2011 (2 seconds lowering, 0 seconds pause at the bottom, 1 second lifting, 1 second pause at the top)"
}
}
