{
    "overhead-press": {
        "form": {
            "Steps": "\n1. Place a barbell in a rack at about chest height. \n2. Grip the bar slightly wider than shoulder-width apart, and step close to it. \n3. Inhale, lightly brace your core, and unrack the bar. \n4. Let the bar rest against your front delts while you step back from the rack. \n5. Press the bar up to straight arms while exhaling. \n6. Inhale at the top or while lowering the bar with control back to your shoulders. \n7. Repeat for reps.",
            "Form": {
                "1. Stance and Posture": "Stand with your feet about shoulder-width apart, toes pointing slightly outward. Maintain an upright torso with a slight natural arch in your lower back. Keep your core engaged throughout the exercise to stabilize your spine.",
                "2. Hand Position and Grip": "Grip the bar slightly wider than shoulder-width, with your thumbs wrapped around the bar (overhand grip). Position the bar across your upper chest, just above your collarbones. Maintain a secure and firm grip throughout the lift.",
                "3. Wrist Position": "Keep your wrists neutral or slightly extended (bent back). Avoid flexing your wrists, as this can put stress on the joint and compromise stability.",
                "4. Elbow Position": "Start with your elbows positioned slightly in front of the bar, creating a natural angle with your forearms. As you press upward, keep your elbows from flaring out too much. Aim for a path where the bar travels directly overhead in a vertical line.",
                "5. Shoulder Blades": "Before you lift, pull your shoulder blades down and back, as if trying to pinch them together. Maintain this retracted shoulder blade position throughout the entire exercise. This helps stabilize your shoulder joints and provides a more solid base for pressing.",
                "6. Breathing": "Inhale as you lower the bar towards your chest and exhale as you press it overhead. Avoid holding your breath, as this can lead to increased blood pressure.",
                "7. Movement Control": "Perform the entire movement with control and precision. Avoid using momentum or jerking the weight up. Focus on smooth, deliberate movements, both on the ascent and descent."
            }
        },
        "tempo": "2011",
        "commonMistakes": {
            "1. Not keeping your shoulders down": "By letting your shoulders shrug up towards your ears, you’ll make the movement less efficient, increase the stress on the shoulder joint, and could cause discomfort in the neck and shoulder area rather than exercising the targeted muscles.",
            "2. Half reps": "Since the overhead press is quite a heavy exercise, it’s easy to start to cut off depth to be able to do more reps. Don’t do this. Focus instead on maintaining a full range of motion (in line with your mobility). If the movement is too heavy, add a resistance band to reduce some of the weight.",
            "3. Not maintaining form": "Using momentum, swinging the body to complete the movement, arching your lower back, and/or flaring your elbows out to the sides, rather than relying on controlled, targeted muscle activation, is a common mistake while doing overhead presses.",
            "4. Using a thumbless grip": "Firstly, it is not allowed in powerlifting. More importantly, it is also known as the suicide grip. This is because you can easily slip and drop the bar with a high risk of injury. Don’t use it."
        },
        "comments": {
            "Grip": "There are two major points to consider regarding how you grip the bar: \n1. Your thumb must be on the opposing side of your other fingers, meaning that you grip around the bar. I strongly recommend that you avoid using a thumbless grip. \n2. The bar should rest in a comfortable place. As you’re lifting heavier and heavier weights, this might become tricky. For most people, the most comfortable and stable position is to hold the bar as close to the base of your palm as possible, i.e. close to or directly above your wrist. This minimizes the leverage the bar works on your wrist and makes it easier to hold. Combining the two points (keeping your thumb around the bar, while still keeping it low in your hand) above might be tricky, and one solution is to slightly rotate your hands inwards so that the barbell rests in a diagonal line in your palm. Don’t keep a completely straight wrist. This puts you at risk of losing balance, tilting your wrist forward, and dropping the barbell. Instead, tilt your wrist back slightly, to better rest the barbell in your hand.",
            "Elbow Position": "Where should your elbows be during the lift: close to your body or out to the sides? It depends on your grip width, your anatomy, and also your purpose with bench pressing. Grip width generally determines elbow position, with a wide grip typically leading to your elbows pointing out, and a close grip leading to your elbows being closer to your sides. If you bench press in order to grow your chest muscles, a rather wide elbow position and a wide grip is effective. If you bench press in order to train your triceps, a close grip with your elbows close to your sides is effective. If you want to lift as much weight as possible, something in between (around 45° to your sides) is probably best. You will, however, have to experiment for yourself and see what feels the best and suits your body.",
            "How Many Sets and Reps Should You Do in the Overhead Press?": "How many reps you should do of an exercise depends on your goal: do you mainly want to increase your strength or build muscle? Generally, a lower rep range of about 1–5 reps per set (>85% of 1RM) is most effective for strength gains, while a medium-high rep range of about 8–15 reps per set is the most effective and practical for muscle growth. Of course, you will get a little bit of both no matter what rep range you train in, but you can emphasize one or the other slightly by working in the right number of reps. Personally, I think the standing press lends itself best to a low or medium number of reps: somewhere between 1–8 reps per set. How many sets you do of an exercise depends on your training experience, how many times you work out in a week, and your other training. But around ten sets per week for a given muscle group is a good starting point, and you can go even higher when you are used to training or if you stop your sets short of failure."
        },
        "alternativesAndVariations": {
            "Seated Overhead Press": "In contrast to the standing press, the seated barbell overhead press (also called seated shoulder press) is performed while seated on a bench or chair with a backrest. This overhead press variation gives more stability, as you can brace your back against the backrest, which can help prevent arching the back excessively and maintain proper form. Additionally, the seated position may be more comfortable for lifters with mobility or balance issues. Less focus on balance and more focus on the primary muscles worked is generally good for building muscle, which probably explains why the seated overhead press is commonly favored by bodybuilders, and the standing overhead press is favored by athletes, weightlifters, and strongmen/strongwomen. If your main goal is to build bigger shoulders and you don’t care about “functional strength”, the seated shoulder press is a great option. If you want to build big, strong shoulders and work your core muscles, balance, and coordination, the standing overhead press is for you.",
            "Seated Dumbbell Shoulder Press": "With the seated dumbbell shoulder press, we’ve ventured even further into bodybuilding training territory. Like in the seated barbell press, the bench provides stability and lets you focus on the muscles worked. With dumbbells, you usually get a little more range of motion than a barbell, which can further aid your muscle growth. The dumbbells can also enable you to use a slightly different movement path, which can feel easier on your shoulder joints.",
            "Shoulder Press Machine": "The machine shoulder press is another stable exercise in which you have eliminated virtually any need for balancing or coordination. This lets you focus entirely on working your shoulder muscles without worrying about anything else. The shoulder press machine is also suitable for senior training or others with compromised balance. On the negative side, no machine fits every person in the way that free weights suit almost every body type. A particular machine might be constructed in a way that does not feel comfortable for your body.",
            "Smith Machine Press": "A better machine for shoulder pressing might be the smith machine shoulder press. This machine will fix the barbell path for you but will still fit all body types. All you have to do is set up a bench underneath the barbell to comfortably press it up to straight arms over your head. Because of the stability of the machine and the bench, this is another exercise where you can focus on exhausting your muscles without worrying about balance.",
            "Push Press": "Let’s leave the machines and seated exercises and check out a real power exercise. The push press adds a kicking start to the strict press, where you bend and then forcefully extend your knees to give the barbell momentum. This enables you to use more weight – much more when you’ve mastered the technique. If the seated shoulder press variants allow you to focus on your shoulders and triceps and not think about coordination or functional strength, the push press goes in a completely different direction. This can be seen in the difference between the press-to-push press ratio between regular gym-goers and Olympic weightlifters. While the regular gym-bro can lift maybe 10–20% more weight in the push-press than their strict press, an Olympic weightlifter can often lift 50–100% more weight.",
            "Kettlebell Press": "Don’t have access to a barbell? A kettlebell is a cheap, easily stored alternative for your home shoulder workouts. Being a free-weight exercise and one-handed to boot, the kettlebell press will definitely challenge the stabilizing musculature in your core and shoulder joints. Besides, by training unilaterally (with one side at a time), you can identify and address side-to-side differences in strength and mobility.",
            "Standing Dumbbell Shoulder Press": "The standing shoulder dumbbell press differs from the regular overhead press in that you use dumbbells instead of a barbell. This single change in equipment does, however, significantly increase the instability in the exercise and also the amount of shoulder mobility necessary. Because of how you grip and balance the barbell, you seldom need to point your arms all the way up like you do with dumbbells. Typically, you will have a slightly wider grip on a barbell, turning your top arm position into more of a Y-shape than the dumbbell exercise. And in the seated dumbbell shoulder press, you usually have a bit of an incline on the bench which you can lean back on, also decreasing the amount of shoulder movement. Personally, I think the standing dumbbell shoulder press is unnecessarily unstable and mobility-demanding to effectively build strength and muscle, but its utility depends on your fitness goals.",
            "Overhead Press Behind the Neck": "This article wouldn’t be complete without covering the behind-the-neck overhead press. As the name says, this is an overhead press variation where the barbell begins behind your neck instead of in front of you. This typically leads to a more upright torso position and greater activation in your lateral deltoids and rear deltoids. You don’t see behind-the-neck presses very often in today’s gyms, but they used to be a bodybuilding staple back in the day. One reason for its fall to obscurity might be the claim that pressing behind the neck is bad for your shoulders. While behind-the-neck pressing may require a bit more shoulder mobility than pressing in front of the neck, it is not a dangerous exercise provided you have normal range of motion in your shoulders. If you don’t, some behind-the-neck presses might be just the thing to improve it. The behind-the-neck press typically leads to a more strict technique because cheating is difficult, and most people must use a lighter weight in behind-the-neck presses."
        }
    }
}