{
    "pause-squat": {
        "form": {
            "Steps": "\n1. Place the bar on your upper back, inhale and brace your core slightly, and unrack the bar. \n2. Take two steps back, and adjust your foot position. \n3. Squat as deep as possible with good technique. \n4. Stop in the bottom position, and make a distinct pause. \n5. Stand up again. Exhale on the way up, or exchange air in the top position. \n6. Inhale and repeat for reps.",
            "Form": {
                "Foot Position": "E: CONTINUE WITH FOOT POSITION.",
                "Bar Grip": "\n1. Your thumb must be on the opposing side of your other fingers, meaning that you grip around the bar. I strongly recommend that you avoid using a thumbless grip. Firstly, it is not allowed in powerlifting. More importantly, it is also known as the suicide grip. This is because you can easily slip and drop the bar with a high risk of injury. Don’t use it. \n2. The bar should rest in a comfortable place. For most people, the most comfortable and stable position is to hold the bar as close to the base of your palm as possible, i.e. close to or directly above your wrist. This minimizes the leverage the bar works on your wrist and makes it easier to hold. Combining the two points (keeping your thumb around the bar, while still keeping it low in your hand) above might be tricky, and one solution is to slightly rotate your hands inwards so that the barbell rests in a diagonal line in your palm.",
                "Wrist Position": "Don’t keep a completely straight wrist. This puts you at risk of losing balance, tilting your wrist forward, and dropping the barbell. Instead, tilt your wrist back slightly, to better rest the barbell in your hand.",
                "Elbow Position": "Where should your elbows be during the lift: close to your body or out to the sides? It depends on your grip width, your anatomy, and also your purpose with bench pressing. Grip width generally determines elbow position, with a wide grip typically leading to your elbows pointing out, and a close grip leading to your elbows being closer to your sides. If you bench press in order to grow your chest muscles, a rather wide elbow position and a wide grip is effective. If you bench press in order to train your triceps, a close grip with your elbows close to your sides is effective. If you want to lift as much weight as possible, something in between (around 45° to your sides) is probably best. You will, however, have to experiment for yourself and see what feels the best and suits your body.",
                "Shoulder Position": "Your shoulders are mobile joints. But when you’re bench pressing, you want to trade some of that mobility for stability. Therefore, you will want to contract the scapulae (pull your shoulder blades down and back before you unrack the bar), and keep them in this position throughout the lift. If you don't know what this means, visualize that you’re putting them in your back pockets, but on the opposing side, i.e. your right shoulder blade into your left back pocket, and vice versa. Note that you will have to “set” your shoulder blades in this manner before you even unrack the bar, because when you’ve got a heavy bar in your hands, it’s too late. Then, your shoulder blades stay in this position until you re-rack the barbell again. That means you will keep your shoulder blades retracted and pulled down even as you’re pressing the bar up, which might require some practice. Pulling your shoulder blades down and back and keeping them in this position during your entire set will protect your shoulder joints and provide you with a solid base, enabling you to lift more."
            }
        },
        "tempo": "31X0: A 3-second eccentric phase emphasizes control and maximizes muscle activation in the hole. The 1-second concentric phase ensures a powerful drive out of the bottom. The pause at the bottom (X) can vary (2-5 seconds) based on training goals. No pause at the top keeps the set challenging and promotes continuous tension. Why? The pause squat is all about control and power out of the hole, making this tempo ideal.",
        "commonMistakes": {
            "Not going deep enough": "Since the pause squat is quite a heavy exercise, it’s easy to start to cut off depth to be able to do more reps. Don’t do this. Focus instead on maintaining a full range of motion (in line with your mobility).",
            "Not maintaining form": "Using momentum, swinging the body to complete the movement, arching your lower back, and/or flaring your elbows out to the sides, rather than relying on controlled, targeted muscle activation, is a common mistake while doing pause squats."
        },
        "comments": {
            "Benefits": "\n- Better Depth: Are you struggling to squat deep? Then the pause squat is your friend! Begin with a light weight, plop down, and try to get deeper and deeper. \n- More Consistent: Are some of your squats deep but some high? By spending more time in the bottom position, you get a better idea of how that depth feels in your body and engrain the behavior of squatting to a consistent depth. \n- Gain Squat Confidence: Are you scared of squatting deep? The paused squat is your exposure therapy! Once again, begin with light weights, get down there, and get used to it. Gradually add weight and see your confidence soar. \n- More Control: By slowing things down, you get more control and more time to feel how your body is moving. This can help you address and correct issues in your technique. If you don’t want your hips to shoot up faster than the bar, for instance, the paused squat can be a tool to address that. \n- Keep the Useful: By pausing in a challenging position, you force your body to optimize and effectivize your muscle recruitment. Your body will strive to contract only the muscles necessary for the job and relax in the other muscles to save energy. Keep what is useful; discard the rest. \n- Starting Power: Even after just a few weeks of pause squats, you’ll feel a different kind of leg strength. Pausing at the bottom will increase your rate of force development from a static position, which is useful in all sorts of situations. \n- Do More With Less: If you are going through some injury issues or, for other reasons, want to keep the load down, the pause squat is a great way to keep training and increasing your strength while using a little less weight than in the regular squat. This effect is compounded by the fact that pause squats slow things down and offer more control, which is an excellent thing in rehabilitation.",
            "Carryover to Deadlifts": "This is speculation, but the pause squat feels much more similar to the start of a deadlift than regular, dynamic squats. I think there is a chance that pause squats will carry over more to deadlifts than regular, dynamic squats. Perhaps because both have a dead start?"
        },
        "alternativesAndVariations": {
            "Similar exercises": "\n1. Squat: The traditional squat, without a pause, allows for a more dynamic movement and greater use of the stretch-reflex. \n2. Box Squat: The box squat, with a pause on a box, can be used to improve squat depth and technique, but the pause is typically longer and the focus is on form rather than explosiveness. \n3. Front Squat: The front squat, with the barbell held in front of the shoulders, shifts the emphasis to the quads and requires a more upright torso, making it a good complement to the pause squat."
        }
    }
}