{
    "pause-deadlift": {
        "form": {
            "Steps": "\n1. Step up close to the bar, so that it is about over the middle of your foot. \n2. Inhale, lean forward, and grip the bar. \n3. Hold your breath, brace your core slightly, and lift the bar. \n4. Pause the movement when the bar is just a few inches above the floor. \n5. After a pause of a second or two, complete the lift by pulling the bar close to your body, until fully extended. \n6. Lower the bar back to the ground with control. \n7. Take another breath, and repeat for reps.",
            "Form": {
                "Back": "Maintain a neutral spine throughout the lift, with your chest up and shoulders back. Avoid rounding or arching your back to prevent injury.",
                "Hips": "Hinge at the hips to lower your torso, keeping your shins vertical and your weight over the middle of your foot.",
                "Breathing": "Take a deep breath and brace your core before lifting the bar. Hold your breath during the lift to maintain intra-abdominal pressure and protect your spine."
            }
        },
        "tempo": "X1X1: X seconds for the lift compound 1 second to lift the bar just a few inches above the floor + 1-2s to pause there = 1s to lift explosively as in the normal deadlift. Then, 1 second to pause at the top, then X seconds (2-4 seconds) to control the movement on the way down, and 1 second to pause at the bottom. Why? The explosive concentric phase (1 second) helps you generate enough momentum to get through the transition, while the 1-2s help you clean up your technique. The controlled eccentric phase (2-4 seconds) emphasizes strength and stability in the dip portion. The pause at the top reinforces good form and prevents using momentum for the next rep.",
        "commonMistakes": {
            "Rounding or Arching back":"Maintain a neutral spine throughout the lift, with your chest up and shoulders back. Avoid rounding or arching your back to prevent injury.",
            "Pause less than one second":"In pause deadlift, you should pause long enough for your body to be forced to effectivize the position and muscle recruitment pattern. This is usually at least 1-2 seconds. With regard to how time seemingly dilates when you hold a paused deadlift, this means that you should probably count to at least three before resuming the pull."
        },
        "comments": {
            "Benefit: Clean Up Your Deadlift Technique":"The hardest part of the deadlift is, in general, the beginning off the floor. When you pause in the most challenging position of the deadlift, your body will automatically search for the most mechanically advantageous position. Most likely, this will engrain keeping the barbell pressed close to your body and your center of gravity above your midfoot. This tends to happen subconsciously and is generally not something you need to think about. Just pause and let your body figure out where to hold the barbell. You will then carry this newfound technique with you into the regular deadlift.",
            "Benefit: Turn Off, Turn On":"When you’re staying in a hard position, you need to conserve energy. Again, your body will try to optimize. You’ll decrease activity in muscles that do not need to be tense in this position and only contract the ones that have to. This will make your deadlift more efficient and decrease the risk of you unintentionally having your foot on the brakes by tensing the antagonist muscles.",
            "Stop close to the floor to improve your standard deadlift":"For most people (even those who fail their deadlifts near the top), the deadlift is determined at the start. Strength is specific and gained mostly around the joint angles you train. And in the pause deadlift, I recommend you pause close to the start of the lift. This is the best exercise you can do to get stronger off the floor.",
            "Back Muscles of Wired Steel": "Isometric training is far more effective for building muscle than most people think. By spending more time with your low back muscle fibers exerting high force in the paused position, you will stimulate muscle growth effectively and in a directed manner to this critical muscle group.",
            "Easy but Hard Training":"Pause deadlifts let you work your muscles and strength effectively in a critical position, but with less weight than you’d need for a similarly stimulating workout of regular deadlifts. This can help in decreasing joint stress while still providing a great training stimulus. It also makes the pause deadlift a great choice of exercise for a second, lighter deadlift workout every week.",
            "How to Incorporate Paused Deadlifts in Your Training":"If you want to add paused deadlifts to your training routine, begin by just adding a few sets initially in order to avoid increasing your training volume by too much too soon. Program-wise, around 5–15% lighter than your typical deadlift training weight (for a similar number of reps) is reasonable once you get the hang of it. Paused exercises of any variety, not just deadlifts, don’t lend themselves well to high rep numbers. Instead, stick with a low number of reps per set and focus on doing high-quality reps. If you want to increase the volume, do more sets instead. Something like 3–5 sets of 2–4 reps with 60–75% of your deadlift 1RM is a good workout once you’ve got the technique down, but start lighter if you’ve never done them before."
        },
        "alternativesAndVariations": {
            "1. Band-Assisted Ring Muscle-Ups": "Like training wheels for a bike, band-assisted muscle-ups use a rubber band to lighten the load as you perform the skill. It also gives you the exact experience of a muscle-up, since that's precisely what you do, but only with an unloaded bodyweight. Use a band with appropriate resistance. Attach it to one of the rings and place one foot in the other end. From here the instructions are exactly the same as a regular, not band-assisted muscle up.",
            "2. Jumping Ring Muscle-ups": "This variation uses the same principles as the band version, except you now borrow strength from an explosive jump instead of a rubber band. Use a box of self-selected height. Start on top of the box with bent knees and straight arms/elbows. Keep a firm grip on the rings. Jump hard simultaneously as you pull yourself up to get through the transition part and into the bottom of the dip. Find a balanced and secure position to land at the bottom of the dip. Try to squeeze the rings against your body (torso or stomach) before continuing the movement with the finishing dip press.",
            "3. Negative/Eccentric Ring Muscle-Ups": "Start at the top of a ring dip with extended elbows. Slowly descend towards the bottom of the dip, focusing on controlling the movement as you lower yourself. When you feel like you've reached the bottom of the movement, it's time to realize that you haven't. Go even deeper as you approach the trickiest part—the transition. At the bottom of the dip, you lean slightly back as you simultaneously turn the rings inwards with the palm side towards the body and the rings close to your armpits. When the rings have turned 180 degrees, you should now find yourself in a “chest to ring pull up top -position.” From here, you lower yourself to the bottom of the ring pull-up position, and you're done.",
            "4. Low Ring Variation to Band-Assisted Strict Muscle Up": "This variation might allow for a more comfortable experience if height is considered one of your unpreferred locations. Other than that the principles remain the same as  for band-assisted muscle ups in the high rings."
        }
    }
}