{"reverse_dumbbell_flyes": {"form": {"Steps": "\n1. Stand with your feet about hip-width apart. Lean forward by tilting your hips, ensuring to keep your spine straight (neutral spine). Brace your core. \n2. Hold a pair of dumbbells and let your arms hang towards the floor. Your arms should be in the same position during the entire movement, with a slight bend in the elbow. \n3. With almost straight arms, slowly lift the dumbbells by raising your arms out to the sides. \n4. Lift them up until they are just about level with your body. You don’t have to overextend the movement. \n5. Reverse the movement and lower the dumbbells back to the starting position.", "Form": {"Avoid shrugging your shoulders": "Focus on drawing your shoulder blades together as you lift the dumbbells.", "Pick a light weight": "You should be able to perform the movement slowly and controlled without starting to hinge and creating excessive momentum."}}, "tempo": "3110", "commonMistakes": {"1. Picking too heavy dumbbells": "Choosing a pair of dumbbells that are heavier than you can handle, might make you use excessive momentum or other muscles than the targeted ones to complete the lift, compromising the exercise’s effectiveness and potentially leading to injury.", "2. Not keeping form": "This is an exercise where it’s easy to start using a swinging motion to help lift the weights. This can place unnecessary stress on the lower back and shoulder joints. Keep the movement slow and controlled."}, "comments": {"Better posture": "Strengthening the muscles in your upper back can help pull your shoulders back and contribute to a better posture.", "Balanced shoulder development": "Many lifters have stronger pushing muscles due to focusing on exercises that work the front of the body, like the bench press. The reverse dumbbell fly helps strengthen the rear deltoids, helping you to achieve a more balanced muscle development."}, "alternativesAndVariations": {"1. Reverse Cable Fly": "This variation allows for constant tension throughout the full movement since the direction of resistance can be adjusted according to the cable’s setup. The cable machine allows for a more controlled and stable motion, which might be appreciated by the beginner. However, setting up the cable machine can be more complex than simply grabbing a pair of dumbbells.", "2. Reverse Machine Fly": "The reverse machine fly is another effective rear delt exercise that, like the reverse cable fly, keeps your muscles under constant load. It might also be a good alternative for beginners or someone who wants to focus fully on the targeted muscles, because the machine provides stability and guides you through the right movement path."}}}
