{
"ring_muscle_up": {
"form": {
"Steps": "\n1. Grip the rings with a false grip (Your wrists flexed, and your knuckles through the rings). \n2. Initiate the movement by powerfully pulling the rings to your chest or armpits. \n3. When you reach the transition point between pulling and pushing, lean forward as you simultaneously turn the rings outwards while keeping the rings close to your armpits. \n4. When the rings have turned 180 degrees, you should now find yourself above the rings, in a bottom dip position. \n5. From here, press yourself to the top of the dip with extended elbows.",
"Form": {
"1. False Grip": "I can’t stress the importance of this enough. Not using a false grip when doing muscle-ups is like not using toilet paper after your post-morning coffee bathroom visit. It’s solvable but so much harder. This odd and quite uncomfortable grip is most often required for a smooth transition above the rings. The false grip could be described as a midpoint between a pull-up grip and a dip grip, eliminating the need for a grip switch in the transition. Try to grip the ring with as much hand through the rings as possible, leading the wrists to bear more of the load in the grip. Another helpful tip is not to grip the rings in their lowest part but more towards the side, leaving the wrists in a (still not comfortable but) more comfortable position thanks to the possibility of more side-bending than straight wrist bending.",
"2. Strong Pull": "It’s crucial to pull hard from the start. This will give you the needed speed to, as much as possible, avoid a slow and grinding transfer."
}
},
"tempo": "10X1: 1 second to lift explosively, X seconds (2-4 seconds) to control the movement on the way down, and 1 second to pause at the top. Why? The explosive concentric phase (1 second) helps you generate enough momentum to get through the transition. The controlled eccentric phase (2-4 seconds) emphasizes strength and stability in the dip portion. The pause at the top reinforces good form and prevents using momentum for the next rep.",
"commonMistakes": {
"1. Dividing the Movement Into More Parts Than Necessary": "One common mistake is how I’ve described a muscle up until now: As a pull-up + transition + dip = Muscle-up. In reality, trying to achieve a muscle-up by executing it divided into three separate steps makes it harder than it already is. A better way is to really visualize the muscle-up as one fluid movement from the bottom to the top. Simple but not easy! Try to really gather strength from the pull all the way through the transition into the dip, like punching through a wall, instead of hesitating and breaking your hand on its surface.",
"2. Not Pulling High Enough": "Another common mistake somewhat related to the first is the pulling height. Though a ring pull-up is usually executed with a finishing height where you shoulders are level with the rings, this is not enough to get into the transition above the rings. Instead, you need at least a height of rings-to-the-armpits before leaning yourself over the rings. A helpful visualization could be to execute the pulling part with a proud chest, slightly arched back, and more of an around-the-ring path. This will help you create some height to the pulling movement and also put you in a favorable position for a smoother transition transfer.",
"3. Not Being Strong Enough": "Even though this isn’t a mistake, it could be a problem if it’s the major limiting factor in fulfilling your goals. Simply put, it doesn’t matter how flexible, coordinated, and good-looking you are. If you’re not strong enough to pull yourself up to the rings and beyond, it’s hard to complete the task of a strict muscle up. So, if you’re born with another superpower than strength, make sure to put in the worthwhile work to achieve that too!"
},
"comments": {
"What is a Strict Ring Muscle-Up?": "Imagine if a ring pull-up and ring dip had a baby – that’s essentially what a ring muscle-up is. The strict ring muscle-up involves pulling your body from a hanging position, with straight arms below the rings, through a tricky transition into a ring dip. It’s like a symphony of controlled strength, technique and shoulder mobility, requiring the coordination of multiple muscle groups to together execute the movement with elegance and grace. It’s performed strictly, unlike its sophisticated older sibling, the kipping version, without force-generating elements like swing-like movements.",
"How Strong Do You Need to Be to Do a Strict Ring Muscle-Up?": "While there’s no need to bench press a small car, you should be able to handle your body weight with ease. Here’s a quick strength checklist: \n1. Solid Pull-Up Strength: If you can crank out a few pull-ups with the finesse of a monkey reaching for a banana snack, you’re on the right track. Around 8–12 strict pull-ups should do. \n2. Respectable Dip Strength: Dips should feel like a casual stroll in the park, not an uphill battle against gravity.",
"Progression exercises": "To build up to a full ring muscle-up, you can break down the movement into smaller, more manageable exercises. Here are a few examples: \n1. Ring Rows: This is a great way to start strengthening and preparing your pulling muscles on the road to a strict muscle up. However, to manage a strict ring muscle-up, you also need the strength of a strict ring pull-up. So use ring rows as a strength-building tool if this is where you are right now, but make sure to challenge yourself with the ring pull-up as soon as you’ve unlocked that strength level. \n2. Strict Ring Pull-up: This movement is basically as straightforward as it sounds. Pull yourself up from a hanging position. But, since it’s in this case practiced for a greater purpose, the strict ring muscle-up, it’s a good idea to strive after as much of a muscle-up-like execution as possible. With this in mind, try to really pull yourself high. Lift your chest and pull the rings towards your armpits. Maybe hold the top position for a second before returning down in a controlled manner. \n3. Deep Dips: Get those shoulders ready for action with deep dips! The principle is simple: lower yourself until you are deeper down the rabbit hole than you’ve ever been before. However, it’s wise to practice this in a progressively larger range of motion over time since the deep dip position might be something your shoulders are not used to yet. So start digging the hole a little deeper, rest until your next dip session, continue digging a little deeper from there, and so on. Soon, you’ll be able to explore even the deepest rabbit holes with power, flexibility, and confidence.",
"Kipping Muscle-Up": "A somewhat controversial way of executing a muscle-up is the kipping version. Kipping can provide valuable height to the pulling part of the muscle-up. An effective kip might even work as a direct progression from a rubber band and give you that extra boost to get through the hard transition part. But, since this is a guide on the strict muscle-up, we will leave the kipping option here as a taster for future exercise guides.",
"In Summary": "The strict ring muscle-up is great for impressing your friends. It shows off control, strength, technique, and shoulder mobility in an elegant and coordinated muscle dance. Muscle-ups are also to be considered more like a task or skill (like jumping, climbing, etc.) than a straight-on muscle-building strength exercise like bicep curls. To achieve a strict muscle-up, it’s good to have enough strict strength, some patience, and a willingness to explore new ways through or around encountered challenges. We hope this guide will help you from the bottom of the rings to the top of your potential and a happier you!"
},
"alternativesAndVariations": {
"1. Band-Assisted Ring Muscle-Ups": "Like training wheels for a bike, band-assisted muscle-ups use a rubber band to lighten the load as you perform the skill. It also gives you the exact experience of a muscle-up, since that’s precisely what you do, but only with an unloaded bodyweight. Use a band with appropriate resistance. Attach it to one of the rings and place one foot in the other end. From here the instructions are exactly the same as a regular, not band-assisted muscle up.",
"2. Jumping Ring Muscle-ups": "This variation uses the same principles as the band version, except you now borrow strength from an explosive jump instead of a rubber band. Use a box of self-selected height. Start on top of the box with bent knees and straight arms/elbows. Keep a firm grip on the rings. Jump hard simultaneously as you pull yourself up to get through the transition part and into the bottom of the dip. Find a balanced and secure position to land at the bottom of the dip. Try to squeeze the rings against your body (torso or stomach) before continuing the movement with the finishing dip press.",
"3. Negative/Eccentric Ring Muscle-Ups": "Start at the top of a ring dip with extended elbows. Slowly descend towards the bottom of the dip, focusing on controlling the movement as you lower yourself. When you feel like you’ve reached the bottom of the movement, it’s time to realize that you haven’t. Go even deeper as you approach the trickiest part—the transition. At the bottom of the dip, you lean slightly back as you simultaneously turn the rings inwards with the palm side towards the body and the rings close to your armpits. When the rings have turned 180 degrees, you should now find yourself in a “chest to ring pull up top -position.” From here, you lower yourself to the bottom of the ring pull-up position, and you’re done.",
"4. Low Ring Variation to Band-Assisted Strict Muscle Up": "This variation might allow for a more comfortable experience if height is considered one of your unpreferred locations. Other than that the principles remain the same as  for band-assisted muscle ups in the high rings."
}
}
}
