{
    "rowing-machine": {
        "form": {
            "Steps": "\n1. Catch: The rowing stroke begins with the catch. The catch occurs when the seat of the rowing machine is all the way forward as close as possible to the front of the machine or monitor. At the catch position, your knees are bent so that they are coming up towards your chest, and your shins should be perpendicular to the floor. Your body is essentially in a tuck position. You should have a slight forward lean to your torso, which should be initiated by hinging from your hips rather than rounding your back. Make sure to keep your back straight by engaging your core muscles and thinking about keeping your shoulders down and back. In terms of the degree to which your torso should be angled forward, if you picture a clock with 12 o’clock being completely vertical and upright, hinge towards the front of the rowing machine as if your spine is angled to the 11 o’clock position. \n2. Drive: From the catch position, you will move into the drive. The drive is where most of the power and pressing in the rowing stroke occurs. To begin the drive, you should press your feet against the footplates of the rowing machine as explosively as possible. As mentioned, in the catch position, your body is in a tuck with your knees fully bent and your shins vertical to the ground. With the drive, you will extend your legs by straightening your knees as you push the rowing machine seat down the rail away from the monitor. The movement of the drive should be initiated by the legs, primarily the quads and glutes. You should envision yourself trying to perform a jump squat against the footplates. After pushing as hard as possible with your legs, you then activate the core muscles to hinge at the hips and swing your body from the forward leaning position held at the catch to an upright position. In other words, use your core to move from the 11 o’clock position to the upright 12 o’clock position. Then, engage your lats in your back, your shoulders, and your arms to pull the handlebar towards your sternum. Essentially, the drive should be a sequential pattern of activating your legs first, then your core muscles, then your back and arms together. However, the movement should be seamless so that there is a smooth and fluid flow between these three body regions as you explode away from the front of the rowing machine. \n3. Finish: The drive phase of the rowing stroke ends at the finish, which is the third phase. The finish is where the core muscles are most active. Here, you need to eccentrically engage your abdominal muscles (lengthening under tension) to control your hip hinge and the angle of your torso. At the end of the finish, your torso should be reclined slightly to the 1 o’clock position. Remember to keep your back straight. You should capitalize on the momentum generated by your powerful hip hinge to help drive the handlebar of the rowing machine all the way into your sternum. You should use the muscles in your arms (such as your deltoids in the shoulders, biceps in the upper arms, and brachioradialis in the forearms) to help bend your elbows and internally rotate your arms to maximize the length of the stroke. \n4. Recovery: The last phase of the rowing stroke is referred to as the recovery. The recovery is essentially the opposite of the drive, so it involves moving your body back up to the front of the rowing machine to the catch position. Because the drive involves pressing first with your legs, then engaging your core muscles for the hip hinge, and finally pulling with your arms, the recovery involves performing these three muscle activation stages in reverse. Therefore, you will first straighten your arms, then hinge forward using your core muscles, and finally, bend your knees by engaging your hamstrings until you are back up to the front of the rowing machine.",
            "Form": "Many novice rowers categorize rowing as primarily an upper-body exercise. While it is true that rowing machine workouts use upper-body muscles more so than an activity like cycling or walking, the list of rowing machine muscles worked extends well beyond just the biceps, triceps, and shoulders. Beginners who are unfamiliar with the correct rowing machine technique often rely too heavily on the pulling motion with the arms during the rowing stroke to the detriment of maximizing the pushing motion of the legs. All of this is to say that although the rowing machine does work the muscles in your upper body, a rowing machine workout is actually a full-body workout if you use the proper rowing machine form."
        },
        "tempo": "1020",
        "commonMistakes": {
            "1. Pulling with your arms first.": "The drive should be initiated by the legs, primarily the quads and glutes. You should envision yourself trying to perform a jump squat against the footplates.",
            "2. Rounding your back.": "Make sure to keep your back straight by engaging your core muscles and thinking about keeping your shoulders down and back.",
            "3. Not fully extending your legs.": "From the catch at the front of the rowing machine to the finish at the back of the rowing machine, your knees move from full flexion to full extension.",
            "4. Not maximizing the length of your stroke.": "By fully protracting your shoulder blades during the recovery and through the catch, you can maximize the length of your rowing stroke because you can reach the handlebar further in towards the monitor of the rowing machine."
        },
        "comments": {
            "Full-body workout": "Rowing machine workouts are a full-body workout if you use the proper rowing machine form. By fully understanding the muscles worked by rowing machine workouts, you can better engage the proper muscle groups for a more efficient, powerful rowing stroke. You will also burn more calories and get a better cardiovascular and muscle-strengthening workout if you are properly activating all of the intended muscles worked by rowing machine workouts. After all, the more muscle groups you are using, or the greater the percentage of your muscle fibers you are engaging during exercise, the higher the oxygen cost of the activity. This will translate to a higher heart rate and more calories burned while simultaneously improving your performance on the rowing machine.",
            "Strengthen your heart": "Although most lists of rowing machine workout muscles focus solely on the skeletal muscles in your arms and legs, rowing is also a form of cardio exercise that strengthens your heart. Your heart is known as cardiac muscle tissue, so it is indeed a muscle. If you consistently perform rowing workouts, you will strengthen your heart muscle. This will allow your heart to contract more forcefully, which can lower your resting heart rate and heart rate during exercise. The walls of the chambers of your heart are made of cardiac muscle tissue, so a stronger heart is able to pump a greater volume of blood out to your body with every heartbeat. This means that your heart no longer needs to beat as many times per minute to meet the oxygen in nutrient needs of your muscles. Therefore, your heart can beat fewer times per minute during exercise and rest, decreasing the overall workload on your heart."
        },
        "alternativesAndVariations": {
            "Similar exercises": [
                "Barbell rows",
                "Pull-ups.",
                "Squats",
                "Deadlifts"
            ]
        }
    }
}