{
"seated-smith-machine-shoulder-press": {
"form": {
"steps": "\n1. Adjust the seat height of the Smith machine bench so that when you sit down, the bar is at about shoulder height. \n2. Sit down on the bench and place your feet flat on the floor, slightly wider than shoulder-width apart. \n3. Grip the bar with an overhand grip, slightly wider than shoulder-width apart. Your forearms should be vertical when your elbows are bent at a 90-degree angle. \n4. Unrack the bar by straightening your arms, and lower it to the starting position at the top of your chest. \n5. Press the bar up to straight arms, while exhaling. \n6. Inhale at the top, or while lowering the bar with control back to your chest. \n7. Repeat for reps.",
"form": {
"Grip": "Overhand grip, slightly wider than shoulder-width apart.",
"Back": "Maintain a neutral spine throughout the exercise. Avoid arching your back.",
"Head": "Keep your head in a neutral position, looking straight ahead. Avoid tilting your head forward or backward.",
"Elbows": "Keep your elbows slightly bent throughout the movement. Avoid locking out your elbows at the top of the movement.",
"Range of Motion": "Lower the bar until it gently touches the top of your chest, and press it up until your elbows are almost fully extended."
}
},
"commonMistakes": {
"Using too much weight": "Using a weight that is too heavy can lead to improper form and increase the risk of injury. Start with a lighter weight and gradually increase the weight as you get stronger.",
"Arching your back": "Arching your back can put stress on your lower back. Keep your core engaged and your back straight throughout the exercise.",
"Lowering the bar too far down": "Lowering the bar too far down can put stress on your shoulder joints. Stop lowering the bar when it reaches the top of your chest.",
"Locking out your elbows": "Locking out your elbows at the top of the movement can put stress on your elbow joints. Keep your elbows slightly bent throughout the movement.",
"Not controlling the weight": "It's important to control the weight throughout the entire movement, both during the concentric (lifting) and eccentric (lowering) phases. Avoid using momentum to lift the weight."
},
"comments": {
"Muscle groups used": "The seated Smith machine shoulder press primarily targets the front deltoids, with secondary involvement from the triceps and lateral deltoids.",
"Fixed Plane of Motion": "The Smith machine provides a fixed plane of motion, which can be beneficial for beginners who are still developing their stability and control. It allows you to focus on the target muscles without having to worry about balancing the barbell.",
"Safety": "The Smith machine also offers a higher level of safety compared to free weights, as the bar is fixed to the machine and cannot be dropped. This can be especially beneficial for lifters who are working out alone.",
"Progression": "As you get stronger, you can increase the weight on the Smith machine or transition to free weight exercises like the barbell shoulder press or dumbbell shoulder press to challenge your stability and coordination further."
},
"alternativesAndVariations": {
"Barbell Shoulder Press": "A compound exercise that works the same muscle groups as the Smith machine shoulder press, but with a greater emphasis on stability and control due to the free weight.",
"Dumbbell Shoulder Press": "A variation that allows for a greater range of motion and independent movement of each arm, further challenging your stability and coordination.",
"Arnold Press": "A variation of the dumbbell shoulder press that involves rotating the dumbbells as you press them up, engaging more of the shoulder muscles.",
"Lateral Raises": "An isolation exercise that targets the lateral deltoids, helping to build wider shoulders."
},
"tempo": "2011 (2 seconds lowering, 0 seconds pause at the bottom, 1 second lifting, 1 second pause at the top)"
}
}
