{"seated_dumbbell_shoulder_press": {"form": {"Steps": "\n1. Sit down on a bench with a raised backrest. \n2. Grab a pair of dumbbells and lift them up to the starting position at your shoulders. \n3. Inhale and lightly brace your core. \n4. Press the dumbbells up to straight arms while exhaling. \n5. Inhale at the top or while lowering the dumbbells with control back to your shoulders. \n6. Repeat for reps.", "Form": "Keep your feet firmly on the ground, and keep an upright position. Brace your core and keep your back pressed against the backrest. Remember to keep your chest up and shoulders back. Press the dumbbells up in a controlled manner until your arms are fully extended but without locking your elbows. Make sure to maintain tension in your core during the entire movement. Each rep should be done with control, and the movement should come solely from the shoulder and arm muscles, not from creating any momentum or bouncing movements."}, "tempo": "2011", "commonMistakes": { "1. Arching your lower back excessively": "This can put stress on your spine. Make sure to keep your back firmly pressed against the bench and your core engaged throughout the exercise.", "2. Using momentum": "Using body momentum or a bouncing motion in the bottom position to help lift the weights takes away from the effectiveness of the exercise."}, "comments": {"General": "The dumbbell shoulder press is a shoulder exercise that involves pressing a pair of dumbbells while sitting down on a bench. Using dumbbells means the demand for shoulder stability is higher, and you can use a long range of motion. By sitting down, you reduce the need for core stabilization and can focus on working your shoulder muscles.", "Benefits": "\n- Boulders for shoulders: The dumbbell shoulder press is good for developing your shoulder muscles and increasing their mass. \n- Improves shoulder mobility and stability: Overhead presses require (and develop) great shoulder mobility and stability, which can be especially beneficial for athletes and weightlifters. Regular practice of this exercise can help improve shoulder strength and flexibility, reduce the risk of injury, and enhance performance in other exercises. \n- Allows you to work on any muscular imbalances: Since each arm works independently when using dumbbells, you can ensure both sides of your body are working equally. This can help you address any differences between the sides.", "How Many Sets and Reps Should You Do in the Seated Dumbbell Shoulder Press?": "How many reps you should do of an exercise depends on your goal: do you mainly want to increase your strength or build muscle? Generally, a lower rep range of about 1–5 reps is most effective for strength gains, while a medium-high rep range of about 8–15 reps per set is the most effective and practical for muscle growth. Of course, you will get a little bit of both no matter which rep range you train in, but you can emphasize one or the other slightly by working in the right number of reps. When it comes to the seated dumbbell shoulder press, most lifters tend to lean towards the muscle growth rep range. How many sets you should do of an exercise depends on your training experience, how many times you work out in a week, and your other training. But around ten sets per week for a given muscle group is a good starting point, and you can go even higher when you are used to training or if you stop your sets short of failure. For many lifters, 3–4 sets per workout and 1–3 workouts per week would be a good starting point. Begin with that and see if you grow and get stronger from it. Later on, if you think you might benefit from cranking up your training volume, you can try adding a set per workout (or add a workout) and see what happens."}, "alternativesAndVariations": {"1. Overhead Press": "The barbell overhead press is a classic shoulder exercise that is excellent for developing full-body strength and coordination. Because you are supporting a heavy weight in the standing position, you have to provide all the stability yourself, from your hips, core, and shoulder muscles. The seated dumbbell shoulder press, however, isolates the shoulder muscles more and involves less core and hip stabilization. Dumbbells also allows for a greater range of motion and the ability to correct any imbalances between the arms.", "2. Machine Shoulder Press": "The machine shoulder press provides more stability than the seated dumbbell shoulder press, which can be beneficial for beginners or people with compromised balance. It is also generally easier to set up. Because machines reduce the need for balancing and stabilization, they allow you to focus more on the muscles worked compared to free weight exercises. On the other hand, dumbbell presses allow for a greater range of motion and engage more of the shoulders' stabilizing muscles.", "3. Seated Barbell Overhead Press": "The seated barbell overhead press is a shoulder press variation that uses a barbell instead of a pair of dumbbells. Using a barbell typically lets your lift heavier weight than when using a dumbbell, because the need for stabilization is lower. The increased stability might help you focus more on working your shoulder muscles.", "4. Seated Smith Machine Shoulder Press": "The seated Smith machine shoulder press offers even more stability and enable you to focus even more on working your pressing muscles. It does not, however, provide any stabilization training, and not every lifter might like the fixed movement path."}}} 
