{
"side-lunges-bodyweight": {
"form": {
"steps": "\n1. Stand up straight with your feet together and plenty of space to your sides for you to step out. \n2. Lightly brace your core, and take a big step to the side (left or right). \n3. As you step, push your hips back, bend your trailing knee, and lower your body until the knee of your leading leg is bent at around a 90-degree angle and your trailing leg is close to touching the floor. Keep your torso relatively upright throughout the movement. \n4. Push yourself back up by pressing through the heel of your leading foot to return to the starting position. \n5. Repeat for reps, alternating sides.",
"form": {
"Torso": "Keep your torso upright and your core engaged throughout the movement.",
"Leading Leg": "As you lunge, ensure your leading knee tracks in line with your toes and doesn't extend beyond them.",
"Trailing Leg": "Keep your trailing leg straight or slightly bent, with your heel remaining in contact with the ground.",
"Hips": "Push your hips back as if you were sitting in a chair, maintaining a neutral spine.",
"Weight Distribution": "Focus on distributing your weight evenly across your leading foot, avoiding any pressure on your toes."
}
},
"commonMistakes": {
"Not Lunging Low Enough": "Failing to lower your hips sufficiently, reducing the activation of your glutes and quads.",
"Leading Knee Caving Inward": "Allowing your leading knee to collapse inward, which can strain the knee joint.",
"Heels Lifting off the Ground": "Lifting your heels off the ground during the lunge, indicating improper weight distribution and potential strain on the knees.",
"Not Controlling the Movement": "Rushing through the exercise without maintaining control, increasing the risk of injury and reducing effectiveness."
},
"comments": {
"Muscle Activation": "Side lunges primarily target the quadriceps, glutes, and inner thighs (adductors). They also engage the hamstrings and core for stability.",
"Balance and Coordination": "This exercise is beneficial for improving balance, coordination, and lateral movement, which are essential for various physical activities.",
"Progression": "To increase the challenge, you can hold dumbbells in each hand or wear a weighted vest.",
"Home Workout Friendly": "Side lunges are an excellent exercise for home workouts as they require no equipment and minimal space."
},
"alternativesAndVariations": {
"Lateral Lunges with Dumbbells": "Holding dumbbells in each hand during side lunges increases the resistance and muscle activation.",
"Side Lunge to Curtsy Lunge": "Combine a side lunge with a curtsy lunge by stepping your trailing leg diagonally behind you, targeting the inner thighs and glutes further.",
"Skater Lateral Lunges": "Perform a side lunge while simultaneously swinging your trailing leg behind your leading leg in a skating motion, enhancing balance and coordination.",
"Lateral Band Walks": "Place a resistance band around your legs, above your knees, and take small steps sideways, engaging the hip abductors and glutes."
},
"tempo": "2010 (2 seconds lowering, 0 seconds pause at the bottom, 1 second lifting, 0 seconds pause at the top)"
}
}
