{
"side-plank": {
"form": {
"steps": "\n1. Lie on your side with your legs extended and your feet stacked on top of each other. \n2. Prop yourself up on your forearm, ensuring your elbow is directly below your shoulder. \n3. Engage your core and raise your hips off the ground, forming a straight line from your head to your heels. \n4. Hold this position, breathing steadily, for the desired duration.",
"form": {
"Body Alignment": "Maintain a straight line from head to heels, avoiding sagging or hiking hips.",
"Elbow Position": "Keep your elbow directly beneath your shoulder.",
"Core Engagement": "Actively engage your core muscles to stabilize your spine and prevent sagging.",
"Shoulder and Neck": "Keep your shoulder blades pulled down and back, and your neck neutral, in line with your spine."
}
},
"commonMistakes": {
"Sagging Hips": "Allowing your hips to sag towards the ground, which reduces core activation and can strain your lower back.",
"Hunched Shoulders": "Rounding your shoulders forward, which can lead to neck and shoulder pain.",
"Holding Breath": "Remember to breathe steadily throughout the hold.",
"Incorrect Elbow Position": "Positioning your elbow too far forward or backward from your shoulder can strain your joints."
},
"comments": {
"Muscle Groups": "The side plank primarily targets the obliques (side abs), but it also engages the core muscles, shoulders, and glutes.",
"Progression": "To increase the challenge, you can lift your top leg, add weight by holding a dumbbell or weight plate, or perform the exercise on an unstable surface like a Bosu ball or balance board.",
"Variations": "The side plank can be modified by performing it with your bottom knee on the ground for a less challenging variation.",
"Benefits": "Strengthening your obliques can improve core stability, balance, and posture."
},
"alternativesAndVariations": {
"Forearm Plank": "A full-body exercise that targets the core, shoulders, and back. The main difference is that it engages both sides of the body simultaneously.",
"Bird Dog": "An exercise that challenges core stability and balance by extending opposite arm and leg. It targets similar muscle groups but involves movement.",
"Pallof Press": "An anti-rotation exercise that strengthens the obliques and core by resisting rotation. It's performed with a cable machine or resistance band.",
"Russian Twists": "An exercise that targets the obliques by rotating the torso from side to side. It can be performed with a weight or medicine ball for added resistance."
},
"tempo": "0030 (0 seconds lowering, 0 seconds pause at the bottom, 3 seconds holding the isometric contraction, 0 seconds pause at the top). You can start with a shorter hold time and gradually increase it as you get stronger. It's generally better to focus on maintaining perfect form for a shorter duration than struggling to hold a longer side plank with compromised technique."
}
}
