{
"split-jerk": {
"form": {
"steps": "\n1. Start with the bar racked across the front of your shoulders, similar to the front squat position. Your feet should be hip-width apart, toes pointed slightly outward. \n2. Dip down by slightly bending your knees, keeping your torso upright and core engaged. This dip should be quick and explosive, using it to generate momentum for the upward drive. \n3. Drive upwards with your legs, extending your hips and knees powerfully. As the bar rises, transition your feet into a split stance, one leg forward and one leg back, landing softly on the balls of your feet. \n4. As you catch the bar overhead, lock your elbows out and stabilize the weight. Your front knee should be slightly bent, and your back leg should be straight with your heel slightly raised. \n5. Drive through your front foot to return to a standing position with your feet together, maintaining control of the bar overhead. \n6. Lower the bar back to the starting position with control, either by reversing the movement or gently guiding it down to your shoulders.",
"form": {
"Grip": "Grip the bar slightly wider than shoulder-width apart, using a pronated grip (palms facing away from you).",
"Elbows": "Keep your elbows high and forward, pointing straight ahead throughout the movement.",
"Back": "Maintain a neutral spine throughout the exercise, avoiding any excessive arching or rounding.",
"Core": "Engage your core muscles to stabilize your spine and transfer power efficiently.",
"Foot Placement": "When you split your feet, aim for a comfortable stance that allows you to catch the bar overhead with stability. The distance between your front and back foot will vary depending on your individual body mechanics."
}
},
"commonMistakes": {
"Not Dipping Properly": "A shallow or slow dip will not generate enough power for the jerk.",
"Not Keeping the Bar Close": "Allowing the bar to drift away from your body will make the lift less efficient and potentially dangerous.",
"Not Splitting the Feet Quickly Enough": "Hesitating during the split can cause instability and make it difficult to catch the bar overhead.",
"Landing with Flat Feet": "Landing on your heels can put excessive stress on your joints and reduce power absorption.",
"Not Locking Out the Elbows": "Failing to fully extend your elbows when catching the bar overhead can lead to instability and potential injury."
},
"comments": {
"Explosive Movement": "The split jerk is a highly technical and explosive movement that requires coordination, timing, and power. It's essential to practice with lighter weights to develop proper technique before increasing the load.",
"Weightlifting Origins": "The split jerk is a staple exercise in Olympic weightlifting, often performed after the clean to lift the weight overhead.",
"Full-Body Engagement": "While primarily targeting the shoulders, the split jerk engages multiple muscle groups throughout the body, including the legs, core, back, and arms.",
"Progression": "As you progress, you can increase the weight, focus on faster transitions, and work on increasing the depth of your split."
},
"alternativesAndVariations": {
"Power Jerk": "Similar to the split jerk, but instead of splitting the feet, you perform a slight dip and drive the weight overhead, catching it with a slightly wider than shoulder-width stance.",
"Push Press": "A simpler overhead pressing movement that involves using a dip and leg drive to assist in pressing the weight overhead. Unlike the jerk, the push press does not involve splitting the feet.",
"Dumbbell Split Jerk": "A variation using dumbbells instead of a barbell, allowing for unilateral training and potentially improving balance and coordination.",
"Overhead Press": "A strict overhead pressing movement that focuses on shoulder strength and stability. Unlike the jerk variations, the overhead press does not involve any leg drive."
},
"tempo": "1010 (1 second lowering, 0 seconds pause at the bottom, 1 second lifting, 0 seconds pause at the top)"
}
}
