{
    "standing-cable-chest-fly": {
        "form": {
            "Steps": "\n1. Fasten a pair of handles in the top position of a cable cross. Grip the handles, step forward, and lean slightly forward.\n2. With just a slight bend in the arms, push the handles forward until they meet in front of your body.\n3. With control, let the handles go back to the starting position.",
            "Form": {
                "1. Positioning": "Make sure to stand at the same distance from each cable pulley. You want to be centered between them and then take a few steps forward so that the pulleys are slightly behind you. Some lifters like to stand with one foot in front of the other, while others want to stand in a parallel stance. Regardless, make sure to brace your core and have a slight tension in your legs and glutes to get a stable position. You might also want to have a slight forward lean in order to target your chest muscles better, especially if you have the cables attached to the upper part of the machine.",
                "2. Movement": "Keep your elbows slightly bent, and hold them in the same position during the entire movement. You want the movement to occur in your shoulder joints by contracting your chest muscles, and not in the elbows. Keep elbows and wrists at the same angle during the entire movement. Do the movement slowly and controlled, and make sure not to start swinging your body to create excessive momentum."
            }
        },
        "tempo": "3110",
        "commonMistakes": {
            "1. Adding too much weight": "Adding more weight than you can handle is easy. If you add too much weight, you’ll have to include other muscles to do the movement or start to swing and thereby lose form.",
            "2. Not keeping a strict form": "Don’t turn the chest fly into a chest press by bending your elbows more than just slightly. Also, don’t create momentum from your hips or upper body; do the movement slowly and controlled."
        },
        "comments": "The cable chest fly is an isolation exercise for the chest and front deltoids. Compared to dumbbell chest flyes, the resistance curve in cable flyes is more evenly distributed, and the load on your chest muscles is more constant throughout the range of motion.",
        "alternativesAndVariations": {
            "1. Dumbbell Chest Fly": "A classic chest exercise that only uses a bench and a pair of dumbbells. A drawback of the dumbbell chest fly is that the resistance curve is not as evenly distributed as in the cable chest fly, and your chest muscles are mostly loaded in the bottom position.",
            "2. Standing Resistance Band Chest Fly": "If you don’t have access to a cable machine or dumbbells, you can also do standing chest flyes with a resistance band. Just attach it at chest height and work with one side at a time. The constant tension in the movement is similar to the cable version. The downside is that it’s harder to adjust the resistance with the banded version.",
            "3. Machine Chest Fly": "The standing cable chest fly offers more versatility in the movement and the range of motion than the machine chest fly since the cables allows for a more free range of motion. The machine chest fly, on the other hand, offers a more guided and stable movement and supports your body and isolates the chest muscles more directly."
        }
    }
}