{
"standing_resistance_band_chest_fly": {
"form": {
"Steps": "\n1. Attach the band to a door or something similarly stable around chest level.\n2. In a standing position, grab the band with one hand and move away from the anchor point until you feel a stretch and resistance in your chest muscles. \n3. Pull the band in front of your body at chest height with a slight bend at the elbow. \n4. Contract your chest muscle before returning to the starting position with a controlled movement and repeat for reps. \n5. Switch to the other side of your body and perform the above steps again.",
"Form": {
"1. Positioning": "After grabbing the resistance band in your hand, move away from the anchor point until you feel a stretch and resistance in your chest muscles. Keep your chest up, stand with your feet about shoulder-width, and brace your core.",
"2. Movement": "Extend your arm out to your side at chest height, and keep a slight bend in your elbow. Push your hand forward until it’s in front of your chest, and make sure to keep your wrist and elbow in the same position the entire time. Remember that it should be your chest muscles doing the work, so keep the rest of your body as still as possible."
}
},
"tempo": "2012",
"commonMistakes": {
"1. Not keeping proper form": "Remember to have a proud posture and keep your shoulders down and back during the entire movement. Not keeping form shifts the focus from the targeted muscles and makes the exercise less effective.",
"2. Moving too fast": "You should keep the movement slow and controlled to make this exercise effective. Moving too quickly will probably make the exercise less effective, and the resistance band will probably start to wobble and make the resistance uneven."
},
"comments": "The resistance band chest fly is an isolation exercise for the chest and front deltoids. Compared to dumbbell chest flyes, the resistance curve in band chest flyes is more evenly distributed, and you have more of a constant load on your chest muscles throughout the whole range of motion.",
"alternativesAndVariations": {
"1. Standing Cable Chest Fly": "The constant tension in the cable chest fly is similar to the resistance band version. It’s easier to adjust the resistance with the cable version though, and the movement might feel a bit smoother than the banded version.",
"2. Machine Chest Fly": "The machine chest fly offers a more guided and stable movement, and supports your body, and isolates the chest muscles more directly. This might be a good alternative for the beginner lifter or for anyone that wants to be able to focus 100 percent on the working muscles.",
"3. Dumbbell Chest Fly": "The dumbbell chest fly is a classic chest exercise that only uses a bench and a pair of dumbbells. Because of this, the dumbbell fly is an accessible chest exercise that you can do in most gyms and even in home chest workouts. A drawback of the dumbbell chest fly is that the resistance curve is not as evenly distributed as in the cable chest fly, and your chest muscles are mostly loaded in the bottom position."
}
}
}
