{"tricep_pushdown_with_bar": {"form": {"Steps": "\n1. Stand one step away from the cable pulley, and grip a bar about shoulder-width apart. \n2. Pull the handle down until your upper arms are perpendicular to the floor. This is the starting position. \n3. Push the handle down until your arms are fully extended. \n4. With control, let the handle up again.", "Form": {"1. Positioning": "Stand with your feet shoulder-width apart, keep your core braced, and make sure to keep your back straight. If you need to lean slightly forward, make sure to tilt from your hips rather than arching your back. Remember to keep your elbows close to your sides, and locked in.", "2. Movement": "Make sure to perform the movement slow and controlled. The only movement that should happen is in your elbow joint, so keep your body still and try not to create excessive momentum."}}, "tempo": "3011", "commonMistakes": {"1. Arching your back": "Some people tend to lean too far forward or arch their back, which can put unnecessary strain on the lower back and shift the focus away from the triceps.", "2. Using too much weight": "This often leads to using momentum to complete the exercise, instead of relying on the strength of the triceps. This not only reduces the effectiveness of the exercise but can also lead to injury. Make sure to pick a weight where you can do the movement with control."}, "comments": {"How Many Sets and Reps Should You Do in the Tricep Pushdown With Bar?": "Generally, a lower rep range of around 1–5 reps is effective for strength gains, and a medium-to-high rep range of about 8–15 reps per set is effective for muscle growth. For the triceps pushdown, using heavy weights and low reps feels uncomfortable in the elbows for many people, and using lighter weights and doing more reps can alleviate this. How many sets you do of an exercise depends on your training experience, how many times you work out in a week, and your other training. Still, around ten sets per week for a given muscle group is a good starting point, and you can go even higher when you are used to training or if you stop your sets short of failure. Remember that the triceps are involved in pressing exercises as well, and not just in tricep isolation exercises."}, "alternativesAndVariations": {"1. Tricep Pushdown With Rope": "Using a rope instead of a bar in tricep pushdowns could allow for a longer range of motion since you can separate the ends of the rope and continue the motion without the bar hitting your body. It also changes your grip from overhand to neutral, but this has minimal to no effect on your triceps activation. Both a rope and a bar are good alternatives, so try both and see which one you like best.", "2. Overhead Cable Triceps Extension": "The overhead cable triceps extension is one of the best triceps exercises you can do. The cable provides constant tension on your muscles, and the elevated arm position engages the long head of the triceps, which is also the largest triceps head.", "3. Dumbbell Lying Triceps Extension": "The dumbbell lying triceps extension is a great triceps exercise that, similar to the overhead cable tricep extension, also works your long triceps head. Performing lying triceps extensions with dumbbells also lets you notice any side differences in strength since you’re working with one dumbbell in each hand. It can be more challenging for beginners, though, due to the coordination and balance needed to control the dumbbells independently, whereas the tricep pushdown offers a more stable movement.", "4. Tricep Bodyweight Extension": "This is a good alternative for triceps training if you don’t have access to free weights. You can make this exercise easier by placing your hands high and harder if you place your hands low."}}}
